quizData = {
title: 'Тест на определение профориентации Е.А. Климова',
questions: [
{
number: 0, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Ухаживать за животными.', type: 'radio', value: 'a'}, 
	{answer: 'Обслуживать машины, приборы (следить, регулировать).', type: 'radio', value: 'b'}, 
]
},
{
number: 1, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Помогать больным.', type: 'radio', value: 'a'}, 
	{answer: 'Составлять таблицы, схемы, программы для вычислительных машин.', type: 'radio', value: 'b'}, 
]
},
{
number: 2, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Следить за качеством книжных иллюстраций, плакатов, художественных открыток.', type: 'radio', value: 'a'}, 
	{answer: 'Следить за состоянием, развитием растений.', type: 'radio', value: 'b'}, 
]
},
{
number: 3, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Обрабатывать материалы (дерево, ткань, металл, пластмассу и т.п.).', type: 'radio', value: 'a'}, 
	{answer: 'Доводить товары до потребителя, рекламировать, продавать.', type: 'radio', value: 'b'}, 
]
},
{
number: 4, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Обсуждать научно-популярные книги, статьи.', type: 'radio', value: 'a'}, 
	{answer: 'Обсуждать художественные книги (или пьесы, концерты).', type: 'radio', value: 'b'}, 
]
},
{
number: 5, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Выращивать молодняк (животных какой-либо породы).', type: 'radio', value: 'a'}, 
	{answer: 'Тренировать товарищей (или младших) в выполнении каких-либо действий (трудовых, учебных, спортивных).', type: 'radio', value: 'b'}, 
]
},
{
number: 6, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Копировать рисунки, изображения (или настраивать музыкальные инструменты).', type: 'radio', value: 'a'}, 
	{answer: 'Управлять каким-либо грузовым (подъемным или транспортным) средством – подъемным краном, трактором, тепловозом и др..', type: 'radio', value: 'b'}, 
]
},
{
number: 7, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Сообщать, разъяснять людям нужные им сведения (в справочном бюро, на экскурсии и т. д.).', type: 'radio', value: 'a'}, 
	{answer: 'Оформлять выставки, витрины (или участвовать в подготовке пьес, концертов).', type: 'radio', value: 'b'}, 
]
},
{
number: 8, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Ремонтировать вещи, изделия (одежду, технику), жилище.', type: 'radio', value: 'a'}, 
	{answer: 'Искать и исправлять ошибки в текстах, таблицах, рисунках.', type: 'radio', value: 'b'}, 
]
},
{
number: 9, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Лечить животных.', type: 'radio', value: 'a'}, 
	{answer: 'Выполнять вычисления, расчеты.', type: 'radio', value: 'b'}, 
]
},
{
number: 10, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Выводить новые сорта растений.', type: 'radio', value: 'a'}, 
	{answer: 'Конструировать, проектировать новые виды промышленных изделий (машины, одежду, дома, продукты питания и т.п.).', type: 'radio', value: 'b'}, 
]
},
{
number: 11, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Разбирать споры, ссоры между людьми, убеждать, разъяснять, наказывать, поощрять.', type: 'radio', value: 'a'}, 
	{answer: 'Разбираться в чертежах, схемах, таблицах (проверять, уточнять, приводить в порядок).', type: 'radio', value: 'b'}, 
]
},
{
number: 12, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Наблюдать, изучать работу кружков художественной самодеятельности.', type: 'radio', value: 'a'}, 
	{answer: 'Наблюдать, изучать жизнь микробов.', type: 'radio', value: 'b'}, 
]
},
{
number: 13, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Обслуживать, налаживать медицинские приборы, аппараты.', type: 'radio', value: 'a'}, 
	{answer: 'Оказывать людям медицинскую помощь при ранениях, ушибах, ожогах и т. п.', type: 'radio', value: 'b'}, 
]
},
{
number: 14, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Художественно описывать, изображать события (наблюдаемые и представляемые)', type: 'radio', value: 'a'}, 
	{answer: 'Составлять точные описания-отчеты о наблюдаемых явлениях, событиях, измеряемых объектах и др.', type: 'radio', value: 'b'}, 
]
},
{
number: 15, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Делать лабораторные анализы в больнице.', type: 'radio', value: 'a'}, 
	{answer: 'Принимать, осматривать больных, беседовать с ними, назначать лечение.', type: 'radio', value: 'b'}, 
]
},
{
number: 16, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Красить или расписывать стены помещений, поверхность изделий.', type: 'radio', value: 'a'}, 
	{answer: 'Осуществлять монтаж или сборку машин, приборов.', type: 'radio', value: 'b'}, 
]
},
{
number: 17, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Организовать культпоходы сверстников или младших в театры, музеи, экскурсии, туристические походы и т. п.', type: 'radio', value: 'a'}, 
	{answer: 'Играть на сцене, принимать участие в концертах.', type: 'radio', value: 'b'}, 
]
},
{
number: 18, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Изготовлять по чертежам детали, изделия (машины, одежду), строить здания.', type: 'radio', value: 'a'}, 
	{answer: 'Заниматься черчением, копировать чертежи, карты.', type: 'radio', value: 'b'}, 
]
},
{
number: 19, 
question: 'Что бы Вы предпочли?', 
answers: [
	{answer: 'Вести борьбу с болезнями растений, с вредителями леса, сада.', type: 'radio', value: 'a'}, 
	{answer: 'Работать на клавишных машинах (пишущей машинке и др.).', type: 'radio', value: 'b'}, 
]
},

]
}
