<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("ПУБЛИЧНАЯ ОФЕРТА");
$APPLICATION->SetPageProperty("title", "ПУБЛИЧНАЯ ОФЕРТА");
// <div ..-bg  /div>
// <div container
// <div section
?>

<h1 class="pagetitle"><?$APPLICATION->ShowTitle();?></h1>


<div class="row ui-mediabox blogs blog-view bot-0">
		
		
		<div class="col s12 l12 ">
		
			<p align="center"><strong>о заключении договора об оказании услуг</strong></p>
<ul>
  <li><strong>Общие положения</strong></li>
</ul>
<p>В настоящей Публичной оферте содержатся  условия заключения Договора об оказании услуг (далее по тексту - «Договор об  оказании услуг» и/или «Договор»). Настоящей офертой признается предложение,  адресованное одному или нескольким конкретным лицам, которое достаточно  определенно и выражает намерение лица, сделавшего предложение, считать себя  заключившим Договор с адресатом, которым будет принято предложение.<br />
  Совершение указанных в настоящей Оферте действий  является подтверждением согласия обеих Сторон заключить Договор об оказании  услуг на условиях, в порядке и объеме, изложенных в настоящей Оферте.<br />
  Нижеизложенный текст Публичной оферты является  официальным публичным предложением Исполнителя, адресованный заинтересованному  кругу лиц заключить Договор об оказании услуг в соответствии с положениями  пункта 2 статьи 437 Гражданского кодекса РФ.<br />
  Договор об оказании услуг считается  заключенным и приобретает силу с момента совершения Сторонами действий,  предусмотренных в настоящей Оферте, и, означающих безоговорочное, а также  полное принятие всех условий настоящей Оферты без каких-либо изъятий или  ограничений на условиях присоединения.</p>
<p><strong>Термины  и определения:</strong><br />
  <strong>Договор</strong> – текст настоящей Оферты с Приложениями, являющимися неотъемлемой частью  настоящей Оферты, акцептованный Заказчиком путем совершения конклюдентных действий,  предусмотренных настоящей Офертой.<br />
  <strong>Конклюдентные действия —  это</strong> поведение,  которое выражает согласие с предложением контрагента заключить, изменить или  расторгнуть договор. Действия состоят в полном или частичном выполнении  условий, которые предложил контрагент. <br />
  <strong>Сайт  Исполнителя в сети «Интернет»</strong> – совокупность программ  для электронных вычислительных машин и иной информации, содержащейся в  информационной системе, доступ к которой обеспечивается посредством сети  «Интернет» по доменному имени и сетевому адресу: https://clinli.ru/<br />
  <strong>Стороны  Договора (Стороны)</strong> – Исполнитель и Заказчик.<br />
  <strong>Услуга</strong> – услуга, оказываемая Исполнителем Заказчику в порядке и на условиях,  установленных настоящей Офертой.</p>
<ul>
  <li><strong>Предмет Договора</strong></li>
  <ul>
    <li>Исполнитель обязуется  оказать Заказчику Услуги, а Заказчик обязуется оплатить их в размере, порядке и  сроки, установленные настоящим Договором.</li>
    <li>Наименование, количество, порядок и иные  условия оказания Услуг определяются на основании сведений Исполнителя при  оформлении заявки Заказчиком, либо устанавливаются на сайте Исполнителя в сети  «Интернет» https://clinli.ru/</li>
    <li>Исполнитель оказывает Услуги  по настоящему Договору лично, либо с привлечением  третьих лиц, при этом за действия третьих лиц Исполнитель отвечает перед Заказчиком как за свои собственные. </li>
    <li>Договор заключается путем акцепта  настоящей Оферты через совершение конклюдентных действий, выраженных в:</li>
  </ul>
  <li>действиях,  связанных с регистрацией учетной записи на Сайте Исполнителя в  сети «Интернет» при наличии необходимости регистрации учетной записи;</li>
  <li>оформлении  и направлении Заказчиком заявки в адрес Исполнителя для оказания Услуг;</li>
  <li>действиях,  связанных с оплатой Услуг Заказчиком;</li>
  <li>действиях,  связанных с оказанием Услуг Исполнителем.</li>
</ul>
<p>Данный перечень неисчерпывающий, могут быть и другие  действия, которые ясно выражают намерение лица принять предложение контрагента. </p>
<ul>
  <li><strong>Права и обязанности Сторон</strong></li>
</ul>
<p><strong>&nbsp;</strong></p>
<ul>
  <ul>
    <li><strong> Права и обязанности Исполнителя:</strong></li>
    <ul>
      <li>Исполнитель  обязуется оказать Услуги в соответствии с положениями настоящего Договора, в  сроки и объеме, указанные в настоящем Договоре и (или) в порядке, указанном на  Сайте Исполнителя.</li>
      <li>Исполнитель  обязуется предоставлять Заказчику доступ к разделам Сайта, необходимым для  получения информации, согласно пункту 2.1. Договора.</li>
      <li>Исполнитель  несет ответственность за хранение и обработку персональных данных Заказчика,  обеспечивает сохранение конфиденциальности этих данных и использует их  исключительно для качественного оказания Услуг Заказчику.</li>
      <li>Исполнитель  оставляет за собой право изменять сроки (период) оказания Услуг и условия  настоящей Оферты в одностороннем порядке без предварительного уведомления Заказчика,  публикуя указанные изменения на Сайте Исполнителя в сети «Интернет». </li>
    </ul>
  </ul>
</ul>
<p>При этом новые / измененные условия,  указываемые на Сайте, действуют только в отношении вновь заключаемых Договоров.</p>
<ul>
  <ul>
    <li><strong> Права и обязанности Заказчика:</strong></li>
    <ul>
      <li>Заказчик  обязан предоставлять достоверную информацию о себе при получении  соответствующих Услуг.</li>
      <li> Заказчик обязуется не воспроизводить, не  повторять, не копировать, не продавать, а также не использовать в каких бы то  ни было целях информацию и материалы, ставшие ему доступными в связи с  оказанием Услуг, за исключением личного использования непосредственно самим Заказчиком  без предоставления в какой-либо форме доступа каким-либо третьим лицам.</li>
      <li>Заказчик  обязуется принять Услуги, оказанные Исполнителем;</li>
      <li>Заказчик  гарантирует, что все условия Договора ему понятны; Заказчик принимает условия  без оговорок, а также в полном объеме.</li>
    </ul>
  </ul>
</ul>
<ul>
  <li><strong>Цена и порядок расчетов</strong></li>
  <ul>
    <li>Стоимость услуг Исполнителя, оказываемых  Заказчиком и порядок их оплаты, определяются на основании сведений Исполнителя  при оформлении заявки Заказчиком либо устанавливаются на Сайте Исполнителя в  сети «Интернет»: https://clinli.ru/</li>
    <li>Все расчеты по Договору производятся в безналичном  порядке. </li>
  </ul>
</ul>
<p><strong>&nbsp;</strong></p>
<ul>
  <li><strong>Конфиденциальность и безопасность</strong></li>
  <ul>
    <li>При реализации настоящего Договора Стороны  обеспечивают конфиденциальность и безопасность персональных данных в  соответствии с актуальной редакцией ФЗ от 27.07.2006 г. № 152-ФЗ «О  персональных данных» и ФЗ от 27.07.2006 г. № 149-ФЗ «Об информации, информационных  технологиях и о защите информации».</li>
    <li>Стороны обязуются сохранять  конфиденциальность информации, полученной в ходе исполнения настоящего  Договора, и принять все возможные меры, чтобы предохранить полученную  информацию от разглашения.</li>
    <li>Под конфиденциальной информацией  понимается любая информация, передаваемая Исполнителем и Заказчиком в процессе  реализации Договора и подлежащая защите, исключения указаны ниже.</li>
    <li>Такая информация может содержаться в  предоставляемых Исполнителю локальных нормативных актах, договорах, письмах,  отчетах, аналитических материалах, результатах исследований, схемах, графиках,  спецификациях и других документах, оформленных как на бумажных, так и на  электронных носителях.</li>
  </ul>
</ul>
<ul>
  <li><strong>Форс-мажор</strong></li>
  <ul>
    <li>Стороны  освобождаются от ответственности за неисполнение или ненадлежащее исполнение  обязательств по Договору, если надлежащее исполнение оказалось невозможным  вследствие непреодолимой силы, то есть чрезвычайных и непредотвратимых при  данных условиях обстоятельств, под которыми понимаются: запретные действия  властей, эпидемии, блокада, эмбарго, землетрясения, наводнения, пожары или  другие стихийные бедствия. </li>
    <li>В случае  наступления этих обстоятельств Сторона обязана в течение 30 (Тридцати) рабочих  дней уведомить об этом другую Сторону. </li>
    <li>Документ,  выданный уполномоченным государственным органом, является достаточным  подтверждением наличия и продолжительности действия непреодолимой силы. </li>
    <li>Если  обстоятельства непреодолимой силы продолжают действовать более 60 (Шестидесяти)  рабочих дней, то каждая Сторона вправе отказаться от настоящего Договора в  одностороннем порядке. </li>
  </ul>
  <li><strong>Ответственность Сторон</strong></li>
  <ul>
    <li>В случае неисполнения и/или ненадлежащего исполнения  своих обязательств по Договору, Стороны несут ответственность в соответствии с условиями  настоящей Оферты.</li>
    <li>Исполнитель не несет ответственности за неисполнение  и/или ненадлежащее исполнение обязательств по Договору, если такое неисполнение  и/или ненадлежащее исполнение произошло по вине Заказчика. </li>
    <li>Сторона, не исполнившая или ненадлежащим образом  исполнившая обязательства по Договору, обязана возместить другой Стороне  причиненные такими нарушениями убытки.</li>
  </ul>
  <li><strong>Срок действия настоящей Оферты</strong></li>
  <ul>
    <li>Оферта вступает в силу с момента размещения на Сайте Исполнителя  и действует до момента её отзыва Исполнителем.</li>
    <li>Исполнитель оставляет за собой право внести изменения  в условия Оферты и/или отозвать Оферту в любой момент по своему усмотрению.  Сведения об изменении или отзыве Оферты доводятся до Заказчика  по выбору Исполнителя  посредством размещения на сайте Исполнителя в сети «Интернет», в Личном  кабинете Заказчика, либо путем направления  соответствующего уведомления на электронный или почтовый адрес, указанный Заказчиком  при  заключении Договора или в ходе его исполнения.</li>
    <li>Договор вступает в силу с момента Акцепта условий  Оферты Заказчиком и действует до полного исполнения Сторонами обязательств по  Договору. </li>
    <li>Изменения, внесенные Исполнителем в  Договор и опубликованные на сайте в форме актуализированной Оферты, считаются  принятыми Заказчиком в полном объеме. </li>
  </ul>
</ul>
<p>&nbsp;</p>
<ul>
  <li><strong>Дополнительные условия</strong></li>
  <ul>
    <li>Договор, его  заключение и исполнение регулируется действующим законодательством Российской  Федерации. Все вопросы, не урегулированные настоящей Офертой или  урегулированные не полностью, регулируются в соответствии с материальным правом  Российской Федерации.</li>
    <li>В случае возникновения спора, который  может возникнуть между Сторонами в ходе исполнения ими своих обязательств по  Договору, заключенному на условиях настоящей Оферты, Стороны обязаны урегулировать  спор мирным путем до начала судебного разбирательства. </li>
  </ul>
</ul>
<p>Судебное разбирательство  осуществляется в соответствии с законодательством Российской Федерации. <br />
  Споры или разногласия, по  которым Стороны не достигли договоренности, подлежат разрешению в соответствии  с законодательством РФ. Досудебный порядок урегулирования спора является  обязательным.</p>
<ul>
  <ul>
    <li>В качестве языка Договора, заключаемого на  условиях настоящей Оферты, а также языка, используемого при любом  взаимодействии Сторон (включая ведение переписки, предоставление требований /  уведомлений / разъяснений, предоставление документов и т. д.), Стороны  определили русский язык.</li>
    <li>Все документы, подлежащие предоставлению в  соответствии с условиями настоящей Оферты, должны быть составлены на русском  языке либо иметь перевод на русский язык, удостоверенный в установленном  порядке.</li>
    <li>Бездействие одной из Сторон в случае  нарушения условий настоящей Оферты не лишает права заинтересованной Стороны  осуществлять защиту своих интересов позднее, а также не означает отказа от  своих прав в случае совершения одной из Сторон подобных либо сходных нарушений  в будущем.</li>
    <li>Если на Сайте Исполнителя в сети  «Интернет» есть ссылки на другие веб-сайты и материалы третьих лиц, такие  ссылки размещены исключительно в целях информирования, и Исполнитель не имеет  контроля в отношении содержания таких сайтов или материалов. Исполнитель не  несет ответственность за любые убытки или ущерб, которые могут возникнуть в  результате использования таких ссылок.</li>
  </ul>
</ul>
<ul>
  <li><strong>Реквизиты Исполнителя</strong></li>
</ul>
<p>&nbsp;</p>
<p>Полное наименование: Массальская  Наталья Михайловна <br />
  ИНН: 470404395470<br />
  ОГРН/ОГРНИП: 320470400070428<br />
  Контактный телефон: +7 911 926-86-18<br />
  Контактный e-mail: i.mirkin@yandex.ru </p>
<p>&nbsp;</p>
		
		</div>
		
</div>

<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>