<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Для соискателей");
$APPLICATION->SetPageProperty("title", "Для соискателей");

// <div ..-bg  /div>
// <div container
// <div section
?>

<h1 class="pagetitle"><?$APPLICATION->ShowTitle();?></h1>

	



	<div class="row ui-mediabox blogs blog-view bot-0">
			<div class="col s12">
					<span class="img-wrap">
					<img class="z-depth-1" style="width: 100%;" src="/assets/images/about.jpg">
					</span>
					
					<span class="small date">01 февраля 2021 года</span>
					
					<h2>Профориентационное тестирование, тематическое тестирование при приеме на работу</h2>
					<p  class="bot-0 text">Проект изначально создавался с целью помочь соискателям сформировать персональный профиль личности для устройства на определенную должность и работодателям найти сотрудников с определенными психологическими характеристиками, жизненными устремлениями.</p>


					<h2>Что важнее: личностные качества или профессионализм?</h5>

					<p>Все мы работаем в первую очередь с людьми, их характером, привычками, мотивами и если коллеги или руководитель не могут найти общего языка с сотрудником или взгляды на жизнь, деятельность компании у сотрудника не соответствуют принципам развития бизнеса, то вряд ли профессионализм такого сотрудника закроет вопрос.</p>

					<p>Кто-то как руководитель будет мириться с хамоватым главбухом, кто-то как руководитель не будет мириться с хамоватым начальником отдела проектов. Спорить об этом не имеет смысла, и каждый руководитель сделает свой выбор.</p>
					<p>Цель сайта - помочь дать оценку тем личностным качествам будущего сотрудника, которые на взгляд руководителя ему ценны. Для любого руководителя или соискателя результаты тестирования будут носить исключительно рекомендательный характер. Но мы надеемся, что наша работа поможет сформировать нужный взгляд на свои личностные особенности и, как следствие, скорректировать свое поведение, отношение и получить требуемую должность.</p>


					<h2>Как показать свои результаты заинтересованным лицам.</h2>
					<p>После прохождения теста у вас появится постоянная ссылка на результаты тестирования. Прохождение тестов возможно без регистрации, ссылка в этом случае так же появится. Мы рекомендуем регистрироваться и проходить тесты под своим аккаунтом. Так вы получаете дополнительный функционал – возможность управления тестами в личном кабинете, доступ к расширенным интерпретациям результатов тестов, а так же дополнительные профессиональные  тесты для зарегистрированных пользователей.</p>

					<h2>Всё ли на сайте бесплатно?</h2>
					<p>Все автоматизированные методики бесплатны. После прохождения тестов вы получаете значения шкал и их интерпретации.  Вы получаете все данные по результатам тестирования.
					Некоторые сложные профессиональные тесты требуют глубокого анализа. Для подробного анализа тестов можно самостоятельно изучить дополнительную литературу, которая имеется на сайте или заказать платный аудит результатов тестирования. За умеренную плату вы сможете получить подробный результат – общий или тематический.
					К платным услугам так же относится составление результатов тестирования на основании группы тестов.</p>

					

					<div class="spacer"></div>
					<div class="divider"></div>
			</div>
	</div>

<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>