<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Для работодателей");
$APPLICATION->SetPageProperty("title", "Для работодателей");
// <div ..-bg  /div>
// <div container
// <div section
?>

<h1 class="pagetitle"><?$APPLICATION->ShowTitle();?></h1>


<div class="row ui-mediabox blogs blog-view bot-0">
	<div class="col s12">
		<span class="img-wrap">
		<img class="z-depth-1" style="width: 100%;" src="/assets/images/about.jpg">
		</span>
		
		<span class="small date">01 ноября 2020 года</span>
		<p>В разделе  <a href="/about/for-candidates/" title="Для соискателей">для соискателей</a> описана основная идея сайта –помочь соискателям получить работу, а работодателям получить сотрудника, отвечающего определенным требованиям. Сайт проводит оценку личностных качеств и оценку общего уровня интеллектуального развития. Как правило мотивационных, психологических, личностных оценок достаточно для предварительного анализа кандидата. </p>
		<p>При необходимости работодатель может отправить для реализации специальный узконаправленный тест, «заточенный» исключительно для профессионального отбора в его организую. Для этого через форму обратной связи работодатель оставляет заявку, и администрация сайта рассматривает вариант внедрения.</p>
		<p>Для теста можно указать дополнительные требования – проходить только зарегистрированным пользователя, проходит только конкретным пользователям, ограничения по времени, ограничения по количеству возможных прохождений, рандомизация вариантов ответов.</p>
		<p>Мы готовы так же выслушать любые предложения по совершенствованию профессионального отбора и психологического тестирования. В дальнейшем появится возможность размещения на сайте компании виджета для прохождения тестирования.</p>

		<div class="spacer"></div>
		<div class="divider"></div>
	</div>
</div>


<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>