<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Тесты на характер");

$APPLICATION->SetPageProperty("title", "Тесты на характер онлайн - пакет диагностики типа характера, склонности к риску и акцентуаций характера");
$APPLICATION->SetPageProperty("description", "Тесты диагностики типа личнсоти и акцентуаций харакетра позволяют выявлять сильные и слабые стороны обследуемого, узнать себя ближе, скорректировать поведение и выбрать оптимальный путь развития.");
$APPLICATION->SetPageProperty("keywords", "тест на характер, тест леонгарада, тест Кейрси, тесты, онлайн, тестирование, психологические, образовательные");

$APPLICATION->SetPageProperty("bodyClass", "test");
// <div ..-bg>  </div> in header
// <div container in header
// <div section in header
?>

<div class="row">
<div class="col xl10 offset-xl1">
	<h1 class="pagetitle"><?$APPLICATION->ShowTitle(false);?></h1>
		
		
		
		<p>Формирование представлений о характере как базовой психологической характеристике личности позволяет выявить сильные и слабые стороны, узнать себя ближе, правильно оценивать положительные и отрицательные стороны, корректировать поведение и выбрать оптимальный путь саморазвития, улучшить общение с людьми и управлять как собой, так и другими. 
		Позволяет сопоставить типы характеров и узнать как вы будете взаимодействовать с тем или иным лицом. </p>
		<p>В интернете очень много непрофессиональных тестов на определение характера, некоторые из них шуточные, а некоторые могут ввести в заблуждение и серьезно навредить личности.</p>
		<br>	
		
		<h2>Пакета диагностики «Характер»</h2>
		<p>Специалисты портала CLINLI реализовали пакет диагностики, положительно зарекомендовавшим себя среди профессиональных психологов и психотерапевтов. Пакет включает в себя:</p>
		<br>
		
		<h3>Диагностика акцентуаций характера с помощью методики «Характерологический опросник К. Леонгарда»</a></h3>
		<p>Предназначен для выявления акцентуации (направления) характера. Типы личности по К. Леонгарду описываются с позиций контактности, конфликтности, сострадательности,  склонности к аморальным поступкам, раздражительности, отношения к различным типам деятельности, дружелюбия, самокритичности, исполнительности и пр. <a href="/tests/leonhard-test/" title="Пройти онлайн тест на характер К. Леонгарда" class="underline">Тест К. Леонгарда</a> можно пройти на сайте.</p>
		<br>
		<h3>Диагностика социального типа личности по тесту Кейрси</h3>
		<p>На основе концепции К.Юнга о психологических типах и опросника Майер-Бриггс для выявления различных вариантов поведения человека американским психологом Д. Кейрси был разработан <a href="/tests/keirsey-test/" class="underline" title="Пройти тест Кейрси">тест по определению психологических портретов личности (тест Кейрси)</a>. В русском переводе был адаптирован К.В. Павловым.</p>
		<br>
		<h3>Диагностика склонности к риску с помощью опросника А.Г. Шмелева</h3>
		<p>Анализ склонности к риску как черты характера имеет важное значение для психологического прогнозирования процессов принятия решения в ситуации неопределенности и поэтому является важным элементом характера. <a href="/tests/shmelev-risk-tolerance-test/" title="Пройти тест на склонность к риску с помощью опросника А.Г. Шмелева онлайн" class="underline">Тест на склонность к риску с помощью опросника А.Г. Шмелева</a> реализован и апробирован на сайте.</p>
		
		
		
		
		
</div>
</div>

 


 
 
<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>