<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("Условия покупки");
?>

<h1 class="pagetitle">Условия покупки</h1>



<div class="card contactus">
<div class="row ">
<div class="col s12 pad-0"><h5 class="bot-20 sec-tit  ">Описание и стоимость услуг</h5>  
<div>

Отдельные тесты на сайте имеют расширенную интерпретацию стоимость, которой 199 руб. 
После прохождения тестирования пользователь получает значение всех шкал их описание и краткую интерпретацию.
Для просмотра более детального результат необходимо оплатить указанную сумму.


</div>
</div>
</div>
</div>

<div class="card contactus">
<div class="row ">
<div class="col s12 pad-0"><h5 class="bot-20 sec-tit  ">Условия предоставления услуг</h5>  
<div>

Доступ к расширенной интерпретации появляется у пользователя сразу после оплаты и сохраняется неограниченное время в личном кабинете. 
При дополнении результатов расширенной интерпретации ранее оплаченные результаты обновляются автоматически без дополнительных оплат.

</div>
</div>
</div>
</div>


<div class="card contactus">
<div class="row ">
<div class="col s12 pad-0"><h5 class="bot-20 sec-tit  ">Отказ от покупки</h5>      
<div>
В случае отказа от покупки пользователю необходимо написать мотивированный отказ на адрес эл. почты mail@clinli.ru. 
Деньги зачисляются пользователю на тот же счет, с которого была произведена оплата.

</div>
</div>
</div>
</div>




<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>