<?
function howBigIsYourVocabulary($in) {
	// https://testometrika.com/intellectual/test-on-vocabulary/
	$R = 0;
	if($in[0] == 'правдивый') $R++;
	if($in[1] == 'побуждать') $R++;
	if($in[2] == 'волонтер') $R++;
	if($in[3] == 'соперничество') $R++;
	if($in[4] == 'понятный') $R++;
	if($in[5] == 'крокодил') $R++;
	if($in[6] == 'генезис') $R++;
	if($in[7] == 'аморальный') $R++;
	if($in[8] == 'неглиже') $R++;
	if($in[9] == 'амбивалентный') $R++;
	if($in[10] == 'ортодоксальный') $R++;
	if($in[11] == 'кредо') $R++;
	if($in[12] == 'банальный') $R++;
	if($in[13] == 'диффамация') $R++;
	if($in[14] == 'раритет') $R++;
	if($in[15] == 'печать') $R++;
	if($in[16] == 'портить') $R++;
	if($in[17] == 'выходка') $R++;
	if($in[18] == 'моногамия') $R++;
	if($in[19] == 'Храбрый') $R++;
	if($in[20] == 'скрытый') $R++;
	if($in[21] == 'проблема') $R++;
	if($in[22] == 'равнодушный') $R++;
	if($in[23] == 'приличный') $R++;
	if($in[24] == 'терпимый') $R++;
	if($in[25] == 'почтенный') $R++;
	if($in[26] == 'торговый') $R++;
	if($in[27] == 'кошелек') $R++;
	if($in[28] == 'законный') $R++;
	if($in[29] == 'пират') $R++;
	if($in[30] == 'вратарь') $R++;
	if($in[31] == 'возмутительный') $R++;
	if($in[32] == 'предупреждающий') $R++;
	if($in[33] == 'тактильный') $R++;
	if($in[34] == 'изречение') $R++;
	if($in[35] == 'ругать') $R++;
	if($in[36] == 'расширение') $R++;
	if($in[37] == 'жадный') $R++;
	if($in[38] == 'кошелек') $R++;
	if($in[39] == 'суетиться') $R++;
	
	
	$S['RESULT_INTEGRAL'] = round(10*$R/40, 2);
	
	if($R >= 36 ) {
		$S['RESULT_SHORT'] = 'Ваш словарный запас — <b>выше среднего</b>.';
		$S['RESULT_FULL'] = 'Ваш словарный запас <b>выше среднего</b> — '.$R.' из 40 баллов.';
	}
	elseif($R >= 29 && $R <= 35 ) { 
		$S['RESULT_SHORT'] = 'Ваш словарный запас — <b>средний</b>.';
		$S['RESULT_FULL'] = 'Ваш словарный запас <b>средний</b> — '.$R.' из 40 баллов. Уделите больше времени саморазвитию, получению новых знаний. Смотрите фильмы, читайте литературу и заводите новые знакомства.';
	}	
	elseif($R <= 28 ) { 
		$S['RESULT_SHORT'] = 'Ваш словарный запас — <b>ниже среднего уровня</b>.';
		$S['RESULT_FULL'] = 'Ваш словарный запас <b>ниже среднего уровня</b> — '.$R.' из 40 баллов. Уделите больше времени саморазвитию, получению новых знаний. Смотрите фильмы, читайте литературу и заводите новые знакомства.';
	}	
	
	return $S;
};

