<?
function kettellGen() {
	$a[0] = ['да','не уверен','нет'];
	$a[1] = ['да','не уверен','нет'];
	$a[2] = ['в обжитом городе','нечто среднее','одиноко в глухих лесах'];
	$a[3] = ['всегда','обычно','редко'];
	$a[4] = ['верно','не уверен','неверно'];
	$a[5] = ['да','иногда','нет'];
	$a[6] = ['обычно','иногда','никогда'];
	$a[7] = ['верно','не уверен','неверно'];
	$a[8] = ['дал бы им возможность договориться самим','не уверен','рассудил бы их'];
	$a[9] = ['с готовностью вступаю в разговор','нечто среднее','предпочитаю спокойно оставаться в стороне'];
	$a[10] = ['инженером-строителем','не уверен','драматургом'];
	$a[11] = ['верно','не уверен','неверно'];
	$a[12] = ['да','нечто среднее','нет'];
	$a[13] = ['да','не уверен','нет'];
	$a[14] = ['согласен','не уверен','не согласен'];
	$a[15] = ['согласен','не уверен','не согласен'];
	$a[16] = ['только если это необходимо','нечто среднее','охотно, когда представится возможность'];
	$a[17] = ['да','нечто среднее','нет'];
	$a[18] = ['не испытываю чувства вины','нечто среднее','все же чувствую себя немного виноватым'];
	$a[19] = ['да','не уверен','нет'];
	$a[20] = ['сердце','сердце и разум в равной степени','разум'];
	$a[21] = ['да','не уверен','нет'];
	$a[22] = ['верно','не уверен','неверно'];
	$a[23] = ['высказывать свои мысли так, как они приходят мне в голову','нечто среднее','сначала сформулировать получше свои мысли'];
	$a[24] = ['да','нечто среднее','нет'];
	$a[25] = ['плотником или поваром','не уверен','официантом в хорошем ресторане'];
	$a[26] = ['очень редко','иногда','много раз'];
	$a[27] = ['«острый»','«резать»','«указывать»'];
	$a[28] = ['верно','не уверен','неверно'];
	$a[29] = ['верно','не уверен','неверно'];
	$a[30] = ['только после основательного обсуждения','не уверен','как можно скорее'];
	$a[31] = ['верно','нечто среднее','неверно'];
	$a[32] = ['да','не уверен','нет'];
	$a[33] = ['принимаю их такими, как они есть','нечто среднее','испытываю отвращение и возмущение'];
	$a[34] = ['да','нечто среднее','нет'];
	$a[35] = ['да','нечто среднее','нет'];
	$a[36] = ['заниматься музыкой, пением','нечто среднее','выпиливать и мастерить что-либо'];
	$a[37] = ['да','иногда','нет'];
	$a[38] = ['помогали детям развивать свои чувства','нечто среднее','обучали детей сдерживать свои чувства'];
	$a[39] = ['постараться улучшить организацию работы','нечто среднее','следить за результатами и соблюдением правил'];
	$a[40] = ['да','нечто среднее','нет'];
	$a[41] = ['да','нечто среднее','нет'];
	$a[42] = ['верно','нечто среднее','неверно'];
	$a[43] = ['пользуюсь случаем, чтобы попросить о чем-то нужном мне','нечто среднее','боюсь, что это связано с какой-нибудь оплошностью в моей работе'];
	$a[44] = ['больше спокойных, солидных людей','не уверен','больше «идеалистов», планирующих лучшее будущее'];
	$a[45] = ['да','не уверен','нет'];
	$a[46] = ['иногда','довольно часто','многократно'];
	$a[47] = ['да','нечто среднее','нет'];
	$a[48] = ['да','нечто среднее','нет'];
	$a[49] = ['да','не уверен','нет'];
	$a[50] = ['лесником','не уверен','учителем средней школы'];
	$a[51] = ['люблю делать подарки','неопределенно','считаю, что делать подарки – довольно неприятная вещь'];
	$a[52] = ['«улыбка»','«успех»','«счастливый»'];
	$a[53] = ['свеча','луна','электрический свет'];
	$a[54] = ['очень редко','иногда','довольно часто'];
	$a[55] = ['да','не уверен','нет'];
	$a[56] = ['верно','нечто среднее','неверно'];
	$a[57] = ['чаще, чем раз в неделю (т.е. чаще, чем большинство)','примерно раз в неделю (т.е. как большинство)','реже, чем раз в неделю (т.е. реже, чем большинство)'];
	$a[58] = ['верно','не уверен','неверно'];
	$a[59] = ['да','нечто среднее','нет'];
	$a[60] = ['да','нечто среднее','нет'];
	$a[61] = ['да','нечто среднее','нет'];
	$a[62] = ['постараюсь его успокоить','нечто среднее','раздражаюсь'];
	$a[63] = ['верно','не уверен','неверно'];
	$a[64] = ['да','нечто среднее','нет'];
	$a[65] = ['да','не уверен','нет'];
	$a[66] = ['да','не уверен','неверно'];
	$a[67] = ['очень редко','нечто среднее','довольно часто'];
	$a[68] = ['да','нечто среднее','нет'];
	$a[69] = ['оставался при своем мнении','нечто среднее','соглашался с их авторитетом'];
	$a[70] = ['да','не уверен','нет'];
	$a[71] = ['верно','не уверен','неверно'];
	$a[72] = ['верно','не уверен','неверно'];
	$a[73] = ['часто','иногда','никогда'];
	$a[74] = ['да','нечто среднее','нет'];
	$a[75] = ['разрабатывать его в лаборатории','нечто среднее','заниматься его практической реализацией'];
	$a[76] = ['«смелый»','«тревожный»','«ужасный»'];
	$a[77] = ['3/7','3/9','3/11'];
	$a[78] = ['верно','не уверен','неверно'];
	$a[79] = ['часто','иногда','никогда'];
	$a[80] = ['да','нечто среднее','нет'];
	$a[81] = ['да','нечто среднее','нет'];
	$a[82] = ['верно','нечто среднее','нет'];
	$a[83] = ['да','не уверен','нет'];
	$a[84] = ['довольно часто','иногда','почти никогда'];
	$a[85] = ['да','нечто среднее','нет'];
	$a[86] = ['реалистические описания военных и политических сражений','нечто среднее','роман, где много чувств и воображения'];
	$a[87] = ['да','нечто среднее','нет'];
	$a[88] = ['верно','нечто среднее','неверно'];
	$a[89] = ['да','нечто среднее','нет'];
	$a[90] = ['читать что-нибудь серьезное, но интересное','неопределенно','провести время, беседуя с кем-нибудь из пассажиров'];
	$a[91] = ['да','не уверен','нет'];
	$a[92] = ['меня это совершенно не трогает','нечто среднее','я расстраиваюсь'];
	$a[93] = ['да','нечто среднее','нет'];
	$a[94] = ['с постоянным окладом','нечто среднее','с большим окладом, который бы зависел от моей способности показать людям, чего я стою'];
	$a[95] = ['в общении с людьми','нечто среднее','из литературы'];
	$a[96] = ['да','нечто среднее','нет'];
	$a[97] = ['верно','не уверен','неверно'];
	$a[98] = ['да','нечто среднее','нет'];
	$a[99] = ['да','не уверен','нет'];
	$a[100] = ['нужно разговаривать с людьми','нечто среднее','нужно заниматься счетами и записями'];
	$a[101] = ['«тюрьма»','«нарушение»','«кража»'];
	$a[102] = ['«ПО»','«ОП»','«ТУ»']; 
	$a[103] = ['молчу','не уверен','высказываю свое презрение'];
	$a[104] = ['могу сосредоточиться на музыке, не отвлекаться','нечто среднее','чувствую, что это портит мне удовольствие и раздражает'];
	$a[105] = ['вежливого и спокойного','нечто среднее','энергичного'];
	$a[106] = ['да','не уверен','нет'];
	$a[107] = ['верно','не уверен','неверно'];
	$a[108] = ['стараюсь планировать заранее, прежде чем встретить трудность','нечто среднее','считаю, что справлюсь с трудностями по мере того, как они возникнут'];
	$a[109] = ['верно','не уверен','неверно'];
	$a[110] = ['верно','не уверен','неверно'];
	$a[111] = ['консультантом, помогающим людям выбирать профессию','нечто среднее','руководителем технического предприятия'];
	$a[112] = ['да','нечто среднее','нет'];
	$a[113] = ['да','не уверен','нет'];
	$a[114] = ['да','не уверен','нет'];
	$a[115] = ['верно','не уверен','неверно'];
	$a[116] = ['он – лжец','не уверен','по-видимому, он плохо информирован'];
	$a[117] = ['часто','иногда','никогда'];
	$a[118] = ['да','не уверен','нет'];
	$a[119] = ['да','не уверен','нет'];
	$a[120] = ['очень','немного','совсем не беспокоит'];
	$a[121] = ['в составе коллектива','не уверен','самостоятельно'];
	$a[122] = ['часто','иногда','никогда'];
	$a[123] = ['да','нечто среднее','нет'];
	$a[124] = ['да','не уверен','нет'];
	$a[125] = ['адвокатом','не уверен','пилотом или капитаном судна'];
	$a[126] = ['«быстрое»','«лучшее»','«быстрейшее»'];
	$a[127] = ['ОРРР','ООРР','РООО'];
	$a[128] = ['верно','нечто среднее','неверно'];
	$a[129] = ['да','нечто среднее','нет'];
	$a[130] = ['да','нечто среднее','нет'];
	$a[131] = ['да','нечто среднее','нет'];
	$a[132] = ['да','не уверен','нет'];
	$a[133] = ['да','нечто среднее','нет'];
	$a[134] = ['да','нечто среднее','нет'];
	$a[135] = ['свободно проявляю свои чувства','нечто среднее','держу свои переживания «при себе»'];
	$a[136] = ['легкую, живую','нечто среднее','чувствительную'];
	$a[137] = ['да','не уверен','нет'];
	$a[138] = ['смирюсь с этим','нечто среднее','даю людям возможность услышать его еще раз'];
	$a[139] = ['да','не уверен','нет'];
	$a[140] = ['да','не уверен','нет'];
	$a[141] = ['да','не уверен','нет'];
	$a[142] = ['да','не уверен','нет'];
	$a[143] = ['верно','нечто среднее','неверно'];
	$a[144] = ['увидеть, кто же «победил»','нечто среднее','чтобы спор разрешился мирно'];
	$a[145] = ['да','нечто среднее','нет'];
	$a[146] = ['да','не уверен','нет'];
	$a[147] = ['да','не уверен','нет'];
	$a[148] = ['да','иногда','нет'];
	$a[149] = ['верно','нечто среднее','неверно'];
	$a[150] = ['художником','не уверен','организатором культурных развлечений'];
	$a[151] = ['любые','некоторые','большинство'];
	$a[152] = ['«шип»','«красивые лепестки»','«аромат»'];
	$a[153] = ['часто','иногда','практически никогда'];
	$a[154] = ['да','нечто среднее','нет'];
	$a[155] = ['да','нечто среднее','нет'];
	$a[156] = ['верно','не уверен','неверно'];
	$a[157] = ['верно','не уверен','неверно'];
	$a[158] = ['иногда','почти никогда','никогда'];
	$a[159] = ['да','нечто среднее','нет'];
	$a[160] = ['да','нечто среднее','нет'];
	$a[161] = ['верно','нечто среднее','неверно'];
	$a[162] = ['русский язык и литературу','не уверен','математику или арифметику'];
	$a[163] = ['да','не уверен','нет'];
	$a[164] = ['часто вполне интересен и содержателен','нечто среднее','раздражает меня, потому что ограничивается мелочами'];
	$a[165] = ['да','нечто среднее','нет'];
	$a[166] = ['относиться к ребенку с достаточной любовью','нечто среднее','выработать нужные привычки и отношение к жизни'];
	$a[167] = ['да','нечто среднее','нет'];
	$a[168] = ['да','не уверен','нет'];
	$a[169] = ['вопросы нравственности','не уверен','разногласия между странами мира'];
	$a[170] = ['читая хорошо написанную книгу','нечто среднее','участвуя в обсуждении вопроса'];
	$a[171] = ['верно','не уверен','неверно'];
	$a[172] = ['всегда','обычно','только если это целесообразно'];
	$a[173] = ['да','нечто среднее','нет'];
	$a[174] = ['верно','не уверен','неверно'];
	$a[175] = ['согласился','не уверен','вежливо сказал, что занят'];
	$a[176] = ['широкий','зигзагообразный','прямой'];
	$a[177] = ['«нигде»','«далеко»','«где-то»'];
	$a[178] = ['да','нечто среднее','нет'];
	$a[179] = ['да','не уверен','нет'];
	$a[180] = ['в трудных ситуациях, когда нужно сохранить самообладание','не уверен','когда требуется умение ладить с людьми'];
	$a[181] = ['да','нечто среднее','нет'];
	$a[182] = ['да','нечто среднее','нет'];
	$a[183] = ['верно','нечто среднее','неверно'];
	$a[184] = ['да','нечто среднее','нет'];
	$a[185] = ['да','не уверен','нет'];
	$a[186] = ['да','не уверен','нет'];
	
	$a[187] = 'мужской';
	$a[188] = '29 - 70 лет';

	for($i=0; $i<=186; $i++) 	$a[$i] = $a[$i][random_int(0, 2)];

	return	$a;
	
}
		
function kettell($in, $type = 'short') {
	//'женский' 'мужской'  16 - 18 лет 19 - 28 лет 29 - 70 лет
	
	$S = array('A'=>0,'B'=>0,'C'=>0,'E'=>0,'F'=>0,'G'=>0,'H'=>0,'I'=>0,'L'=>0,'M'=>0,'N'=>0,'O'=>0,'Q1'=>0,'Q2'=>0,'Q3'=>0,'Q4'=>0,'F1'=>0,'F2'=>0,'F3'=>0,'F4'=>0);
	
	switch ($in[0]){
		case 'да': ;break;
		case 'не уверен': ;break;
		case 'нет': ;break;
	};

	switch ($in[1]){ 
		case 'да': break; 
		case 'не уверен': break; 
		case 'нет': break; 
	};

	switch ($in[2]){
		case 'в обжитом городе': $S['A']+=2;  ;break;
		case 'нечто среднее': $S['A']+=1; ;break;
		case 'одиноко в глухих лесах': $S['A']+=0 ;break;
	}

	switch ($in[3]){
		case 'всегда':       $S['C']+=2;  break;
		case 'обычно':          $S['C']+=1; break;
		case 'редко': break;
	}

	switch ($in[4]){
		case 'верно':       break;
		case 'не уверен': $S['C']+=1;  break;
		case 'неверно': $S['C']+=2; break;
	}

	switch ($in[5]){ 
		case 'да': break; 
		case 'иногда': $S['E']+=1; break; 
		case 'нет': $S['E']+=2; break; 
	}

	switch ($in[6]){ 
		case 'обычно': $S['E']+=2; break; 
		case 'иногда': $S['E']+=1; break; 
		case 'никогда': break; 
	}

	switch ($in[7]){ 
		case 'верно': break; 
		case 'не уверен': $S['F']+=1; break; 
		case 'неверно': $S['F']+=2; break; 
	}

	switch ($in[8]){ 
		case 'дал бы им возможность договориться самим': break; 
		case 'не уверен': $S['G']+=1; break; 
		case 'рассудил бы их': $S['G']+=2; break; 
	}

	switch ($in[9]){ 
		case 'с готовностью вступаю в разговор': $S['H']+=2; break; 
		case 'нечто среднее': $S['H']+=1; break; 
		case 'предпочитаю спокойно оставаться в стороне': break; 
	}

	switch ($in[10]){ 
		case 'инженером-строителем': break; 
		case 'не уверен': $S['I']+=1; break; 
		case 'драматургом': $S['I']+=2;  break; 
	}

	switch ($in[11]){ 
		case 'верно': $S['I']+=2; break; 
		case 'не уверен': $S['I']+=1; break; 
		case 'неверно': break; 
	}

	switch ($in[12]){ 
		case 'да': break; 
		case 'нечто среднее': $S['L']+=1; break; 
		case 'нет': $S['L']+=2; break; 
	}

	switch ($in[13]){ 
		case 'да': break; 
		case 'не уверен': $S['M']+=1; break; 
		case 'нет': $S['M']+=2;  break; 
	}

	switch ($in[14]){ 
		case 'согласен': break; 
		case 'не уверен': $S['M']+=1; break; 
		case 'не согласен': $S['M']+=2; break; 
	}

	switch ($in[15]){ 
		case 'согласен': break; 
		case 'не уверен': $S['N']+=1; break; 
		case 'не согласен': $S['N']+=2; break; 
	}

	switch ($in[16]){ 
		case 'только если это необходимо': $S['N']+=2; break; 
		case 'нечто среднее': $S['N']+=1; break; 
		case 'охотно, когда представится возможность': break; 
	}

	switch ($in[17]){ 
		case 'да': $S['O']+=2; break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[18]){ 
		case 'не испытываю чувства вины': break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'все же чувствую себя немного виноватым': $S['O']+=2; break; 
	}

	switch ($in[19]){ 
		case 'да': $S['Q1']+=2; break; 
		case 'не уверен': $S['Q1']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[20]){ 
		case 'сердце': break; 
		case 'сердце и разум в равной степени': $S['Q1']+=1; break; 
		case 'разум': $S['Q1']+=2; break; 
	}

	switch ($in[21]){ 
		case 'да': break; 
		case 'не уверен': $S['Q2']+=1; break; 
		case 'нет': $S['Q2']+=2; break; 
	}

	switch ($in[22]){ 
		case 'верно': break; 
		case 'не уверен': $S['Q3']+=1; break; 
		case 'неверно': $S['Q3']+=2; break; 
	}

	switch ($in[23]){ 
		case 'высказывать свои мысли так, как они приходят мне в голову': break; 
		case 'нечто среднее': $S['Q3']+=1; break; 
		case 'сначала сформулировать получше свои мысли': $S['Q3']+=2; break; 
	}

	switch ($in[24]){ 
		case 'да': break; 
		case 'нечто среднее': $S['Q4']+=1; break; 
		case 'нет':$S['Q4']+=2; break; 
	}
	switch ($in[25]){
		case 'плотником или поваром': ;break;
		case 'не уверен': $S['A']+=1; ;break;
		case 'официантом в хорошем ресторане': $S['A']+=2 ;break;
	}
	switch ($in[26]){
		case 'очень редко': $S['A']+=0;  ;break;
		case 'иногда':      $S['A']+=1; ;break;
		case 'много раз':   $S['A']+=2 ;break;
	}
	switch ($in[27]){
		case '«острый»': $S['B']+=0; break;
		case '«резать»': $S['B']+=1; break;
		case '«указывать»': $S['B']+=0; break;
	}
	switch ($in[28]){ 
		case 'верно': break; 
		case 'не уверен': $S['C']+=1; break; 
		case 'неверно': $S['C']+=2; break; 
	}
	switch ($in[29]){ 
		case 'верно': $S['C']+=2; break; 
		case 'не уверен': $S['C']+=1; break; 
		case 'неверно': break; 
	}
	switch ($in[30]){ 
		case 'только после основательного обсуждения': break; 
		case 'не уверен': $S['E']+=1; break; 
		case 'как можно скорее': $S['E']+=2; break; 
	}

	switch ($in[31]){ 
		case 'верно': break; 
		case 'нечто среднее': $S['E']+=1; break; 
		case 'неверно': $S['E']+=2; break; 
	}

	switch ($in[32]){ 
		case 'да': $S['F']+=2; break; 
		case 'не уверен': $S['F']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[33]){ 
		case 'принимаю их такими, как они есть': break; 
		case 'нечто среднее': $S['G']+=1; break; 
		case 'испытываю отвращение и возмущение': $S['G']+=2; break; 
	}

	switch ($in[34]){ 
		case 'да': break; 
		case 'нечто среднее': $S['H']+=1; break; 
		case 'нет': $S['H']+=2; break; 
	}

	switch ($in[35]){ 
		case 'да': $S['H']+=2; break; 
		case 'нечто среднее': $S['H']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[36]){ 
		case 'заниматься музыкой, пением': $S['I']+=2; break; 
		case 'нечто среднее': $S['I']+=1; break; 
		case 'выпиливать и мастерить что-либо': break; 
	}

	switch ($in[37]){ 
		case 'да': $S['L']+=2; break; 
		case 'иногда': $S['L']+=1; break; 
		case 'нет':  break; 
	}

	switch ($in[38]){ 
		case 'помогали детям развивать свои чувства': $S['M']+=2; break; 
		case 'нечто среднее':$S['M']+=1; break; 
		case 'обучали детей сдерживать свои чувства': break; 
	}

	switch ($in[39]){ 
		case 'постараться улучшить организацию работы': $S['M']+=2; break; 
		case 'нечто среднее':$S['M']+=1; break; 
		case 'следить за результатами и соблюдением правил': break; 
	}

	switch ($in[40]){ 
		case 'да': break; 
		case 'нечто среднее': $S['N']+=1; break; 
		case 'нет': $S['N']+=2; break; 
	}

	switch ($in[41]){ 
		case 'да': $S['N']+=2; break; 
		case 'нечто среднее': $S['N']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[42]){ 
		case 'верно': $S['O']+=2; break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'неверно': break; 
	}

	switch ($in[43]){ 
		case 'пользуюсь случаем, чтобы попросить о чем-то нужном мне': break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'боюсь, что это связано с какой-нибудь оплошностью в моей работе': $S['O']+=2; break; 
	}

	switch ($in[44]){ 
		case 'больше спокойных, солидных людей': break; 
		case 'не уверен': $S['Q1']+=1; break; 
		case 'больше «идеалистов», планирующих лучшее будущее': $S['Q1']+=2; break; 
	}

	switch ($in[45]){ 
		case 'да': $S['Q1']+=2; break; 
		case 'не уверен': $S['Q1']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[46]){ 
		case 'иногда': $S['Q2']+=2; break; 
		case 'довольно часто': $S['Q2']+=1; break; 
		case 'многократно': break; 
	}

	switch ($in[47]){ 
		case 'да': $S['Q3']+=2; break; 
		case 'нечто среднее': $S['Q3']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[48]){ 
		case 'да': $S['Q4']+=2; break; 
		case 'нечто среднее': $S['Q4']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[49]){ 
		case 'да':$S['Q4']+=2; break; 
		case 'не уверен': $S['Q4']+=1;break; 
		case 'нет': break; 
	}

	switch ($in[50]){
		case 'лесником': 					      $S['A']+=0;  ;break;
		case 'не уверен':                $S['A']+=1; ;break;
		case 'учителем средней школы':   $S['A']+=2 ;break;
	}
	switch ($in[51]){
		case 'люблю делать подарки': 					                       $S['A']+=0;  ;break;
		case 'неопределенно':                                         $S['A']+=1; ;break;
		case 'считаю, что делать подарки – довольно неприятная вещь': $S['A']+=2 ;break;
	}
	switch ($in[52]){
		case '«улыбка»': $S['B']+=0; break;
		case '«успех»': $S['B']+=1; break;
		case '«счастливый»': $S['B']+=0; break;
	}
	switch ($in[53]){
		case 'свеча': $S['B']+=0; break;
		case 'луна': $S['B']+=1; break;
		case 'электрический свет': $S['B']+=0; break;
	}
	switch ($in[54]){ 
		case 'очень редко': $S['C']+=2; break; 
		case 'иногда': $S['C']+=1; break; 
		case 'довольно часто': break; 
	}
	switch ($in[55]){ 
		case 'да': $S['E']+=2; break; 
		case 'не уверен': $S['E']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[56]){ 
		case 'верно': break; 
		case 'нечто среднее': $S['E']+=1; break; 
		case 'неверно': $S['E']+=2; break; 
	}

	switch ($in[57]){ 
		case 'чаще, чем раз в неделю (т.е. чаще, чем большинство)': $S['F']+=2; break; 
		case 'примерно раз в неделю (т.е. как большинство)': $S['F']+=1; break; 
		case 'реже, чем раз в неделю (т.е. реже, чем большинство)': break; 
	}

	switch ($in[58]){ 
		case 'верно': break; 
		case 'не уверен': $S['G']+=1; break; 
		case 'неверно': $S['G']+=2; break; 
	}

	switch ($in[59]){ 
		case 'да': break; 
		case 'нечто среднее': $S['H']+=1; break; 
		case 'нет': $S['H']+=2; break; 
	}

	switch ($in[60]){ 
		case 'да': break; 
		case 'нечто среднее': $S['H']+=1; break; 
		case 'нет': $S['H']+=2; break; 
	}

	switch ($in[61]){ 
		case 'да': break; 
		case 'нечто среднее': $S['I']+=1; break; 
		case 'нет': $S['I']+=2; break; 
	}

	switch ($in[62]){ 
		case 'постараюсь его успокоить':  break; 
		case 'нечто среднее': $S['L']+=1; break; 
		case 'раздражаюсь': $S['L']+=2; break; 
	}

	switch ($in[63]){ 
		case 'верно': break; 
		case 'не уверен': $S['L']+=1; break; 
		case 'неверно': $S['L']+=2; break; 
	}

	switch ($in[64]){ 
		case 'да': $S['M']+=2; break; 
		case 'нечто среднее': $S['M']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[65]){ 
		case 'да': break; 
		case 'не уверен': $S['N']+=1; break; 
		case 'нет': $S['N']+=2; break; 
	}

	switch ($in[66]){ 
		case 'да': break; 
		case 'не уверен': $S['N']+=1; break; 
		case 'неверно':$S['N']+=2; break; 
	}

	switch ($in[67]){ 
		case 'очень редко': break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'довольно часто': $S['O']+=2; break; 
	}

	switch ($in[68]){ 
		case 'да': $S['O']+=2; break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[69]){ 
		case 'оставался при своем мнении': $S['Q1']+=2; break; 
		case 'нечто среднее': $S['Q1']+=1; break; 
		case 'соглашался с их авторитетом': break; 
	}

	switch ($in[70]){ 
		case 'да':  $S['Q2']+=2;break; 
		case 'не уверен': $S['Q2']+=1; break; 
		case 'нет': break; 
	}

	switch ($in[71]){ 
		case 'верно': $S['Q2']+=2; break; 
		case 'не уверен':$S['Q2']+=1; break; 
		case 'неверно': break; 
	}

	switch ($in[72]){ 
		case 'верно': $S['Q3']+=2; break; 
		case 'не уверен': $S['Q3']+=1; break; 
		case 'неверно': break; 
	}

	switch ($in[73]){ 
		case 'часто': $S['Q4']+=2; break; 
		case 'иногда': $S['Q4']+=1; break; 
		case 'никогда': break; 
	}

	switch ($in[74]){ 
		case 'да': break; 
		case 'нечто среднее': $S['Q4']+=1; break; 
		case 'нет': $S['Q4']+=2; break; 
	}

	switch ($in[75]){
		case 'разрабатывать его в лаборатории': 				$S['A']+=0; ;break;
		case 'нечто среднее':                           $S['A']+=1; ;break;
		case 'заниматься его практической реализацией': $S['A']+=2  ;break;
	}
	switch ($in[76]){
		case '«смелый»': $S['B']+=0; break;
		case '«тревожный»': $S['B']+=0; break;
		case '«ужасный»': $S['B']+=1; break;
	}
	switch ($in[77]){
		case '3/7': $S['B']+=0; break;
		case '3/9': $S['B']+=1; break;
		case '3/11': $S['B']+=0; break;
	}
	switch ($in[78]){ 
		case 'верно': break; 
		case 'не уверен': $S['C']+=1; break; 
		case 'неверно': $S['C']+=2;  break; 
	}

	switch ($in[79]){ 
		case 'часто': break; 
		case 'иногда': $S['C']+=1; break; 
		case 'никогда': $S['C']+=2; break; 
	}
	switch ($in[80]){ 
		case 'да': break; 
		case 'нечто среднее': $S['E']+=1; break; 
		case 'нет': $S['E']+=2; break; 
	};

	switch ($in[81]){ 
		case 'да': break; 
		case 'нечто среднее': $S['F']+=1; break; 
		case 'нет': $S['F']+=2; break; 
	};

	switch ($in[82]){ 
		case 'верно': $S['F']+=2; break; 
		case 'нечто среднее': $S['F']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[83]){ 
		case 'да': break; 
		case 'не уверен': $S['G']+=1; break; 
		case 'нет': $S['G']+=2; break; 
	};

	switch ($in[84]){ 
		case 'довольно часто': break; 
		case 'иногда': $S['H']+=1; break; 
		case 'почти никогда': $S['H']+=2; break; 
	};

	switch ($in[85]){ 
		case 'да': break; 
		case 'нечто среднее': $S['H']+=1; break; 
		case 'нет': $S['H']+=2; break; 
	};

	switch ($in[86]){ 
		case 'реалистические описания военных и политических сражений': break; 
		case 'нечто среднее': $S['I']+=1; break; 
		case 'роман, где много чувств и воображения': $S['I']+=2; break; 
	};

	switch ($in[87]){ 
		case 'да': $S['L']+=2; break; 
		case 'нечто среднее': $S['L']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[88]){ 
		case 'верно': break; 
		case 'нечто среднее': $S['L']+=1; break; 
		case 'неверно':  $S['L']+=2; break; 
	};

	switch ($in[89]){ 
		case 'да':  break; 
		case 'нечто среднее': $S['M']+=1; break; 
		case 'нет':$S['M']+=2; break; 
	};

	switch ($in[90]){ 
		case 'читать что-нибудь серьезное, но интересное': $S['M']+=2; break; 
		case 'неопределенно': $S['M']+=1; break; 
		case 'провести время, беседуя с кем-нибудь из пассажиров': break; 
	};

	switch ($in[91]){ 
		case 'да': break; 
		case 'не уверен': $S['N']+=1; break; 
		case 'нет': $S['N']+=2; break; 
	};

	switch ($in[92]){ 
		case 'меня это совершенно не трогает': break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'я расстраиваюсь': $S['O']+=2; break; 
	};

	switch ($in[93]){ 
		case 'да': $S['O']+=2; break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[94]){ 
		case 'с постоянным окладом': break; 
		case 'нечто среднее': $S['Q1']+=1; break; 
		case 'с большим окладом, который бы зависел от моей способности показать людям, чего я стою': $S['Q1']+=2; break; 
	};

	switch ($in[95]){ 
		case 'в общении с людьми': break; 
		case 'нечто среднее': $S['Q2']+=1; break; 
		case 'из литературы': $S['Q2']+=2; break; 
	};

	switch ($in[96]){ 
		case 'да': break; 
		case 'нечто среднее': $S['Q2']+=1; break; 
		case 'нет': $S['Q2']+=2; break; 
	};

	switch ($in[97]){ 
		case 'верно': $S['Q3']+=2; break; 
		case 'не уверен': $S['Q3']+=1; break; 
		case 'неверно': break; 
	};

	switch ($in[98]){ 
		case 'да': $S['Q4']+=2; break; 
		case 'нечто среднее': $S['Q4']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[99]){ 
		case 'да': break; 
		case 'не уверен': $S['Q4']+=1; break; 
		case 'нет': $S['Q4']+=2; break; 
	};
	switch ($in[100]){
		case 'нужно разговаривать с людьми': 			  $S['A']+=2; ;break;
		case 'нечто среднее':                       $S['A']+=1; ;break;
		case 'нужно заниматься счетами и записями': $S['A']+=0; ;break;
	}
	switch ($in[101]){
		case '«тюрьма»': $S['B']+=0; break;
		case '«нарушение»':  $S['B']+=0; break;
		case '«кража»': $S['B']+=1; break;
	}
	switch ($in[102]){
		case '«ПО»': $S['B']+=0; break;
		case '«ОП»': $S['B']+=1; break;
		case '«ТУ»': $S['B']+=0; break;
	}
	switch ($in[103]){ 
		case 'молчу': $S['C']+=2; break; 
		case 'не уверен': $S['C']+=1; break; 
		case 'высказываю свое презрение': break; 
	};

	switch ($in[104]){ 
		case 'могу сосредоточиться на музыке, не отвлекаться': $S['C']+=2; break; 
		case 'нечто среднее': $S['C']+=1; break; 
		case 'чувствую, что это портит мне удовольствие и раздражает': break; 
	};

	switch ($in[105]){ 
		case 'вежливого и спокойного': break; 
		case 'нечто среднее': $S['E']+=1; break; 
		case 'энергичного': $S['E']+=2; break; 
	};

	switch ($in[106]){ 
		case 'да': break; 
		case 'не уверен': $S['F']+=1; break; 
		case 'нет': $S['F']+=2; break; 
	};

	switch ($in[107]){ 
		case 'верно': break; 
		case 'не уверен': $S['F']+=1; break; 
		case 'неверно': $S['F']+=2; break; 
	};

	switch ($in[108]){ 
		case 'стараюсь планировать заранее, прежде чем встретить трудность': $S['G']+=2; break; 
		case 'нечто среднее': $S['G']+=1; break; 
		case 'считаю, что справлюсь с трудностями по мере того, как они возникнут': break; 
	};

	switch ($in[109]){ 
		case 'верно': $S['H']+=2; break; 
		case 'не уверен': $S['H']+=1; break; 
		case 'неверно': break; 
	};

	switch ($in[110]){ 
		case 'верно': $S['H']+=2; break; 
		case 'не уверен': $S['H']+=1; break; 
		case 'неверно': break; 
	};

	switch ($in[111]){ 
		case 'консультантом, помогающим людям выбирать профессию': $S['I']+=2; break; 
		case 'нечто среднее': $S['I']+=1; break; 
		case 'руководителем технического предприятия': break; 
	};

	switch ($in[112]){ 
		case 'да': $S['L']+=2; break; 
		case 'нечто среднее': $S['L']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[113]){ 
		case 'да': $S['L']+=2; break; 
		case 'не уверен': $S['L']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[114]){ 
		case 'да': $S['M']+=2; break; 
		case 'не уверен': $S['M']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[115]){ 
		case 'верно':$S['M']+=2; break; 
		case 'не уверен':$S['M']+=1; break; 
		case 'неверно': break; 
	};

	switch ($in[116]){ 
		case 'он – лжец': $S['N']+=2; break; 
		case 'не уверен': $S['N']+=1; break; 
		case 'по-видимому, он плохо информирован': break; 
	};

	switch ($in[117]){ 
		case 'часто': $S['O']+=2; break; 
		case 'иногда': $S['O']+=1; break; 
		case 'никогда': break; 
	};

	switch ($in[118]){ 
		case 'да': $S['O']+=2; break; 
		case 'не уверен': $S['O']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[119]){ 
		case 'да': break; 
		case 'не уверен': $S['Q1']+=1; break; 
		case 'нет': $S['Q1']+=2; break; 
	};

	switch ($in[120]){ 
		case 'очень': break; 
		case 'немного': $S['Q2']+=1; break; 
		case 'совсем не беспокоит': $S['Q2']+=2; break; 
	};

	switch ($in[121]){ 
		case 'в составе коллектива': break; 
		case 'не уверен': $S['Q2']+=1; break; 
		case 'самостоятельно': $S['Q2']+=2; break; 
	};

	switch ($in[122]){ 
		case 'часто': break; 
		case 'иногда': $S['Q3']+=1; break; 
		case 'никогда':  $S['Q3']+=2; break; 
	};

	switch ($in[123]){ 
		case 'да': $S['Q4']+=2; break; 
		case 'нечто среднее':  $S['Q4']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[124]){ 
		case 'да': break; 
		case 'не уверен': $S['Q4']+=1; break; 
		case 'нет':$S['Q4']+=2; break; 
	};
	switch ($in[125]){
		case 'адвокатом': 			             $S['A']+=2;  ;break;
		case 'не уверен':                   $S['A']+=1; ;break;
		case 'пилотом или капитаном судна': $S['A']+=0;  ;break;
	}
	switch ($in[126]){
		case '«быстрое»': $S['B']+=0; break;
		case '«лучшее»': $S['B']+=0; break;
		case '«быстрейшее»': $S['B']+=1; break;
	}
	switch ($in[127]){
		case 'ОРРР': $S['B']+=0; break;
		case 'ООРР': $S['B']+=1; break;
		case 'РООО': $S['B']+=0; break;
	}
	switch ($in[128]){ 
		case 'верно': break; 
		case 'нечто среднее': $S['C']+=1; break; 
		case 'неверно': $S['C']+=2; break; 
	};

	switch ($in[129]){ 
		case 'да': $S['C']+=2; break; 
		case 'нечто среднее': $S['C']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[130]){ 
		case 'да': $S['E']+=2; break; 
		case 'нечто среднее': $S['E']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[131]){ 
		case 'да': $S['F']+=2; break; 
		case 'нечто среднее': $S['F']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[132]){ 
		case 'да': $S['F']+=2; break; 
		case 'не уверен': $S['F']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[133]){ 
		case 'да': $S['G']+=2; break; 
		case 'нечто среднее': $S['G']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[134]){ 
		case 'да': $S['H']+=2; break; 
		case 'нечто среднее': $S['H']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[135]){ 
		case 'свободно проявляю свои чувства': $S['H']+=2; break; 
		case 'нечто среднее': $S['H']+=1; break; 
		case 'держу свои переживания «при себе»': break; 
	};

	switch ($in[136]){ 
		case 'легкую, живую': break; 
		case 'нечто среднее': $S['I']+=1; break; 
		case 'чувствительную': $S['I']+=2; break; 
	};

	switch ($in[137]){ 
		case 'да': $S['I']+=2; break; 
		case 'не уверен': $S['I']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[138]){ 
		case 'смирюсь с этим': break; 
		case 'нечто среднее': $S['L']+=1; break; 
		case 'даю людям возможность услышать его еще раз': $S['L']+=2; break; 
	};

	switch ($in[139]){ 
		case 'да': $S['M']+=2; break; 
		case 'не уверен': $S['M']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[140]){ 
		case 'да': break; 
		case 'не уверен': $S['M']+=1; break; 
		case 'нет':$S['M']+=2; break; 
	};

	switch ($in[141]){ 
		case 'да': $S['N']+=2; break; 
		case 'не уверен': $S['N']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[142]){ 
		case 'да': $S['O']+=2; break; 
		case 'не уверен': $S['O']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[143]){ 
		case 'верно':  break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'неверно': $S['O']+=2; break; 
	};

	switch ($in[144]){ 
		case 'увидеть, кто же «победил»': $S['Q1']+=2; break; 
		case 'нечто среднее': $S['Q1']+=1; break; 
		case 'чтобы спор разрешился мирно': break; 
	};

	switch ($in[145]){ 
		case 'да': $S['Q2']+=2; break; 
		case 'нечто среднее': $S['Q2']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[146]){ 
		case 'да': break; 
		case 'не уверен': $S['Q3']+=1; break; 
		case 'нет': $S['Q3']+=2; break; 
	};

	switch ($in[147]){ 
		case 'да': $S['Q3']+=2; break; 
		case 'не уверен': $S['Q3']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[148]){ 
		case 'да': $S['Q4']+=2; break; 
		case 'иногда': $S['Q4']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[149]){ 
		case 'верно': break; 
		case 'нечто среднее': $S['Q4']+=1; break; 
		case 'неверно': $S['Q4']+=2; break; 
	};

	switch ($in[150]){
		case 'художником': 			                     $S['A']+=0; ;break;
		case 'не уверен':                            $S['A']+=1; ;break;
		case 'организатором культурных развлечений': $S['A']+=2; ;break;
	}
	switch ($in[151]){
		case 'любые': $S['B']+=1; break;
		case 'некоторые': $S['B']+=0; break;
		case 'большинство': $S['B']+=0; break;
	}
	switch ($in[152]){
		case 'ОРРР': $S['B']+=0; break;
		case 'ООРР': $S['B']+=0; break;
		case 'РООО': $S['B']+=1; break;
	}
	switch ($in[153]){ 
		case 'часто': break; 
		case 'иногда': $S['C']+=1; break; 
		case 'практически никогда':$S['C']+=2;  break; 
	};

	switch ($in[154]){ 
		case 'да': $S['E']+=2; break; 
		case 'нечто среднее': $S['E']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[155]){ 
		case 'да': $S['E']+=2; break; 
		case 'нечто среднее': $S['E']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[156]){ 
		case 'верно':  break; 
		case 'не уверен': $S['F']+=1; break; 
		case 'неверно': $S['F']+=2; break; 
	};

	switch ($in[157]){ 
		case 'верно': break; 
		case 'не уверен': $S['F']+=1; break; 
		case 'неверно': $S['F']+=2; break; 
	};

	switch ($in[158]){ 
		case 'иногда': break; 
		case 'почти никогда': $S['G']+=1; break; 
		case 'никогда': $S['G']+=2; break; 
	};

	switch ($in[159]){ 
		case 'да': $S['G']+=2; break; 
		case 'нечто среднее': $S['G']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[160]){ 
		case 'да': break; 
		case 'нечто среднее': $S['H']+=1; break; 
		case 'нет': $S['H']+=2; break; 
	};

	switch ($in[161]){ 
		case 'верно': break; 
		case 'нечто среднее': $S['I']+=1; break; 
		case 'неверно': $S['I']+=2; break; 
	};

	switch ($in[162]){ 
		case 'русский язык и литературу': $S['I']+=2; break; 
		case 'не уверен': $S['I']+=1; break; 
		case 'математику или арифметику': break; 
	};

	switch ($in[163]){ 
		case 'да': $S['L']+=2; break; 
		case 'не уверен': $S['L']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[164]){ 
		case 'часто вполне интересен и содержателен': break; 
		case 'нечто среднее': $S['M']+=1; break; 
		case 'раздражает меня, потому что ограничивается мелочами': $S['M']+=2; break; 
	};

	switch ($in[165]){ 
		case 'да': break; 
		case 'нечто среднее': $S['M']+=1; break; 
		case 'нет': $S['M']+=2; break; 
	};

	switch ($in[166]){ 
		case 'относиться к ребенку с достаточной любовью': $S['N']+=2; break; 
		case 'нечто среднее': $S['N']+=1; break; 
		case 'выработать нужные привычки и отношение к жизни': break; 
	};

	switch ($in[167]){ 
		case 'да': break; 
		case 'нечто среднее': $S['O']+=1; break; 
		case 'нет':$S['O']+=2; break; 
	};

	switch ($in[168]){ 
		case 'да': $S['Q1']+=2; break; 
		case 'не уверен': $S['Q1']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[169]){ 
		case 'вопросы нравственности': break; 
		case 'не уверен': $S['Q1']+=1; break; 
		case 'разногласия между странами мира': $S['Q1']+=2; break; 
	};

	switch ($in[170]){ 
		case 'читая хорошо написанную книгу': $S['Q2']+=2; break; 
		case 'нечто среднее': $S['Q2']+=1; break; 
		case 'участвуя в обсуждении вопроса': break; 
	};

	switch ($in[171]){ 
		case 'верно': break; 
		case 'не уверен': $S['Q3']+=1; break; 
		case 'неверно': $S['Q3']+=2; break; 
	};

	switch ($in[172]){ 
		case 'всегда': $S['Q3']+=2; break; 
		case 'обычно': $S['Q3']+=1; break; 
		case 'только если это целесообразно': break; 
	};

	switch ($in[173]){ 
		case 'да': $S['Q4']+=2; break; 
		case 'нечто среднее': $S['Q4']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[174]){ 
		case 'верно': break; 
		case 'не уверен': $S['Q4']+=1; break; 
		case 'неверно': $S['Q4']+=2; break; 
	};
	switch ($in[175]){
		case 'согласился': $S['A']+=2;  ;break;
		case 'не уверен': $S['A']+=1; ;break;
		case 'вежливо сказал, что занят': ;break;
	}
	switch ($in[176]){
		case 'широкий': $S['B']+=1; break;
		case 'зигзагообразный': $S['B']+=0; break;
		case 'прямой': $S['B']+=0; break;
	}
	switch ($in[177]){
		case '«нигде»': $S['B']+=1; break;
		case '«далеко»': $S['B']+=0; break;
		case '«где-то»': $S['B']+=0; break;
	}
	switch ($in[178]){ 
		case 'да': $S['C']+=2; break; 
		case 'нечто среднее': $S['C']+=1;  break; 
		case 'нет': break; 
	};

	switch ($in[179]){ 
		case 'да': $S['E']+=2; break; 
		case 'не уверен': $S['E']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[180]){ 
		case 'в трудных ситуациях, когда нужно сохранить самообладание': $S['E']+=2; break; 
		case 'не уверен': $S['E']+=1; break; 
		case 'когда требуется умение ладить с людьми': break; 
	};

	switch ($in[181]){ 
		case 'да': $S['F']+=2; break; 
		case 'нечто среднее': $S['F']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[182]){ 
		case 'да': $S['F']+=2; break; 
		case 'нечто среднее': $S['F']+=1; break; 
		case 'нет':  break; 
	};

	switch ($in[183]){ 
		case 'верно': $S['G']+=2; break; 
		case 'нечто среднее': $S['G']+=1; break; 
		case 'неверно': break; 
	};

	switch ($in[184]){ 
		case 'да': $S['G']+=2; break; 
		case 'нечто среднее': $S['G']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[185]){ 
		case 'да': $S['H']+=2; break; 
		case 'не уверен': $S['H']+=1; break; 
		case 'нет': break; 
	};

	switch ($in[186]){ 
		case 'да': break; 
		case 'не уверен': break; 
		case 'нет': break; 
	};
	
	//echo '<pre>'; print_r($S); echo '</pre>';
	
	
	
	if($in[187] == 'женский' && $in[188] == '16 - 18 лет') {
		if($S['А']>=0 && $S['А']<=6) $S['А'] = 1;
		if($S['А']>=7 && $S['А']<=8) $S['А'] = 2;
		if($S['А']>=7 && $S['А']<=8) $S['А'] = 3;
		if($S['А']>=9 && $S['А']<=10) $S['А'] = 4;
		if($S['А']>=11 && $S['А']<=11) $S['А'] = 5;
		if($S['А']>=12 && $S['А']<=13) $S['А'] = 6;
		if($S['А']>=14 && $S['А']<=15) $S['А'] = 7;
		if($S['А']>=16 && $S['А']<=16) $S['А'] = 8;
		if($S['А']>=17 && $S['А']<=18) $S['А'] = 9;
		if($S['А']>=19 && $S['А']<=20) $S['А'] = 10;
		if($S['В']>=0 && $S['В']<=1) $S['В'] = 1;
		if($S['В']>=2 && $S['В']<=2) $S['В'] = 2;
		if($S['В']>=3 && $S['В']<=3) $S['В'] = 3;
		if($S['В']>=4 && $S['В']<=4) $S['В'] = 4;
		if($S['В']>=5 && $S['В']<=5) $S['В'] = 5;
		if($S['В']>=6 && $S['В']<=6) $S['В'] = 6;
		if($S['В']>=7 && $S['В']<=7) $S['В'] = 7;
		if($S['В']>=8 && $S['В']<=9) $S['В'] = 8;
		if($S['В']>=10 && $S['В']<=10) $S['В'] = 9;
		if($S['В']>=11 && $S['В']<=12) $S['В'] = 10;
		if($S['С']>=0 && $S['С']<=6) $S['С'] = 1;
		if($S['С']>=7 && $S['С']<=8) $S['С'] = 2;
		if($S['С']>=9 && $S['С']<=10) $S['С'] = 3;
		if($S['С']>=11 && $S['С']<=12) $S['С'] = 4;
		if($S['С']>=13 && $S['С']<=14) $S['С'] = 5;
		if($S['С']>=15 && $S['С']<=16) $S['С'] = 6;
		if($S['С']>=17 && $S['С']<=18) $S['С'] = 7;
		if($S['С']>=19 && $S['С']<=20) $S['С'] = 8;
		if($S['С']>=21 && $S['С']<=21) $S['С'] = 9;
		if($S['С']>=22 && $S['С']<=26) $S['С'] = 10;
		if($S['E']>=0 && $S['E']<=3) $S['E'] = 1;
		if($S['E']>=4 && $S['E']<=4) $S['E'] = 2;
		if($S['E']>=5 && $S['E']<=6) $S['E'] = 3;
		if($S['E']>=7 && $S['E']<=8) $S['E'] = 4;
		if($S['E']>=9 && $S['E']<=10) $S['E'] = 5;
		if($S['E']>=11 && $S['E']<=12) $S['E'] = 6;
		if($S['E']>=13 && $S['E']<=15) $S['E'] = 7;
		if($S['E']>=16 && $S['E']<=17) $S['E'] = 8;
		if($S['E']>=18 && $S['E']<=19) $S['E'] = 9;
		if($S['E']>=20 && $S['E']<=26) $S['E'] = 10;
		if($S['F']>=0 && $S['F']<=6) $S['F'] = 1;
		if($S['F']>=7 && $S['F']<=8) $S['F'] = 2;
		if($S['F']>=9 && $S['F']<=11) $S['F'] = 3;
		if($S['F']>=12 && $S['F']<=14) $S['F'] = 4;
		if($S['F']>=15 && $S['F']<=16) $S['F'] = 5;
		if($S['F']>=17 && $S['F']<=18) $S['F'] = 6;
		if($S['F']>=19 && $S['F']<=20) $S['F'] = 7;
		if($S['F']>=21 && $S['F']<=22) $S['F'] = 8;
		if($S['F']>=23 && $S['F']<=23) $S['F'] = 9;
		if($S['F']>=24 && $S['F']<=26) $S['F'] = 10;
		if($S['G']>=0 && $S['G']<=5) $S['G'] = 1;
		if($S['G']>=6 && $S['G']<=7) $S['G'] = 2;
		if($S['G']>=8 && $S['G']<=9) $S['G'] = 3;
		if($S['G']>=10 && $S['G']<=11) $S['G'] = 4;
		if($S['G']>=12 && $S['G']<=13) $S['G'] = 5;
		if($S['G']>=14 && $S['G']<=14) $S['G'] = 6;
		if($S['G']>=15 && $S['G']<=16) $S['G'] = 7;
		if($S['G']>=17 && $S['G']<=17) $S['G'] = 8;
		if($S['G']>=18 && $S['G']<=18) $S['G'] = 9;
		if($S['G']>=19 && $S['G']<=20) $S['G'] = 10;
		if($S['H']>=0 && $S['H']<=2) $S['H'] = 1;
		if($S['H']>=3 && $S['H']<=4) $S['H'] = 2;
		if($S['H']>=5 && $S['H']<=7) $S['H'] = 3;
		if($S['H']>=8 && $S['H']<=9) $S['H'] = 4;
		if($S['H']>=10 && $S['H']<=12) $S['H'] = 5;
		if($S['H']>=13 && $S['H']<=14) $S['H'] = 6;
		if($S['H']>=15 && $S['H']<=17) $S['H'] = 7;
		if($S['H']>=18 && $S['H']<=20) $S['H'] = 8;
		if($S['H']>=21 && $S['H']<=22) $S['H'] = 9;
		if($S['H']>=23 && $S['H']<=26) $S['H'] = 10;
		if($S['I']>=0 && $S['I']<=5) $S['I'] = 1;
		if($S['I']>=6 && $S['I']<=7) $S['I'] = 2;
		if($S['I']>=8 && $S['I']<=8) $S['I'] = 3;
		if($S['I']>=9 && $S['I']<=10) $S['I'] = 4;
		if($S['I']>=11 && $S['I']<=11) $S['I'] = 5;
		if($S['I']>=12 && $S['I']<=13) $S['I'] = 6;
		if($S['I']>=14 && $S['I']<=14) $S['I'] = 7;
		if($S['I']>=15 && $S['I']<=15) $S['I'] = 8;
		if($S['I']>=16 && $S['I']<=17) $S['I'] = 9;
		if($S['I']>=18 && $S['I']<=20) $S['I'] = 10;
		if($S['L']>=0 && $S['L']<=2) $S['L'] = 1;
		if($S['L']>=3 && $S['L']<=3) $S['L'] = 2;
		if($S['L']>=4 && $S['L']<=5) $S['L'] = 3;
		if($S['L']>=6 && $S['L']<=6) $S['L'] = 4;
		if($S['L']>=7 && $S['L']<=8) $S['L'] = 5;
		if($S['L']>=9 && $S['L']<=9) $S['L'] = 6;
		if($S['L']>=10 && $S['L']<=11) $S['L'] = 7;
		if($S['L']>=12 && $S['L']<=13) $S['L'] = 8;
		if($S['L']>=14 && $S['L']<=14) $S['L'] = 9;
		if($S['L']>=15 && $S['L']<=16) $S['L'] = 10;
		if($S['M']>=0 && $S['M']<=6) $S['M'] = 1;
		if($S['M']>=7 && $S['M']<=7) $S['M'] = 2;
		if($S['M']>=8 && $S['M']<=9) $S['M'] = 3;
		if($S['M']>=10 && $S['M']<=10) $S['M'] = 4;
		if($S['M']>=11 && $S['M']<=12) $S['M'] = 5;
		if($S['M']>=13 && $S['M']<=14) $S['M'] = 6;
		if($S['M']>=15 && $S['M']<=16) $S['M'] = 7;
		if($S['M']>=17 && $S['M']<=17) $S['M'] = 8;
		if($S['M']>=18 && $S['M']<=19) $S['M'] = 9;
		if($S['M']>=20 && $S['M']<=26) $S['M'] = 10;
		if($S['N']>=0 && $S['N']<=5) $S['N'] = 1;
		if($S['N']>=6 && $S['N']<=6) $S['N'] = 2;
		if($S['N']>=7 && $S['N']<=7) $S['N'] = 3;
		if($S['N']>=8 && $S['N']<=8) $S['N'] = 4;
		if($S['N']>=9 && $S['N']<=10) $S['N'] = 5;
		if($S['N']>=11 && $S['N']<=11) $S['N'] = 6;
		if($S['N']>=12 && $S['N']<=13) $S['N'] = 7;
		if($S['N']>=14 && $S['N']<=14) $S['N'] = 8;
		if($S['N']>=15 && $S['N']<=15) $S['N'] = 9;
		if($S['N']>=16 && $S['N']<=20) $S['N'] = 10;
		if($S['O']>=0 && $S['O']<=4) $S['O'] = 1;
		if($S['O']>=5 && $S['O']<=5) $S['O'] = 2;
		if($S['O']>=6 && $S['O']<=7) $S['O'] = 3;
		if($S['O']>=8 && $S['O']<=9) $S['O'] = 4;
		if($S['O']>=10 && $S['O']<=11) $S['O'] = 5;
		if($S['O']>=12 && $S['O']<=13) $S['O'] = 6;
		if($S['O']>=14 && $S['O']<=15) $S['O'] = 7;
		if($S['O']>=16 && $S['O']<=17) $S['O'] = 8;
		if($S['O']>=18 && $S['O']<=19) $S['O'] = 9;
		if($S['O']>=20 && $S['O']<=26) $S['O'] = 10;
		if($S['Q1']>=0 && $S['Q1']<=3) $S['Q1'] = 1;
		if($S['Q1']>=4 && $S['Q1']<=4) $S['Q1'] = 2;
		if($S['Q1']>=5 && $S['Q1']<=5) $S['Q1'] = 3;
		if($S['Q1']>=6 && $S['Q1']<=6) $S['Q1'] = 4;
		if($S['Q1']>=7 && $S['Q1']<=8) $S['Q1'] = 5;
		if($S['Q1']>=9 && $S['Q1']<=9) $S['Q1'] = 6;
		if($S['Q1']>=10 && $S['Q1']<=11) $S['Q1'] = 7;
		if($S['Q1']>=12 && $S['Q1']<=12) $S['Q1'] = 8;
		if($S['Q1']>=13 && $S['Q1']<=14) $S['Q1'] = 9;
		if($S['Q1']>=15 && $S['Q1']<=20) $S['Q1'] = 10;
		if($S['Q2']>=0 && $S['Q2']<=3) $S['Q2'] = 1;
		if($S['Q2']>=4 && $S['Q2']<=4) $S['Q2'] = 2;
		if($S['Q2']>=5 && $S['Q2']<=6) $S['Q2'] = 3;
		if($S['Q2']>=7 && $S['Q2']<=7) $S['Q2'] = 4;
		if($S['Q2']>=8 && $S['Q2']<=9) $S['Q2'] = 5;
		if($S['Q2']>=10 && $S['Q2']<=11) $S['Q2'] = 6;
		if($S['Q2']>=12 && $S['Q2']<=13) $S['Q2'] = 7;
		if($S['Q2']>=14 && $S['Q2']<=15) $S['Q2'] = 8;
		if($S['Q2']>=16 && $S['Q2']<=17) $S['Q2'] = 9;
		if($S['Q2']>=18 && $S['Q2']<=20) $S['Q2'] = 10;
		if($S['Q3']>=0 && $S['Q3']<=4) $S['Q3'] = 1;
		if($S['Q3']>=5 && $S['Q3']<=6) $S['Q3'] = 2;
		if($S['Q3']>=7 && $S['Q3']<=7) $S['Q3'] = 3;
		if($S['Q3']>=8 && $S['Q3']<=9) $S['Q3'] = 4;
		if($S['Q3']>=10 && $S['Q3']<=10) $S['Q3'] = 5;
		if($S['Q3']>=11 && $S['Q3']<=12) $S['Q3'] = 6;
		if($S['Q3']>=13 && $S['Q3']<=13) $S['Q3'] = 7;
		if($S['Q3']>=14 && $S['Q3']<=14) $S['Q3'] = 8;
		if($S['Q3']>=15 && $S['Q3']<=16) $S['Q3'] = 9;
		if($S['Q3']>=17 && $S['Q3']<=20) $S['Q3'] = 10;
		if($S['Q4']>=0 && $S['Q4']<=3) $S['Q4'] = 1;
		if($S['Q4']>=4 && $S['Q4']<=5) $S['Q4'] = 2;
		if($S['Q4']>=6 && $S['Q4']<=8) $S['Q4'] = 3;
		if($S['Q4']>=9 && $S['Q4']<=11) $S['Q4'] = 4;
		if($S['Q4']>=12 && $S['Q4']<=13) $S['Q4'] = 5;
		if($S['Q4']>=14 && $S['Q4']<=16) $S['Q4'] = 6;
		if($S['Q4']>=17 && $S['Q4']<=19) $S['Q4'] = 7;
		if($S['Q4']>=20 && $S['Q4']<=21) $S['Q4'] = 8;
		if($S['Q4']>=22 && $S['Q4']<=23) $S['Q4'] = 9;
		if($S['Q4']>=24 && $S['Q4']<=26) $S['Q4'] = 10;

	}

	if($in[187] == 'мужской' && $in[188] == '16 - 18 лет') {
		if($S['A']>=0 && $S['A']<=3) $S['A'] = 1;
		if($S['A']>=4 && $S['A']<=4) $S['A'] = 2;
		if($S['A']>=5 && $S['A']<=6) $S['A'] = 3;
		if($S['A']>=7 && $S['A']<=7) $S['A'] = 4;
		if($S['A']>=8 && $S['A']<=9) $S['A'] = 5;
		if($S['A']>=10 && $S['A']<=11) $S['A'] = 6;
		if($S['A']>=12 && $S['A']<=12) $S['A'] = 7;
		if($S['A']>=13 && $S['A']<=14) $S['A'] = 8;
		if($S['A']>=15 && $S['A']<=16) $S['A'] = 9;
		if($S['A']>=17 && $S['A']<=20) $S['A'] = 10;
		if($S['B']>=0 && $S['B']<=1) $S['B'] = 1;
		if($S['B']>=2 && $S['B']<=2) $S['B'] = 2;
		if($S['B']>=3 && $S['B']<=3) $S['B'] = 3;
		if($S['B']>=4 && $S['B']<=4) $S['B'] = 4;
		if($S['B']>=5 && $S['B']<=5) $S['B'] = 5;
		if($S['B']>=6 && $S['B']<=6) $S['B'] = 6;
		if($S['B']>=7 && $S['B']<=7) $S['B'] = 7;
		if($S['B']>=8 && $S['B']<=9) $S['B'] = 8;
		if($S['B']>=10 && $S['B']<=10) $S['B'] = 9;
		if($S['B']>=11 && $S['B']<=12) $S['B'] = 10;
		if($S['C']>=0 && $S['C']<=7) $S['C'] = 1;
		if($S['C']>=8 && $S['C']<=9) $S['C'] = 2;
		if($S['C']>=10 && $S['C']<=11) $S['C'] = 3;
		if($S['C']>=12 && $S['C']<=13) $S['C'] = 4;
		if($S['C']>=14 && $S['C']<=15) $S['C'] = 5;
		if($S['C']>=16 && $S['C']<=17) $S['C'] = 6;
		if($S['C']>=18 && $S['C']<=19) $S['C'] = 7;
		if($S['C']>=20 && $S['C']<=20) $S['C'] = 8;
		if($S['C']>=21 && $S['C']<=22) $S['C'] = 9;
		if($S['C']>=23 && $S['C']<=26) $S['C'] = 10;
		if($S['E']>=0 && $S['E']<=6) $S['E'] = 1;
		if($S['E']>=7 && $S['E']<=8) $S['E'] = 2;
		if($S['E']>=9 && $S['E']<=9) $S['E'] = 3;
		if($S['E']>=10 && $S['E']<=11) $S['E'] = 4;
		if($S['E']>=12 && $S['E']<=13) $S['E'] = 5;
		if($S['E']>=14 && $S['E']<=15) $S['E'] = 6;
		if($S['E']>=16 && $S['E']<=17) $S['E'] = 7;
		if($S['E']>=18 && $S['E']<=19) $S['E'] = 8;
		if($S['E']>=20 && $S['E']<=21) $S['E'] = 9;
		if($S['E']>=22 && $S['E']<=26) $S['E'] = 10;
		if($S['F']>=0 && $S['F']<=5) $S['F'] = 1;
		if($S['F']>=6 && $S['F']<=8) $S['F'] = 2;
		if($S['F']>=9 && $S['F']<=11) $S['F'] = 3;
		if($S['F']>=12 && $S['F']<=14) $S['F'] = 4;
		if($S['F']>=15 && $S['F']<=16) $S['F'] = 5;
		if($S['F']>=17 && $S['F']<=18) $S['F'] = 6;
		if($S['F']>=19 && $S['F']<=20) $S['F'] = 7;
		if($S['F']>=21 && $S['F']<=22) $S['F'] = 8;
		if($S['F']>=23 && $S['F']<=23) $S['F'] = 9;
		if($S['F']>=24 && $S['F']<=26) $S['F'] = 10;
		if($S['G']>=0 && $S['G']<=4) $S['G'] = 1;
		if($S['G']>=5 && $S['G']<=6) $S['G'] = 2;
		if($S['G']>=7 && $S['G']<=8) $S['G'] = 3;
		if($S['G']>=9 && $S['G']<=10) $S['G'] = 4;
		if($S['G']>=11 && $S['G']<=12) $S['G'] = 5;
		if($S['G']>=13 && $S['G']<=14) $S['G'] = 6;
		if($S['G']>=15 && $S['G']<=16) $S['G'] = 7;
		if($S['G']>=17 && $S['G']<=17) $S['G'] = 8;
		if($S['G']>=18 && $S['G']<=18) $S['G'] = 9;
		if($S['G']>=19 && $S['G']<=20) $S['G'] = 10;
		if($S['H']>=0 && $S['H']<=2) $S['H'] = 1;
		if($S['H']>=3 && $S['H']<=4) $S['H'] = 2;
		if($S['H']>=5 && $S['H']<=7) $S['H'] = 3;
		if($S['H']>=8 && $S['H']<=10) $S['H'] = 4;
		if($S['H']>=11 && $S['H']<=13) $S['H'] = 5;
		if($S['H']>=14 && $S['H']<=16) $S['H'] = 6;
		if($S['H']>=17 && $S['H']<=18) $S['H'] = 7;
		if($S['H']>=19 && $S['H']<=20) $S['H'] = 8;
		if($S['H']>=21 && $S['H']<=22) $S['H'] = 9;
		if($S['H']>=23 && $S['H']<=26) $S['H'] = 10;
		if($S['I']>=0 && $S['I']<=2) $S['I'] = 1;
		if($S['I']>=3 && $S['I']<=3) $S['I'] = 2;
		if($S['I']>=4 && $S['I']<=4) $S['I'] = 3;
		if($S['I']>=5 && $S['I']<=6) $S['I'] = 4;
		if($S['I']>=7 && $S['I']<=8) $S['I'] = 5;
		if($S['I']>=9 && $S['I']<=9) $S['I'] = 6;
		if($S['I']>=10 && $S['I']<=11) $S['I'] = 7;
		if($S['I']>=12 && $S['I']<=13) $S['I'] = 8;
		if($S['I']>=14 && $S['I']<=15) $S['I'] = 9;
		if($S['I']>=16 && $S['I']<=20) $S['I'] = 10;
		if($S['L']>=0 && $S['L']<=3) $S['L'] = 1;
		if($S['L']>=4 && $S['L']<=4) $S['L'] = 2;
		if($S['L']>=5 && $S['L']<=6) $S['L'] = 3;
		if($S['L']>=7 && $S['L']<=8) $S['L'] = 4;
		if($S['L']>=9 && $S['L']<=9) $S['L'] = 5;
		if($S['L']>=10 && $S['L']<=11) $S['L'] = 6;
		if($S['L']>=12 && $S['L']<=13) $S['L'] = 7;
		if($S['L']>=14 && $S['L']<=14) $S['L'] = 8;
		if($S['L']>=15 && $S['L']<=16) $S['L'] = 9;
		if($S['L']>=17 && $S['L']<=20) $S['L'] = 10;
		if($S['M']>=0 && $S['M']<=4) $S['M'] = 1;
		if($S['M']>=5 && $S['M']<=6) $S['M'] = 2;
		if($S['M']>=7 && $S['M']<=7) $S['M'] = 3;
		if($S['M']>=8 && $S['M']<=9) $S['M'] = 4;
		if($S['M']>=10 && $S['M']<=11) $S['M'] = 5;
		if($S['M']>=12 && $S['M']<=13) $S['M'] = 6;
		if($S['M']>=14 && $S['M']<=14) $S['M'] = 7;
		if($S['M']>=15 && $S['M']<=16) $S['M'] = 8;
		if($S['M']>=17 && $S['M']<=18) $S['M'] = 9;
		if($S['M']>=19 && $S['M']<=26) $S['M'] = 10;
		if($S['N']>=0 && $S['N']<=5) $S['N'] = 1;
		if($S['N']>=6 && $S['N']<=7) $S['N'] = 2;
		if($S['N']>=8 && $S['N']<=8) $S['N'] = 3;
		if($S['N']>=9 && $S['N']<=9) $S['N'] = 4;
		if($S['N']>=10 && $S['N']<=10) $S['N'] = 5;
		if($S['N']>=11 && $S['N']<=12) $S['N'] = 6;
		if($S['N']>=13 && $S['N']<=13) $S['N'] = 7;
		if($S['N']>=14 && $S['N']<=15) $S['N'] = 8;
		if($S['N']>=16 && $S['N']<=16) $S['N'] = 9;
		if($S['N']>=17 && $S['N']<=20) $S['N'] = 10;
		if($S['O']>=0 && $S['O']<=3) $S['O'] = 1;
		if($S['O']>=4 && $S['O']<=4) $S['O'] = 2;
		if($S['O']>=5 && $S['O']<=6) $S['O'] = 3;
		if($S['O']>=7 && $S['O']<=8) $S['O'] = 4;
		if($S['O']>=9 && $S['O']<=10) $S['O'] = 5;
		if($S['O']>=11 && $S['O']<=11) $S['O'] = 6;
		if($S['O']>=12 && $S['O']<=13) $S['O'] = 7;
		if($S['O']>=14 && $S['O']<=15) $S['O'] = 8;
		if($S['O']>=16 && $S['O']<=17) $S['O'] = 9;
		if($S['O']>=18 && $S['O']<=26) $S['O'] = 10;
		if($S['Q1']>=0 && $S['Q1']<=4) $S['Q1'] = 1;
		if($S['Q1']>=5 && $S['Q1']<=5) $S['Q1'] = 2;
		if($S['Q1']>=6 && $S['Q1']<=6) $S['Q1'] = 3;
		if($S['Q1']>=7 && $S['Q1']<=8) $S['Q1'] = 4;
		if($S['Q1']>=9 && $S['Q1']<=9) $S['Q1'] = 5;
		if($S['Q1']>=10 && $S['Q1']<=11) $S['Q1'] = 6;
		if($S['Q1']>=12 && $S['Q1']<=12) $S['Q1'] = 7;
		if($S['Q1']>=13 && $S['Q1']<=13) $S['Q1'] = 8;
		if($S['Q1']>=14 && $S['Q1']<=15) $S['Q1'] = 9;
		if($S['Q1']>=16 && $S['Q1']<=20) $S['Q1'] = 10;
		if($S['Q2']>=0 && $S['Q2']<=3) $S['Q2'] = 1;
		if($S['Q2']>=4 && $S['Q2']<=4) $S['Q2'] = 2;
		if($S['Q2']>=5 && $S['Q2']<=6) $S['Q2'] = 3;
		if($S['Q2']>=7 && $S['Q2']<=8) $S['Q2'] = 4;
		if($S['Q2']>=9 && $S['Q2']<=9) $S['Q2'] = 5;
		if($S['Q2']>=10 && $S['Q2']<=11) $S['Q2'] = 6;
		if($S['Q2']>=12 && $S['Q2']<=13) $S['Q2'] = 7;
		if($S['Q2']>=14 && $S['Q2']<=15) $S['Q2'] = 8;
		if($S['Q2']>=16 && $S['Q2']<=17) $S['Q2'] = 9;
		if($S['Q2']>=18 && $S['Q2']<=20) $S['Q2'] = 10;
		if($S['Q3']>=0 && $S['Q3']<=3) $S['Q3'] = 1;
		if($S['Q3']>=4 && $S['Q3']<=5) $S['Q3'] = 2;
		if($S['Q3']>=6 && $S['Q3']<=6) $S['Q3'] = 3;
		if($S['Q3']>=7 && $S['Q3']<=8) $S['Q3'] = 4;
		if($S['Q3']>=9 && $S['Q3']<=10) $S['Q3'] = 5;
		if($S['Q3']>=11 && $S['Q3']<=11) $S['Q3'] = 6;
		if($S['Q3']>=12 && $S['Q3']<=13) $S['Q3'] = 7;
		if($S['Q3']>=14 && $S['Q3']<=14) $S['Q3'] = 8;
		if($S['Q3']>=15 && $S['Q3']<=16) $S['Q3'] = 9;
		if($S['Q3']>=17 && $S['Q3']<=20) $S['Q3'] = 10;
		if($S['Q4']>=0 && $S['Q4']<=2) $S['Q4'] = 1;
		if($S['Q4']>=3 && $S['Q4']<=4) $S['Q4'] = 2;
		if($S['Q4']>=5 && $S['Q4']<=6) $S['Q4'] = 3;
		if($S['Q4']>=7 && $S['Q4']<=8) $S['Q4'] = 4;
		if($S['Q4']>=10 && $S['Q4']<=12) $S['Q4'] = 5;
		if($S['Q4']>=13 && $S['Q4']<=15) $S['Q4'] = 6;
		if($S['Q4']>=16 && $S['Q4']<=17) $S['Q4'] = 7;
		if($S['Q4']>=18 && $S['Q4']<=19) $S['Q4'] = 8;
		if($S['Q4']>=20 && $S['Q4']<=21) $S['Q4'] = 9;
		if($S['Q4']>=22 && $S['Q4']<=26) $S['Q4'] = 10;
	};

	if($in[187] == 'женский' && $in[188] == '19 - 28 лет') {
		if($S['A']>=0 && $S['A']<=4) $S['A'] = 1;
		if($S['A']>=5 && $S['A']<=6) $S['A'] = 2;
		if($S['A']>=7 && $S['A']<=7) $S['A'] = 3;
		if($S['A']>=8 && $S['A']<=9) $S['A'] = 4;
		if($S['A']>=10 && $S['A']<=12) $S['A'] = 5;
		if($S['A']>=13 && $S['A']<=13) $S['A'] = 6;
		if($S['A']>=14 && $S['A']<=14) $S['A'] = 7;
		if($S['A']>=16 && $S['A']<=16) $S['A'] = 8;
		if($S['A']>=17 && $S['A']<=18) $S['A'] = 9;
		if($S['A']>=19 && $S['A']<=20) $S['A'] = 10;
		if($S['B']>=0 && $S['B']<=4) $S['B'] = 1;
		if($S['B']>=5 && $S['B']<=5) $S['B'] = 2;
		if($S['B']>=5 && $S['B']<=5) $S['B'] = 3;
		if($S['B']>=6 && $S['B']<=6) $S['B'] = 4;
		if($S['B']>=7 && $S['B']<=7) $S['B'] = 5;
		if($S['B']>=8 && $S['B']<=8) $S['B'] = 6;
		if($S['B']>=9 && $S['B']<=9) $S['B'] = 7;
		if($S['B']>=10 && $S['B']<=10) $S['B'] = 8;
		if($S['B']>=11 && $S['B']<=11) $S['B'] = 9;
		if($S['B']>=12 && $S['B']<=13) $S['B'] = 10;
		if($S['C']>=0 && $S['C']<=6) $S['C'] = 1;
		if($S['C']>=7 && $S['C']<=8) $S['C'] = 2;
		if($S['C']>=9 && $S['C']<=10) $S['C'] = 3;
		if($S['C']>=11 && $S['C']<=12) $S['C'] = 4;
		if($S['C']>=13 && $S['C']<=14) $S['C'] = 5;
		if($S['C']>=15 && $S['C']<=16) $S['C'] = 6;
		if($S['C']>=17 && $S['C']<=18) $S['C'] = 7;
		if($S['C']>=19 && $S['C']<=20) $S['C'] = 8;
		if($S['C']>=21 && $S['C']<=22) $S['C'] = 9;
		if($S['C']>=23 && $S['C']<=26) $S['C'] = 10;
		if($S['E']>=0 && $S['E']<=3) $S['E'] = 1;
		if($S['E']>=4 && $S['E']<=4) $S['E'] = 2;
		if($S['E']>=5 && $S['E']<=6) $S['E'] = 3;
		if($S['E']>=7 && $S['E']<=8) $S['E'] = 4;
		if($S['E']>=9 && $S['E']<=10) $S['E'] = 5;
		if($S['E']>=11 && $S['E']<=12) $S['E'] = 6;
		if($S['E']>=13 && $S['E']<=14) $S['E'] = 7;
		if($S['E']>=15 && $S['E']<=16) $S['E'] = 8;
		if($S['E']>=17 && $S['E']<=18) $S['E'] = 9;
		if($S['E']>=19 && $S['E']<=26) $S['E'] = 10;
		if($S['F']>=0 && $S['F']<=5) $S['F'] = 1;
		if($S['F']>=6 && $S['F']<=7) $S['F'] = 2;
		if($S['F']>=8 && $S['F']<=10) $S['F'] = 3;
		if($S['F']>=11 && $S['F']<=12) $S['F'] = 4;
		if($S['F']>=13 && $S['F']<=15) $S['F'] = 5;
		if($S['F']>=16 && $S['F']<=17) $S['F'] = 6;
		if($S['F']>=18 && $S['F']<=19) $S['F'] = 7;
		if($S['F']>=20 && $S['F']<=21) $S['F'] = 8;
		if($S['F']>=22 && $S['F']<=22) $S['F'] = 9;
		if($S['F']>=23 && $S['F']<=26) $S['F'] = 10;
		if($S['G']>=0 && $S['G']<=4) $S['G'] = 1;
		if($S['G']>=5 && $S['G']<=6) $S['G'] = 2;
		if($S['G']>=7 && $S['G']<=8) $S['G'] = 3;
		if($S['G']>=9 && $S['G']<=10) $S['G'] = 4;
		if($S['G']>=11 && $S['G']<=12) $S['G'] = 5;
		if($S['G']>=13 && $S['G']<=13) $S['G'] = 6;
		if($S['G']>=14 && $S['G']<=15) $S['G'] = 7;
		if($S['G']>=16 && $S['G']<=17) $S['G'] = 8;
		if($S['G']>=18 && $S['G']<=18) $S['G'] = 9;
		if($S['G']>=19 && $S['G']<=20) $S['G'] = 10;
		if($S['H']>=0 && $S['H']<=2) $S['H'] = 1;
		if($S['H']>=3 && $S['H']<=4) $S['H'] = 2;
		if($S['H']>=5 && $S['H']<=7) $S['H'] = 3;
		if($S['H']>=8 && $S['H']<=9) $S['H'] = 4;
		if($S['H']>=10 && $S['H']<=12) $S['H'] = 5;
		if($S['H']>=13 && $S['H']<=15) $S['H'] = 6;
		if($S['H']>=16 && $S['H']<=17) $S['H'] = 7;
		if($S['H']>=18 && $S['H']<=20) $S['H'] = 8;
		if($S['H']>=21 && $S['H']<=22) $S['H'] = 9;
		if($S['H']>=23 && $S['H']<=26) $S['H'] = 10;
		if($S['I']>=0 && $S['I']<=5) $S['I'] = 1;
		if($S['I']>=6 && $S['I']<=6) $S['I'] = 2;
		if($S['I']>=7 && $S['I']<=8) $S['I'] = 3;
		if($S['I']>=9 && $S['I']<=10) $S['I'] = 4;
		if($S['I']>=11 && $S['I']<=12) $S['I'] = 5;
		if($S['I']>=13 && $S['I']<=13) $S['I'] = 6;
		if($S['I']>=14 && $S['I']<=14) $S['I'] = 7;
		if($S['I']>=15 && $S['I']<=15) $S['I'] = 8;
		if($S['I']>=16 && $S['I']<=17) $S['I'] = 9;
		if($S['I']>=18 && $S['I']<=20) $S['I'] = 10;
		if($S['L']>=0 && $S['L']<=1) $S['L'] = 1;
		if($S['L']>=2 && $S['L']<=3) $S['L'] = 2;
		if($S['L']>=4 && $S['L']<=4) $S['L'] = 3;
		if($S['L']>=5 && $S['L']<=5) $S['L'] = 4;
		if($S['L']>=6 && $S['L']<=7) $S['L'] = 5;
		if($S['L']>=8 && $S['L']<=9) $S['L'] = 6;
		if($S['L']>=10 && $S['L']<=10) $S['L'] = 7;
		if($S['L']>=11 && $S['L']<=12) $S['L'] = 8;
		if($S['L']>=13 && $S['L']<=14) $S['L'] = 9;
		if($S['L']>=15 && $S['L']<=20) $S['L'] = 10;
		if($S['M']>=0 && $S['M']<=5) $S['M'] = 1;
		if($S['M']>=6 && $S['M']<=7) $S['M'] = 2;
		if($S['M']>=8 && $S['M']<=8) $S['M'] = 3;
		if($S['M']>=9 && $S['M']<=10) $S['M'] = 4;
		if($S['M']>=11 && $S['M']<=12) $S['M'] = 5;
		if($S['M']>=13 && $S['M']<=14) $S['M'] = 6;
		if($S['M']>=15 && $S['M']<=16) $S['M'] = 7;
		if($S['M']>=17 && $S['M']<=17) $S['M'] = 8;
		if($S['M']>=18 && $S['M']<=19) $S['M'] = 9;
		if($S['M']>=20 && $S['M']<=26) $S['M'] = 10;
		if($S['N']>=0 && $S['N']<=5) $S['N'] = 1;
		if($S['N']>=6 && $S['N']<=6) $S['N'] = 2;
		if($S['N']>=7 && $S['N']<=7) $S['N'] = 3;
		if($S['N']>=8 && $S['N']<=8) $S['N'] = 4;
		if($S['N']>=9 && $S['N']<=10) $S['N'] = 5;
		if($S['N']>=11 && $S['N']<=11) $S['N'] = 6;
		if($S['N']>=12 && $S['N']<=13) $S['N'] = 7;
		if($S['N']>=14 && $S['N']<=14) $S['N'] = 8;
		if($S['N']>=15 && $S['N']<=16) $S['N'] = 9;
		if($S['N']>=17 && $S['N']<=20) $S['N'] = 10;
		if($S['O']>=0 && $S['O']<=3) $S['O'] = 1;
		if($S['O']>=4 && $S['O']<=4) $S['O'] = 2;
		if($S['O']>=5 && $S['O']<=6) $S['O'] = 3;
		if($S['O']>=7 && $S['O']<=7) $S['O'] = 4;
		if($S['O']>=8 && $S['O']<=9) $S['O'] = 5;
		if($S['O']>=10 && $S['O']<=12) $S['O'] = 6;
		if($S['O']>=13 && $S['O']<=14) $S['O'] = 7;
		if($S['O']>=15 && $S['O']<=16) $S['O'] = 8;
		if($S['O']>=17 && $S['O']<=18) $S['O'] = 9;
		if($S['O']>=19 && $S['O']<=20) $S['O'] = 10;
		if($S['Q1']>=0 && $S['Q1']<=3) $S['Q1'] = 1;
		if($S['Q1']>=4 && $S['Q1']<=4) $S['Q1'] = 2;
		if($S['Q1']>=5 && $S['Q1']<=5) $S['Q1'] = 3;
		if($S['Q1']>=6 && $S['Q1']<=7) $S['Q1'] = 4;
		if($S['Q1']>=8 && $S['Q1']<=8) $S['Q1'] = 5;
		if($S['Q1']>=9 && $S['Q1']<=9) $S['Q1'] = 6;
		if($S['Q1']>=10 && $S['Q1']<=11) $S['Q1'] = 7;
		if($S['Q1']>=12 && $S['Q1']<=13) $S['Q1'] = 8;
		if($S['Q1']>=14 && $S['Q1']<=14) $S['Q1'] = 9;
		if($S['Q1']>=15 && $S['Q1']<=20) $S['Q1'] = 10;
		if($S['Q2']>=0 && $S['Q2']<=3) $S['Q2'] = 1;
		if($S['Q2']>=4 && $S['Q2']<=4) $S['Q2'] = 2;
		if($S['Q2']>=5 && $S['Q2']<=6) $S['Q2'] = 3;
		if($S['Q2']>=7 && $S['Q2']<=7) $S['Q2'] = 4;
		if($S['Q2']>=8 && $S['Q2']<=9) $S['Q2'] = 5;
		if($S['Q2']>=10 && $S['Q2']<=11) $S['Q2'] = 6;
		if($S['Q2']>=12 && $S['Q2']<=13) $S['Q2'] = 7;
		if($S['Q2']>=14 && $S['Q2']<=15) $S['Q2'] = 8;
		if($S['Q2']>=16 && $S['Q2']<=17) $S['Q2'] = 9;
		if($S['Q2']>=18 && $S['Q2']<=20) $S['Q2'] = 10;
		if($S['Q3']>=0 && $S['Q3']<=4) $S['Q3'] = 1;
		if($S['Q3']>=5 && $S['Q3']<=5) $S['Q3'] = 2;
		if($S['Q3']>=6 && $S['Q3']<=7) $S['Q3'] = 3;
		if($S['Q3']>=8 && $S['Q3']<=9) $S['Q3'] = 4;
		if($S['Q3']>=10 && $S['Q3']<=10) $S['Q3'] = 5;
		if($S['Q3']>=11 && $S['Q3']<=12) $S['Q3'] = 6;
		if($S['Q3']>=13 && $S['Q3']<=13) $S['Q3'] = 7;
		if($S['Q3']>=14 && $S['Q3']<=14) $S['Q3'] = 8;
		if($S['Q3']>=15 && $S['Q3']<=16) $S['Q3'] = 9;
		if($S['Q3']>=17 && $S['Q3']<=20) $S['Q3'] = 10;
		if($S['Q4']>=0 && $S['Q4']<=3) $S['Q4'] = 1;
		if($S['Q4']>=4 && $S['Q4']<=5) $S['Q4'] = 2;
		if($S['Q4']>=6 && $S['Q4']<=7) $S['Q4'] = 3;
		if($S['Q4']>=8 && $S['Q4']<=10) $S['Q4'] = 4;
		if($S['Q4']>=11 && $S['Q4']<=12) $S['Q4'] = 5;
		if($S['Q4']>=13 && $S['Q4']<=15) $S['Q4'] = 6;
		if($S['Q4']>=16 && $S['Q4']<=18) $S['Q4'] = 7;
		if($S['Q4']>=19 && $S['Q4']<=20) $S['Q4'] = 8;
		if($S['Q4']>=21 && $S['Q4']<=22) $S['Q4'] = 9;
		if($S['Q4']>=23 && $S['Q4']<=26) $S['Q4'] = 10;
	};

	if($in[187] == 'мужской' && $in[188] == '19 - 28 лет') {
		if($S['A']>=0 && $S['A']<=3) $S['A'] = 1;
		if($S['A']>=4 && $S['A']<=4) $S['A'] = 2;
		if($S['A']>=5 && $S['A']<=6) $S['A'] = 3;
		if($S['A']>=7 && $S['A']<=7) $S['A'] = 4;
		if($S['A']>=8 && $S['A']<=9) $S['A'] = 5;
		if($S['A']>=10 && $S['A']<=11) $S['A'] = 6;
		if($S['A']>=12 && $S['A']<=13) $S['A'] = 7;
		if($S['A']>=14 && $S['A']<=14) $S['A'] = 8;
		if($S['A']>=15 && $S['A']<=16) $S['A'] = 9;
		if($S['A']>=17 && $S['A']<=20) $S['A'] = 10;
		if($S['B']>=0 && $S['B']<=4) $S['B'] = 1;
		if($S['B']>=5 && $S['B']<=5) $S['B'] = 2;
		if($S['B']>=5 && $S['B']<=5) $S['B'] = 3;
		if($S['B']>=6 && $S['B']<=6) $S['B'] = 4;
		if($S['B']>=7 && $S['B']<=7) $S['B'] = 5;
		if($S['B']>=8 && $S['B']<=8) $S['B'] = 6;
		if($S['B']>=9 && $S['B']<=9) $S['B'] = 7;
		if($S['B']>=10 && $S['B']<=10) $S['B'] = 8;
		if($S['B']>=11 && $S['B']<=11) $S['B'] = 9;
		if($S['B']>=12 && $S['B']<=13) $S['B'] = 10;
		if($S['C']>=0 && $S['C']<=7) $S['C'] = 1;
		if($S['C']>=8 && $S['C']<=9) $S['C'] = 2;
		if($S['C']>=10 && $S['C']<=11) $S['C'] = 3;
		if($S['C']>=12 && $S['C']<=13) $S['C'] = 4;
		if($S['C']>=14 && $S['C']<=15) $S['C'] = 5;
		if($S['C']>=16 && $S['C']<=17) $S['C'] = 6;
		if($S['C']>=18 && $S['C']<=19) $S['C'] = 7;
		if($S['C']>=20 && $S['C']<=21) $S['C'] = 8;
		if($S['C']>=22 && $S['C']<=22) $S['C'] = 9;
		if($S['C']>=23 && $S['C']<=26) $S['C'] = 10;
		if($S['E']>=0 && $S['E']<=6) $S['E'] = 1;
		if($S['E']>=7 && $S['E']<=8) $S['E'] = 2;
		if($S['E']>=9 && $S['E']<=9) $S['E'] = 3;
		if($S['E']>=10 && $S['E']<=11) $S['E'] = 4;
		if($S['E']>=12 && $S['E']<=13) $S['E'] = 5;
		if($S['E']>=14 && $S['E']<=16) $S['E'] = 6;
		if($S['E']>=17 && $S['E']<=18) $S['E'] = 7;
		if($S['E']>=19 && $S['E']<=19) $S['E'] = 8;
		if($S['E']>=20 && $S['E']<=21) $S['E'] = 9;
		if($S['E']>=22 && $S['E']<=26) $S['E'] = 10;
		if($S['F']>=0 && $S['F']<=5) $S['F'] = 1;
		if($S['F']>=6 && $S['F']<=8) $S['F'] = 2;
		if($S['F']>=9 && $S['F']<=10) $S['F'] = 3;
		if($S['F']>=11 && $S['F']<=13) $S['F'] = 4;
		if($S['F']>=14 && $S['F']<=15) $S['F'] = 5;
		if($S['F']>=16 && $S['F']<=17) $S['F'] = 6;
		if($S['F']>=18 && $S['F']<=19) $S['F'] = 7;
		if($S['F']>=20 && $S['F']<=21) $S['F'] = 8;
		if($S['F']>=22 && $S['F']<=23) $S['F'] = 9;
		if($S['F']>=24 && $S['F']<=26) $S['F'] = 10;
		if($S['G']>=0 && $S['G']<=4) $S['G'] = 1;
		if($S['G']>=5 && $S['G']<=6) $S['G'] = 2;
		if($S['G']>=7 && $S['G']<=9) $S['G'] = 3;
		if($S['G']>=10 && $S['G']<=11) $S['G'] = 4;
		if($S['G']>=12 && $S['G']<=12) $S['G'] = 5;
		if($S['G']>=13 && $S['G']<=14) $S['G'] = 6;
		if($S['G']>=15 && $S['G']<=16) $S['G'] = 7;
		if($S['G']>=17 && $S['G']<=17) $S['G'] = 8;
		if($S['G']>=18 && $S['G']<=19) $S['G'] = 9;
		if($S['G']>=20 && $S['G']<=20) $S['G'] = 10;
		if($S['H']>=0 && $S['H']<=2) $S['H'] = 1;
		if($S['H']>=3 && $S['H']<=4) $S['H'] = 2;
		if($S['H']>=5 && $S['H']<=7) $S['H'] = 3;
		if($S['H']>=8 && $S['H']<=10) $S['H'] = 4;
		if($S['H']>=11 && $S['H']<=13) $S['H'] = 5;
		if($S['H']>=14 && $S['H']<=16) $S['H'] = 6;
		if($S['H']>=17 && $S['H']<=18) $S['H'] = 7;
		if($S['H']>=19 && $S['H']<=20) $S['H'] = 8;
		if($S['H']>=21 && $S['H']<=22) $S['H'] = 9;
		if($S['H']>=23 && $S['H']<=26) $S['H'] = 10;
		if($S['I']>=0 && $S['I']<=2) $S['I'] = 1;
		if($S['I']>=3 && $S['I']<=3) $S['I'] = 2;
		if($S['I']>=4 && $S['I']<=5) $S['I'] = 3;
		if($S['I']>=6 && $S['I']<=6) $S['I'] = 4;
		if($S['I']>=7 && $S['I']<=8) $S['I'] = 5;
		if($S['I']>=9 && $S['I']<=10) $S['I'] = 6;
		if($S['I']>=11 && $S['I']<=12) $S['I'] = 7;
		if($S['I']>=13 && $S['I']<=14) $S['I'] = 8;
		if($S['I']>=15 && $S['I']<=15) $S['I'] = 9;
		if($S['I']>=16 && $S['I']<=20) $S['I'] = 10;
		if($S['L']>=0 && $S['L']<=3) $S['L'] = 1;
		if($S['L']>=4 && $S['L']<=4) $S['L'] = 2;
		if($S['L']>=5 && $S['L']<=6) $S['L'] = 3;
		if($S['L']>=7 && $S['L']<=7) $S['L'] = 4;
		if($S['L']>=8 && $S['L']<=9) $S['L'] = 5;
		if($S['L']>=10 && $S['L']<=11) $S['L'] = 6;
		if($S['L']>=12 && $S['L']<=12) $S['L'] = 7;
		if($S['L']>=13 && $S['L']<=14) $S['L'] = 8;
		if($S['L']>=15 && $S['L']<=15) $S['L'] = 9;
		if($S['L']>=16 && $S['L']<=20) $S['L'] = 10;
		if($S['M']>=0 && $S['M']<=5) $S['M'] = 1;
		if($S['M']>=6 && $S['M']<=6) $S['M'] = 2;
		if($S['M']>=7 && $S['M']<=8) $S['M'] = 3;
		if($S['M']>=9 && $S['M']<=9) $S['M'] = 4;
		if($S['M']>=10 && $S['M']<=11) $S['M'] = 5;
		if($S['M']>=12 && $S['M']<=13) $S['M'] = 6;
		if($S['M']>=14 && $S['M']<=15) $S['M'] = 7;
		if($S['M']>=16 && $S['M']<=17) $S['M'] = 8;
		if($S['M']>=18 && $S['M']<=18) $S['M'] = 9;
		if($S['M']>=19 && $S['M']<=20) $S['M'] = 10;
		if($S['N']>=0 && $S['N']<=5) $S['N'] = 1;
		if($S['N']>=6 && $S['N']<=7) $S['N'] = 2;
		if($S['N']>=8 && $S['N']<=8) $S['N'] = 3;
		if($S['N']>=9 && $S['N']<=9) $S['N'] = 4;
		if($S['N']>=10 && $S['N']<=10) $S['N'] = 5;
		if($S['N']>=11 && $S['N']<=12) $S['N'] = 6;
		if($S['N']>=13 && $S['N']<=13) $S['N'] = 7;
		if($S['N']>=14 && $S['N']<=15) $S['N'] = 8;
		if($S['N']>=16 && $S['N']<=16) $S['N'] = 9;
		if($S['N']>=17 && $S['N']<=20) $S['N'] = 10;
		if($S['O']>=0 && $S['O']<=3) $S['O'] = 1;
		if($S['O']>=4 && $S['O']<=4) $S['O'] = 2;
		if($S['O']>=5 && $S['O']<=6) $S['O'] = 3;
		if($S['O']>=7 && $S['O']<=8) $S['O'] = 4;
		if($S['O']>=9 && $S['O']<=9) $S['O'] = 5;
		if($S['O']>=10 && $S['O']<=11) $S['O'] = 6;
		if($S['O']>=12 && $S['O']<=13) $S['O'] = 7;
		if($S['O']>=14 && $S['O']<=15) $S['O'] = 8;
		if($S['O']>=16 && $S['O']<=17) $S['O'] = 9;
		if($S['O']>=18 && $S['O']<=26) $S['O'] = 10;
		if($S['Q1']>=0 && $S['Q1']<=4) $S['Q1'] = 1;
		if($S['Q1']>=5 && $S['Q1']<=5) $S['Q1'] = 2;
		if($S['Q1']>=6 && $S['Q1']<=6) $S['Q1'] = 3;
		if($S['Q1']>=7 && $S['Q1']<=8) $S['Q1'] = 4;
		if($S['Q1']>=9 && $S['Q1']<=9) $S['Q1'] = 5;
		if($S['Q1']>=10 && $S['Q1']<=10) $S['Q1'] = 6;
		if($S['Q1']>=11 && $S['Q1']<=12) $S['Q1'] = 7;
		if($S['Q1']>=13 && $S['Q1']<=13) $S['Q1'] = 8;
		if($S['Q1']>=14 && $S['Q1']<=15) $S['Q1'] = 9;
		if($S['Q1']>=16 && $S['Q1']<=20) $S['Q1'] = 10;
		if($S['Q2']>=0 && $S['Q2']<=3) $S['Q2'] = 1;
		if($S['Q2']>=4 && $S['Q2']<=4) $S['Q2'] = 2;
		if($S['Q2']>=5 && $S['Q2']<=6) $S['Q2'] = 3;
		if($S['Q2']>=7 && $S['Q2']<=7) $S['Q2'] = 4;
		if($S['Q2']>=8 && $S['Q2']<=9) $S['Q2'] = 5;
		if($S['Q2']>=10 && $S['Q2']<=11) $S['Q2'] = 6;
		if($S['Q2']>=12 && $S['Q2']<=13) $S['Q2'] = 7;
		if($S['Q2']>=14 && $S['Q2']<=15) $S['Q2'] = 8;
		if($S['Q2']>=16 && $S['Q2']<=17) $S['Q2'] = 9;
		if($S['Q2']>=18 && $S['Q2']<=20) $S['Q2'] = 10;
		if($S['Q3']>=0 && $S['Q3']<=3) $S['Q3'] = 1;
		if($S['Q3']>=4 && $S['Q3']<=5) $S['Q3'] = 2;
		if($S['Q3']>=6 && $S['Q3']<=6) $S['Q3'] = 3;
		if($S['Q3']>=7 && $S['Q3']<=8) $S['Q3'] = 4;
		if($S['Q3']>=9 && $S['Q3']<=10) $S['Q3'] = 5;
		if($S['Q3']>=11 && $S['Q3']<=11) $S['Q3'] = 6;
		if($S['Q3']>=12 && $S['Q3']<=13) $S['Q3'] = 7;
		if($S['Q3']>=14 && $S['Q3']<=14) $S['Q3'] = 8;
		if($S['Q3']>=15 && $S['Q3']<=16) $S['Q3'] = 9;
		if($S['Q3']>=17 && $S['Q3']<=20) $S['Q3'] = 10;
		if($S['Q4']>=0 && $S['Q4']<=3) $S['Q4'] = 1;
		if($S['Q4']>=4 && $S['Q4']<=4) $S['Q4'] = 2;
		if($S['Q4']>=5 && $S['Q4']<=7) $S['Q4'] = 3;
		if($S['Q4']>=8 && $S['Q4']<=9) $S['Q4'] = 4;
		if($S['Q4']>=10 && $S['Q4']<=12) $S['Q4'] = 5;
		if($S['Q4']>=13 && $S['Q4']<=14) $S['Q4'] = 6;
		if($S['Q4']>=15 && $S['Q4']<=17) $S['Q4'] = 7;
		if($S['Q4']>=18 && $S['Q4']<=19) $S['Q4'] = 8;
		if($S['Q4']>=20 && $S['Q4']<=21) $S['Q4'] = 9;
		if($S['Q4']>=22 && $S['Q4']<=26) $S['Q4'] = 10;
	}

	if($in[187] == 'женский' && $in[188] == '29 - 70 лет') {
		if($S['A']>=0 && $S['A']<=4) $S['A'] = 1;
		if($S['A']>=5 && $S['A']<=6) $S['A'] = 2;
		if($S['A']>=7 && $S['A']<=8) $S['A'] = 3;
		if($S['A']>=9 && $S['A']<=10) $S['A'] = 4;
		if($S['A']>=11 && $S['A']<=11) $S['A'] = 5;
		if($S['A']>=12 && $S['A']<=13) $S['A'] = 6;
		if($S['A']>=14 && $S['A']<=15) $S['A'] = 7;
		if($S['A']>=16 && $S['A']<=16) $S['A'] = 8;
		if($S['A']>=17 && $S['A']<=18) $S['A'] = 9;
		if($S['A']>=19 && $S['A']<=20) $S['A'] = 10;
		if($S['B']>=0 && $S['B']<=1) $S['B'] = 1;
		if($S['B']>=2 && $S['B']<=2) $S['B'] = 2;
		if($S['B']>=3 && $S['B']<=3) $S['B'] = 3;
		if($S['B']>=4 && $S['B']<=4) $S['B'] = 4;
		if($S['B']>=5 && $S['B']<=5) $S['B'] = 5;
		if($S['B']>=6 && $S['B']<=6) $S['B'] = 6;
		if($S['B']>=7 && $S['B']<=7) $S['B'] = 7;
		if($S['B']>=8 && $S['B']<=9) $S['B'] = 8;
		if($S['B']>=10 && $S['B']<=10) $S['B'] = 9;
		if($S['B']>=11 && $S['B']<=13) $S['B'] = 10;
		if($S['C']>=0 && $S['C']<=7) $S['C'] = 1;
		if($S['C']>=8 && $S['C']<=9) $S['C'] = 2;
		if($S['C']>=10 && $S['C']<=11) $S['C'] = 3;
		if($S['C']>=12 && $S['C']<=13) $S['C'] = 4;
		if($S['C']>=14 && $S['C']<=15) $S['C'] = 5;
		if($S['C']>=16 && $S['C']<=17) $S['C'] = 6;
		if($S['C']>=18 && $S['C']<=20) $S['C'] = 7;
		if($S['C']>=21 && $S['C']<=22) $S['C'] = 8;
		if($S['C']>=23 && $S['C']<=24) $S['C'] = 9;
		if($S['C']>=25 && $S['C']<=26) $S['C'] = 10;
		if($S['E']>=0 && $S['E']<=2) $S['E'] = 1;
		if($S['E']>=3 && $S['E']<=3) $S['E'] = 2;
		if($S['E']>=4 && $S['E']<=5) $S['E'] = 3;
		if($S['E']>=6 && $S['E']<=7) $S['E'] = 4;
		if($S['E']>=8 && $S['E']<=9) $S['E'] = 5;
		if($S['E']>=10 && $S['E']<=11) $S['E'] = 6;
		if($S['E']>=12 && $S['E']<=14) $S['E'] = 7;
		if($S['E']>=15 && $S['E']<=16) $S['E'] = 8;
		if($S['E']>=17 && $S['E']<=18) $S['E'] = 9;
		if($S['E']>=19 && $S['E']<=26) $S['E'] = 10;
		if($S['F']>=0 && $S['F']<=4) $S['F'] = 1;
		if($S['F']>=5 && $S['F']<=6) $S['F'] = 2;
		if($S['F']>=7 && $S['F']<=8) $S['F'] = 3;
		if($S['F']>=9 && $S['F']<=10) $S['F'] = 4;
		if($S['F']>=11 && $S['F']<=13) $S['F'] = 5;
		if($S['F']>=14 && $S['F']<=15) $S['F'] = 6;
		if($S['F']>=16 && $S['F']<=17) $S['F'] = 7;
		if($S['F']>=18 && $S['F']<=19) $S['F'] = 8;
		if($S['F']>=20 && $S['F']<=21) $S['F'] = 9;
		if($S['F']>=22 && $S['F']<=26) $S['F'] = 10;
		if($S['G']>=0 && $S['G']<=6) $S['G'] = 1;
		if($S['G']>=7 && $S['G']<=7) $S['G'] = 2;
		if($S['G']>=8 && $S['G']<=9) $S['G'] = 3;
		if($S['G']>=10 && $S['G']<=11) $S['G'] = 4;
		if($S['G']>=12 && $S['G']<=13) $S['G'] = 5;
		if($S['G']>=14 && $S['G']<=15) $S['G'] = 6;
		if($S['G']>=16 && $S['G']<=16) $S['G'] = 7;
		if($S['G']>=17 && $S['G']<=17) $S['G'] = 8;
		if($S['G']>=18 && $S['G']<=19) $S['G'] = 9;
		if($S['G']>=20 && $S['G']<=20) $S['G'] = 10;
		if($S['H']>=0 && $S['H']<=2) $S['H'] = 1;
		if($S['H']>=3 && $S['H']<=4) $S['H'] = 2;
		if($S['H']>=5 && $S['H']<=7) $S['H'] = 3;
		if($S['H']>=8 && $S['H']<=9) $S['H'] = 4;
		if($S['H']>=10 && $S['H']<=12) $S['H'] = 5;
		if($S['H']>=13 && $S['H']<=14) $S['H'] = 6;
		if($S['H']>=15 && $S['H']<=17) $S['H'] = 7;
		if($S['H']>=18 && $S['H']<=20) $S['H'] = 8;
		if($S['H']>=21 && $S['H']<=22) $S['H'] = 9;
		if($S['H']>=23 && $S['H']<=26) $S['H'] = 10;
		if($S['I']>=0 && $S['I']<=5) $S['I'] = 1;
		if($S['I']>=6 && $S['I']<=7) $S['I'] = 2;
		if($S['I']>=8 && $S['I']<=8) $S['I'] = 3;
		if($S['I']>=9 && $S['I']<=10) $S['I'] = 4;
		if($S['I']>=11 && $S['I']<=11) $S['I'] = 5;
		if($S['I']>=12 && $S['I']<=13) $S['I'] = 6;
		if($S['I']>=14 && $S['I']<=14) $S['I'] = 7;
		if($S['I']>=15 && $S['I']<=16) $S['I'] = 8;
		if($S['I']>=17 && $S['I']<=17) $S['I'] = 9;
		if($S['I']>=18 && $S['I']<=20) $S['I'] = 10;
		if($S['L']>=0 && $S['L']<=1) $S['L'] = 1;
		if($S['L']>=2 && $S['L']<=2) $S['L'] = 2;
		if($S['L']>=3 && $S['L']<=4) $S['L'] = 3;
		if($S['L']>=5 && $S['L']<=5) $S['L'] = 4;
		if($S['L']>=6 && $S['L']<=7) $S['L'] = 5;
		if($S['L']>=8 && $S['L']<=8) $S['L'] = 6;
		if($S['L']>=9 && $S['L']<=10) $S['L'] = 7;
		if($S['L']>=11 && $S['L']<=11) $S['L'] = 8;
		if($S['L']>=12 && $S['L']<=13) $S['L'] = 9;
		if($S['L']>=14 && $S['L']<=20) $S['L'] = 10;
		if($S['M']>=0 && $S['M']<=6) $S['M'] = 1;
		if($S['M']>=7 && $S['M']<=7) $S['M'] = 2;
		if($S['M']>=8 && $S['M']<=9) $S['M'] = 3;
		if($S['M']>=10 && $S['M']<=11) $S['M'] = 4;
		if($S['M']>=12 && $S['M']<=12) $S['M'] = 5;
		if($S['M']>=13 && $S['M']<=14) $S['M'] = 6;
		if($S['M']>=15 && $S['M']<=16) $S['M'] = 7;
		if($S['M']>=17 && $S['M']<=17) $S['M'] = 8;
		if($S['M']>=18 && $S['M']<=19) $S['M'] = 9;
		if($S['M']>=20 && $S['M']<=26) $S['M'] = 10;
		if($S['N']>=0 && $S['N']<=5) $S['N'] = 1;
		if($S['N']>=6 && $S['N']<=6) $S['N'] = 2;
		if($S['N']>=7 && $S['N']<=7) $S['N'] = 3;
		if($S['N']>=8 && $S['N']<=9) $S['N'] = 4;
		if($S['N']>=10 && $S['N']<=10) $S['N'] = 5;
		if($S['N']>=11 && $S['N']<=11) $S['N'] = 6;
		if($S['N']>=12 && $S['N']<=13) $S['N'] = 7;
		if($S['N']>=14 && $S['N']<=14) $S['N'] = 8;
		if($S['N']>=15 && $S['N']<=15) $S['N'] = 9;
		if($S['N']>=16 && $S['N']<=20) $S['N'] = 10;
		if($S['O']>=0 && $S['O']<=3) $S['O'] = 1;
		if($S['O']>=4 && $S['O']<=4) $S['O'] = 2;
		if($S['O']>=5 && $S['O']<=6) $S['O'] = 3;
		if($S['O']>=7 && $S['O']<=8) $S['O'] = 4;
		if($S['O']>=9 && $S['O']<=10) $S['O'] = 5;
		if($S['O']>=11 && $S['O']<=12) $S['O'] = 6;
		if($S['O']>=13 && $S['O']<=14) $S['O'] = 7;
		if($S['O']>=15 && $S['O']<=16) $S['O'] = 8;
		if($S['O']>=17 && $S['O']<=18) $S['O'] = 9;
		if($S['O']>=19 && $S['O']<=26) $S['O'] = 10;
		if($S['Q1']>=0 && $S['Q1']<=3) $S['Q1'] = 1;
		if($S['Q1']>=4 && $S['Q1']<=4) $S['Q1'] = 2;
		if($S['Q1']>=5 && $S['Q1']<=5) $S['Q1'] = 3;
		if($S['Q1']>=6 && $S['Q1']<=7) $S['Q1'] = 4;
		if($S['Q1']>=8 && $S['Q1']<=8) $S['Q1'] = 5;
		if($S['Q1']>=9 && $S['Q1']<=9) $S['Q1'] = 6;
		if($S['Q1']>=10 && $S['Q1']<=11) $S['Q1'] = 7;
		if($S['Q1']>=12 && $S['Q1']<=13) $S['Q1'] = 8;
		if($S['Q1']>=14 && $S['Q1']<=14) $S['Q1'] = 9;
		if($S['Q1']>=15 && $S['Q1']<=20) $S['Q1'] = 10;
		if($S['Q2']>=0 && $S['Q2']<=3) $S['Q2'] = 1;
		if($S['Q2']>=4 && $S['Q2']<=4) $S['Q2'] = 2;
		if($S['Q2']>=5 && $S['Q2']<=6) $S['Q2'] = 3;
		if($S['Q2']>=7 && $S['Q2']<=8) $S['Q2'] = 4;
		if($S['Q2']>=9 && $S['Q2']<=9) $S['Q2'] = 5;
		if($S['Q2']>=10 && $S['Q2']<=11) $S['Q2'] = 6;
		if($S['Q2']>=12 && $S['Q2']<=13) $S['Q2'] = 7;
		if($S['Q2']>=14 && $S['Q2']<=15) $S['Q2'] = 8;
		if($S['Q2']>=16 && $S['Q2']<=17) $S['Q2'] = 9;
		if($S['Q2']>=18 && $S['Q2']<=20) $S['Q2'] = 10;
		if($S['Q3']>=0 && $S['Q3']<=5) $S['Q3'] = 1;
		if($S['Q3']>=6 && $S['Q3']<=7) $S['Q3'] = 2;
		if($S['Q3']>=8 && $S['Q3']<=8) $S['Q3'] = 3;
		if($S['Q3']>=9 && $S['Q3']<=10) $S['Q3'] = 4;
		if($S['Q3']>=11 && $S['Q3']<=11) $S['Q3'] = 5;
		if($S['Q3']>=12 && $S['Q3']<=13) $S['Q3'] = 6;
		if($S['Q3']>=14 && $S['Q3']<=14) $S['Q3'] = 7;
		if($S['Q3']>=15 && $S['Q3']<=16) $S['Q3'] = 8;
		if($S['Q3']>=17 && $S['Q3']<=17) $S['Q3'] = 9;
		if($S['Q3']>=18 && $S['Q3']<=20) $S['Q3'] = 10;
		if($S['Q4']>=0 && $S['Q4']<=2) $S['Q4'] = 1;
		if($S['Q4']>=3 && $S['Q4']<=4) $S['Q4'] = 2;
		if($S['Q4']>=5 && $S['Q4']<=7) $S['Q4'] = 3;
		if($S['Q4']>=8 && $S['Q4']<=10) $S['Q4'] = 4;
		if($S['Q4']>=11 && $S['Q4']<=12) $S['Q4'] = 5;
		if($S['Q4']>=13 && $S['Q4']<=15) $S['Q4'] = 6;
		if($S['Q4']>=16 && $S['Q4']<=17) $S['Q4'] = 7;
		if($S['Q4']>=18 && $S['Q4']<=20) $S['Q4'] = 8;
		if($S['Q4']>=21 && $S['Q4']<=22) $S['Q4'] = 9;
		if($S['Q4']>=23 && $S['Q4']<=26) $S['Q4'] = 10;
	}

	if($in[187] == 'мужской' && $in[188] == '29 - 70 лет') {
		if($S['A']>=0 && $S['A']<=3) $S['A'] = 1;
		if($S['A']>=4 && $S['A']<=4) $S['A'] = 2;
		if($S['A']>=5 && $S['A']<=6) $S['A'] = 3;
		if($S['A']>=7 && $S['A']<=7) $S['A'] = 4;
		if($S['A']>=8 && $S['A']<=9) $S['A'] = 5;
		if($S['A']>=10 && $S['A']<=11) $S['A'] = 6;
		if($S['A']>=12 && $S['A']<=13) $S['A'] = 7;
		if($S['A']>=14 && $S['A']<=14) $S['A'] = 8;
		if($S['A']>=15 && $S['A']<=16) $S['A'] = 9;
		if($S['A']>=17 && $S['A']<=20) $S['A'] = 10;
		if($S['B']>=0 && $S['B']<=1) $S['B'] = 1;
		if($S['B']>=2 && $S['B']<=2) $S['B'] = 2;
		if($S['B']>=3 && $S['B']<=3) $S['B'] = 3;
		if($S['B']>=4 && $S['B']<=4) $S['B'] = 4;
		if($S['B']>=5 && $S['B']<=5) $S['B'] = 5;
		if($S['B']>=6 && $S['B']<=6) $S['B'] = 6;
		if($S['B']>=7 && $S['B']<=7) $S['B'] = 7;
		if($S['B']>=8 && $S['B']<=9) $S['B'] = 8;
		if($S['B']>=10 && $S['B']<=10) $S['B'] = 9;
		if($S['B']>=11 && $S['B']<=13) $S['B'] = 10;
		if($S['C']>=0 && $S['C']<=7) $S['C'] = 1;
		if($S['C']>=8 && $S['C']<=10) $S['C'] = 2;
		if($S['C']>=11 && $S['C']<=12) $S['C'] = 3;
		if($S['C']>=13 && $S['C']<=14) $S['C'] = 4;
		if($S['C']>=15 && $S['C']<=16) $S['C'] = 5;
		if($S['C']>=17 && $S['C']<=17) $S['C'] = 6;
		if($S['C']>=18 && $S['C']<=19) $S['C'] = 7;
		if($S['C']>=20 && $S['C']<=21) $S['C'] = 8;
		if($S['C']>=22 && $S['C']<=23) $S['C'] = 9;
		if($S['C']>=24 && $S['C']<=26) $S['C'] = 10;
		if($S['E']>=0 && $S['E']<=5) $S['E'] = 1;
		if($S['E']>=6 && $S['E']<=7) $S['E'] = 2;
		if($S['E']>=8 && $S['E']<=9) $S['E'] = 3;
		if($S['E']>=10 && $S['E']<=11) $S['E'] = 4;
		if($S['E']>=12 && $S['E']<=13) $S['E'] = 5;
		if($S['E']>=14 && $S['E']<=15) $S['E'] = 6;
		if($S['E']>=16 && $S['E']<=17) $S['E'] = 7;
		if($S['E']>=18 && $S['E']<=19) $S['E'] = 8;
		if($S['E']>=20 && $S['E']<=21) $S['E'] = 9;
		if($S['E']>=22 && $S['E']<=26) $S['E'] = 10;
		if($S['F']>=0 && $S['F']<=3) $S['F'] = 1;
		if($S['F']>=4 && $S['F']<=5) $S['F'] = 2;
		if($S['F']>=6 && $S['F']<=8) $S['F'] = 3;
		if($S['F']>=9 && $S['F']<=10) $S['F'] = 4;
		if($S['F']>=11 && $S['F']<=13) $S['F'] = 5;
		if($S['F']>=14 && $S['F']<=15) $S['F'] = 6;
		if($S['F']>=16 && $S['F']<=17) $S['F'] = 7;
		if($S['F']>=18 && $S['F']<=19) $S['F'] = 8;
		if($S['F']>=20 && $S['F']<=20) $S['F'] = 9;
		if($S['F']>=21 && $S['F']<=26) $S['F'] = 10;
		if($S['G']>=0 && $S['G']<=4) $S['G'] = 1;
		if($S['G']>=5 && $S['G']<=7) $S['G'] = 2;
		if($S['G']>=8 && $S['G']<=10) $S['G'] = 3;
		if($S['G']>=11 && $S['G']<=12) $S['G'] = 4;
		if($S['G']>=13 && $S['G']<=13) $S['G'] = 5;
		if($S['G']>=14 && $S['G']<=15) $S['G'] = 6;
		if($S['G']>=16 && $S['G']<=17) $S['G'] = 7;
		if($S['G']>=18 && $S['G']<=18) $S['G'] = 8;
		if($S['G']>=19 && $S['G']<=19) $S['G'] = 9;
		if($S['G']>=20 && $S['G']<=20) $S['G'] = 10;
		if($S['H']>=0 && $S['H']<=3) $S['H'] = 1;
		if($S['H']>=4 && $S['H']<=5) $S['H'] = 2;
		if($S['H']>=6 && $S['H']<=8) $S['H'] = 3;
		if($S['H']>=9 && $S['H']<=11) $S['H'] = 4;
		if($S['H']>=12 && $S['H']<=14) $S['H'] = 5;
		if($S['H']>=15 && $S['H']<=16) $S['H'] = 6;
		if($S['H']>=17 && $S['H']<=19) $S['H'] = 7;
		if($S['H']>=20 && $S['H']<=21) $S['H'] = 8;
		if($S['H']>=22 && $S['H']<=23) $S['H'] = 9;
		if($S['H']>=24 && $S['H']<=26) $S['H'] = 10;
		if($S['I']>=0 && $S['I']<=2) $S['I'] = 1;
		if($S['I']>=3 && $S['I']<=3) $S['I'] = 2;
		if($S['I']>=4 && $S['I']<=4) $S['I'] = 3;
		if($S['I']>=5 && $S['I']<=6) $S['I'] = 4;
		if($S['I']>=7 && $S['I']<=8) $S['I'] = 5;
		if($S['I']>=9 && $S['I']<=10) $S['I'] = 6;
		if($S['I']>=11 && $S['I']<=12) $S['I'] = 7;
		if($S['I']>=13 && $S['I']<=14) $S['I'] = 8;
		if($S['I']>=15 && $S['I']<=15) $S['I'] = 9;
		if($S['I']>=16 && $S['I']<=20) $S['I'] = 10;
		if($S['L']>=0 && $S['L']<=2) $S['L'] = 1;
		if($S['L']>=3 && $S['L']<=3) $S['L'] = 2;
		if($S['L']>=4 && $S['L']<=5) $S['L'] = 3;
		if($S['L']>=6 && $S['L']<=7) $S['L'] = 4;
		if($S['L']>=8 && $S['L']<=8) $S['L'] = 5;
		if($S['L']>=9 && $S['L']<=10) $S['L'] = 6;
		if($S['L']>=11 && $S['L']<=12) $S['L'] = 7;
		if($S['L']>=13 && $S['L']<=13) $S['L'] = 8;
		if($S['L']>=14 && $S['L']<=15) $S['L'] = 9;
		if($S['L']>=16 && $S['L']<=20) $S['L'] = 10;
		if($S['M']>=0 && $S['M']<=5) $S['M'] = 1;
		if($S['M']>=6 && $S['M']<=7) $S['M'] = 2;
		if($S['M']>=8 && $S['M']<=8) $S['M'] = 3;
		if($S['M']>=9 && $S['M']<=10) $S['M'] = 4;
		if($S['M']>=11 && $S['M']<=11) $S['M'] = 5;
		if($S['M']>=12 && $S['M']<=13) $S['M'] = 6;
		if($S['M']>=14 && $S['M']<=15) $S['M'] = 7;
		if($S['M']>=16 && $S['M']<=17) $S['M'] = 8;
		if($S['M']>=18 && $S['M']<=19) $S['M'] = 9;
		if($S['M']>=20 && $S['M']<=26) $S['M'] = 10;
		if($S['N']>=0 && $S['N']<=6) $S['N'] = 1;
		if($S['N']>=7 && $S['N']<=7) $S['N'] = 2;
		if($S['N']>=8 && $S['N']<=9) $S['N'] = 3;
		if($S['N']>=10 && $S['N']<=10) $S['N'] = 4;
		if($S['N']>=11 && $S['N']<=11) $S['N'] = 5;
		if($S['N']>=12 && $S['N']<=13) $S['N'] = 6;
		if($S['N']>=14 && $S['N']<=14) $S['N'] = 7;
		if($S['N']>=15 && $S['N']<=15) $S['N'] = 8;
		if($S['N']>=16 && $S['N']<=17) $S['N'] = 9;
		if($S['N']>=18 && $S['N']<=20) $S['N'] = 10;
		if($S['O']>=0 && $S['O']<=2) $S['O'] = 1;
		if($S['O']>=3 && $S['O']<=3) $S['O'] = 2;
		if($S['O']>=4 && $S['O']<=5) $S['O'] = 3;
		if($S['O']>=6 && $S['O']<=7) $S['O'] = 4;
		if($S['O']>=8 && $S['O']<=9) $S['O'] = 5;
		if($S['O']>=10 && $S['O']<=11) $S['O'] = 6;
		if($S['O']>=12 && $S['O']<=12) $S['O'] = 7;
		if($S['O']>=13 && $S['O']<=15) $S['O'] = 8;
		if($S['O']>=16 && $S['O']<=17) $S['O'] = 9;
		if($S['O']>=18 && $S['O']<=26) $S['O'] = 10;
		if($S['Q1']>=0 && $S['Q1']<=4) $S['Q1'] = 1;
		if($S['Q1']>=5 && $S['Q1']<=6) $S['Q1'] = 2;
		if($S['Q1']>=7 && $S['Q1']<=7) $S['Q1'] = 3;
		if($S['Q1']>=8 && $S['Q1']<=8) $S['Q1'] = 4;
		if($S['Q1']>=9 && $S['Q1']<=10) $S['Q1'] = 5;
		if($S['Q1']>=11 && $S['Q1']<=11) $S['Q1'] = 6;
		if($S['Q1']>=12 && $S['Q1']<=13) $S['Q1'] = 7;
		if($S['Q1']>=14 && $S['Q1']<=14) $S['Q1'] = 8;
		if($S['Q1']>=15 && $S['Q1']<=16) $S['Q1'] = 9;
		if($S['Q1']>=17 && $S['Q1']<=20) $S['Q1'] = 10;
		if($S['Q2']>=0 && $S['Q2']<=3) $S['Q2'] = 1;
		if($S['Q2']>=4 && $S['Q2']<=4) $S['Q2'] = 2;
		if($S['Q2']>=5 && $S['Q2']<=6) $S['Q2'] = 3;
		if($S['Q2']>=7 && $S['Q2']<=8) $S['Q2'] = 4;
		if($S['Q2']>=9 && $S['Q2']<=10) $S['Q2'] = 5;
		if($S['Q2']>=11 && $S['Q2']<=11) $S['Q2'] = 6;
		if($S['Q2']>=12 && $S['Q2']<=13) $S['Q2'] = 7;
		if($S['Q2']>=14 && $S['Q2']<=15) $S['Q2'] = 8;
		if($S['Q2']>=16 && $S['Q2']<=17) $S['Q2'] = 9;
		if($S['Q2']>=18 && $S['Q2']<=20) $S['Q2'] = 10;
		if($S['Q3']>=0 && $S['Q3']<=4) $S['Q3'] = 1;
		if($S['Q3']>=5 && $S['Q3']<=6) $S['Q3'] = 2;
		if($S['Q3']>=7 && $S['Q3']<=8) $S['Q3'] = 3;
		if($S['Q3']>=9 && $S['Q3']<=9) $S['Q3'] = 4;
		if($S['Q3']>=10 && $S['Q3']<=11) $S['Q3'] = 5;
		if($S['Q3']>=12 && $S['Q3']<=12) $S['Q3'] = 6;
		if($S['Q3']>=13 && $S['Q3']<=14) $S['Q3'] = 7;
		if($S['Q3']>=15 && $S['Q3']<=15) $S['Q3'] = 8;
		if($S['Q3']>=16 && $S['Q3']<=17) $S['Q3'] = 9;
		if($S['Q3']>=18 && $S['Q3']<=20) $S['Q3'] = 10;
		if($S['Q4']>=0 && $S['Q4']<=0) $S['Q4'] = 1;
		if($S['Q4']>=1 && $S['Q4']<=2) $S['Q4'] = 2;
		if($S['Q4']>=3 && $S['Q4']<=5) $S['Q4'] = 3;
		if($S['Q4']>=6 && $S['Q4']<=7) $S['Q4'] = 4;
		if($S['Q4']>=8 && $S['Q4']<=10) $S['Q4'] = 5;
		if($S['Q4']>=11 && $S['Q4']<=12) $S['Q4'] = 6;
		if($S['Q4']>=13 && $S['Q4']<=15) $S['Q4'] = 7;
		if($S['Q4']>=16 && $S['Q4']<=17) $S['Q4'] = 8;
		if($S['Q4']>=18 && $S['Q4']<=19) $S['Q4'] = 9;
		if($S['Q4']>=20 && $S['Q4']<=26) $S['Q4'] = 10;
	};
	
	$S['F1'] = (38 + 2 * $S['L'] + 3 * $S['O'] + 4 * $S['Q4']  - 2 * $S['C'] - 2 * $S['H'] - 2 * $S['Q3']) / 10;
	$S['F2'] = (2 * $S['A'] + 3 * $S['E'] + 4 * $S['F'] + 5 * $S['H'] - 2 * $S['Q2'] - 11) / 10;
	$S['F3'] = (77 + 2 * $S['C'] + 2 * $S['E'] + 2 * $S['F'] + 2 * $S['N'] - 4 * $S['A'] - 6 * $S['I'] - 2 * $S['M']) / 10;
	$S['F4'] = (4 * $S['E'] + 3 * $S['M'] + 4 * $S['Q1'] + 4 * $S['Q2'] - 3 * $S['A'] - 2 * $S['G']) / 10;
	
	$S['RESULT_CHART'] = serialize($S);
	
	// https://psytests.org/result?v=ctlA1MtD8sCgw-lVW7uEhWH3pt&m=full
	/*
	$S['RESULT_SHORT'].= '<strong>Фактор A: «замкнутость – общительность»</strong> — '.$S['A'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор B: интеллект</strong> — '.$S['B'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор C: «эмоциональная нестабильность – стабильность»</strong> — '.$S['C'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор E: «подчиненность – доминантность»</strong> — '.$S['E'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор F: «сдержанность – экспрессивность»</strong> — '.$S['F'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор G: «низкая нормативность поведения – высокая нормативность поведения»</strong> — '.$S['G'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор H: «робость – смелость»</strong> — '.$S['H'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор I: «жесткость – чувствительность»</strong> — '.$S['I'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор L: «доверчивость – подозрительность»</strong> — '.$S['L'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор M: «практичность – мечтательность»</strong> — '.$S['M'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор N: «прямолинейность – дипломатичность»</strong> — '.$S['N'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор O: «спокойствие – тревожность»</strong> — '.$S['O'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор Q1: «консерватизм – радикализм»</strong> — '.$S['O'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор Q2: «конформизм – нонконформизм»</strong> — '.$S['O'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор Q3: «низкий самоконтроль – высокий самоконтроль»</strong> — '.$S['O'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор Q4: «расслабленность – напряженность»</strong> — '.$S['O'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор Q4: «расслабленность – напряженность»</strong> — '.$S['O'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор F1: тревожность</strong> — '.$S['F1'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор F1: экстраверсия</strong> — '.$S['F2'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор F1: эмоциональная лабильность</strong> — '.$S['F3'].' стен.<br>';
	$S['RESULT_SHORT'].= '<strong>Фактор F1: доминантность</strong> — '.$S['F4'].' стен.<br>';
	*/
	
	//short - первые 5 шлкал сокращенно
	//full - первые  5 шкал подробно
	//extended - все шкалы подробно + график
	
	//(от 1 до 5,5) «−» (от 5,5 до 10) «+»
	//низкие ⇒ средние ⇒ высокие значения 	[1 3] [4 7] [8 10]
	//Стремление выглядеть лучше (MD) 0-9 10-15
	//Стремление выглядеть хуже (FB) 0-5 6-14

	
	
	if($type == 'short') {
		$RESULT['TEXT'] = '';
		foreach ($S as $key => $value) {
			$desc = ''; 
			$title = '';
			switch ($key) {
				case 'A':
					$title = 'Фактор A: «замкнутость – общительность»';
					if($value <= 5.5) $desc .= "Для обследуемого характерны скрытность, обособленность, отчужденность, недоверчивость, необщительность, замкнутость, критичность, склонность к объективности, ригидности, к излишней строгости в оценке людей.";
					if($value >= 5.5) $desc .= "Для обследуемого характерны общительность, открытость, естественность, непринужденность, готовность к сотрудничеству, приспособляемость, внимание к людям, готовность к совместной работе, активность в устранении конфликтов в группе, готовность идти на поводу. ";
				break;	
				case 'B':
					$title = 'Фактор В: интеллект';
					if($value <= 5.5) $desc .= "Для обследуемого характерны конкретность и некоторая ригидность мышления, затруднения в решении абстрактных задач, сниженная оперативность мышления, недостаточный уровень общей вербальной культуры.";
					if($value >= 5.5) $desc .= "Развитое абстрактное мышление, оперативность, сообразительность, быстрая обучаемость. Достаточно высокий уровень общей культуры, особенно вербальной.";
				break;
				case 'C':
					$title = 'Фактор С: «эмоциональная нестабильность -эмоциональная стабильность»';
					if($value <= 5.5) $desc .= "Эмоциональная неустойчивость, импульсивность; человек находится под влиянием чувств, переменчив в настроениях, легко расстраивается, неустойчив в интересах. Низкая толерантность по отношению к фрустрации, раздражительность, утомляемость.";
					if($value >= 5.5) $desc .= "Эмоциональная устойчивость, выдержанность; человек эмоционально зрелый, спокойный, устойчив в интересах, работоспособный, может быть ригидным, ориентирован на реальность.";
				break;	
				
				case 'E':
					$title = 'Фактор Е: «подчиненность-доминантность»';
					if($value <= 5.5) $desc .= "Мягкость, уступчивость, тактичность, кроткость, любезность, зависимость, безропотность, услужливость, почтительность, застенчивость, готовность брать вину на себя, скромность, экспрессивность, склонность легко выходить из равновесия.";
					if($value >= 5.5) $desc .= "Самостоятельность, независимость, настойчивость, упрямство, напористость, своенравие, иногда конфликтность, агрессивность, отказ от признания внешней власти, склонность к авторитарному поведению, жажда восхищения, бунтарь.";
				break;	

				case 'F':
					$title = 'Фактор F: «сдержанность - экспрессивность»';
					if($value <= 5.5) $desc .= "Благоразумие, осторожность, рассудительность в выборе партнера по общению. Склонность к озабоченности, беспокойству о будущем, пессимистичность в восприятии действительности, сдержанность в проявлении эмоций.";
					if($value >= 5.5) $desc .= "Жизнерадостность, импульсивность, восторженность, беспечность, безрассудность в выборе партнеров по общению, эмоциональная значимость социальных контактов, экспрессивность, экспансивность, эмоциональная яркость в отношениях между людьми, динамичность общения, которая предполагает эмоциональное лидерство в группах";
				break;	

				default:
					continue;
			}
			if($title != '') {
				$RESULT['TEXT'].= "<b>".$title."</b> (".$value.")<br>".$desc."<br><br>\n";
			}
		}
	}
	
	
	if($type == 'full' || $type == 'extended') {
		$RESULT['TEXT'] = '';
		foreach ($S as $key => $value) {
			$desc = ''; 
			$title = '';
			switch ($key) {
				case 'A':
					$title = 'Фактор A: «замкнутость – общительность»';
					if($value <= 5.5) $desc .= "Для обследуемого характерны скрытность, обособленность, отчужденность, недоверчивость, необщительность, замкнутость, критичность, склонность к объективности, ригидности, к излишней строгости в оценке людей. Этот полюс шкалы А- в техническом названии именуется sizothymia (от латинского слова sizo, что означает скучный, унылый). Эмоционально «вялая», «сухая» личность имеет склонность к осторожности при выражении чувств, она мало экспрессивна. Личность с полюсом А- любит идеи, предпочитает работать одна. <b>Личности с полюсом А- могут быть художниками, учеными-исследователями и предпочитают работать самостоятельно, изолированно от группы.</b> ";
					if($value >= 5.5) $desc .= "Для обследуемого характерны общительность, открытость, естественность, непринужденность, готовность к сотрудничеству, приспособляемость, внимание к людям, готовность к совместной работе, активность в устранении конфликтов в группе, готовность идти на поводу. Легкость в установлении непосредственных, межличностных контактов. ";
					
					if($value >= 1 && $value <= 3)  $desc .= "Склонен к ригидности, холодности, скептицизму и отчужденности. Вещи его привлекают больше, чем люди. Предпочитает работать сам, избегая компромиссов. Склонен к точности, ригидности в деятельности, личных установках. Во многих профессиях это желательно. Иногда он склонен быть критически настроенным, несгибаемым, твердым, жестким. ";
					if($value == 4) $desc .= "Cдержанный, обособленный, критический, холодный (шизотимия). ";
					if($value == 7) $desc .= "Обращенный вовне, легкий в общении, участвующий аффективно (циклотимия). ";
					if($value >= 8 && $value <= 10) $desc .= "Cклонность к добродушию, легкости в общении, эмоциональному выражению; готов к сотрудничеству, внимателен к людям, мягкосердечен, добр, приспособляем. Предпочитает ту деятельность, где есть занятия с людьми, ситуации с социальным значением. Этот человек легко включается в активные группы. Он щедр в личных отношениях, не боится критики. Хорошо запоминает события, фамилии, имена и отчества. ";
				break;	
				
				case 'B':
					$title = 'Фактор В: интеллект. <span class="subtitle">Фактор В не определяет уровень интеллекта, он ориентирован на измерение оперативности мышления и общего уровня вербальной культуры и эрудиции. Фактор В - единственный фактор методики, который не является строго валидизированным. Поэтому результаты по этому фактору являются <b>ориентировочными</b>.</span>';
					if($value <= 5.5) $desc .= "Для обследуемого характерны конкретность и некоторая ригидность мышления, затруднения в решении абстрактных задач, сниженная оперативность мышления, недостаточный уровень общей вербальной культуры. ";
					if($value >= 5.5) $desc .= "Развитое абстрактное мышление, оперативность, сообразительность, быстрая обучаемость. Достаточно высокий уровень общей культуры, особенно вербальной. ";
					
					
					if($value >= 1 && $value <= 3) $desc .= "Cклонен медленнее понимать материал при обучении. «Туповат», предпочитает конкретную, буквальную интерпретацию. Его «тупость» или отражает низкий интеллект, или является следствием снижения функций в результате психопатологии. ";
					if($value == 4) $desc .= "Менее интеллектуально развит, конкретно мыслит (меньшая способность к обучению). ";
					if($value == 7) $desc .= "Более интеллектуально развит, абстрактно мыслящий, разумный (высокая способность к обучению). ";
					if($value >= 8 && $value <= 10) $desc .= "Быстро воспринимает и усваивает новый учебный материал. Имеется некоторая корреляция с культурным уровнем, а также с реактивностью. Высокие баллы указывают на отсутствие снижения функций интеллекта в патологических состояниях. ";
				break;
				
				case 'C':
					$title = 'Фактор С: «эмоциональная нестабильность - эмоциональная стабильность». <span>Этот фактор характеризует динамическое обобщение и зрелость эмоций в противоположность нерегулируемой эмоциональности. Психоаналитики пытались описать этот фактор как эго-силу и эго-слабость.</span>';
					if($value <= 5.5) $desc .= "Эмоциональная неустойчивость, импульсивность; человек находится под влиянием чувств, переменчив в настроениях, легко расстраивается, неустойчив в интересах. Низкая толерантность по отношению к фрустрации, раздражительность, утомляемость.";
					if($value >= 5.5) $desc .= "Эмоциональная устойчивость, выдержанность; человек эмоционально зрелый, спокойный, устойчив в интересах, работоспособный, может быть ригидным, ориентирован на реальность.";
					
					if($value <= 5.5) $desc .= "Личность с полюсом C- легко раздражается из-за тех или иных событий или людей, не удовлетворена жизненными ситуациями, собственным здоровьем, кроме того, это личность безвольная. ";
					if($value >= 5.5) $desc .= "Люди с высокой оценкой по фактору C+ чаще являются лидерами. ";
					if($value >= 4) $desc .= "Личности свойственны более высокие моральные качества. ";
					if($value >= 5.5) $desc .= "Личность подходит для <b>профессий</b>, требующих преодоления стрессовых ситуаций (руководители, летчики, спасатели и т. д.). ";
					if($value <= 5.5) $desc .= "Личности подходят <b>профессии</b>, где не требуется быстрого принятия решений, эмоциональной стабильности и где можно решать вопрос самому (художники, почтальоны и т. д.). ";
					if($value >= 1 && $value <= 3) $desc .= "У личности имеется низкий порог в отношении фрустрации, изменчивый и пластичный, избегающий требований действительности, невротически утомляемый, раздражительный, эмоционально возбудимый, имеющий невротическую симптоматику (фобии, нарушения сна, психосоматические расстройства). Низкий порог свойствен всем формам невротических и некоторым психическим расстройствам. ";
					if($value == 4) $desc .= "Обследуемый чувствительный, эмоционально менее устойчивый, легко расстраивается. ";
					if($value == 7) $desc .= "Обследуемый эмоционально устойчивый, трезво оценивающий действительность, активный, зрелый. ";
					if($value >= 8 && $value <= 10) $desc .= "Обследуемый эмоционально зрелый, устойчивый, невозмутимый. Имеет высокую способность к соблюдению общественных моральных норм. Иногда смиренная покорность перед нерешенными эмоциональными проблемами. Хороший уровень «С» позволяет адаптироваться даже при психических расстройствах. ";
				break;	
				
				case 'E':
					$title = 'Фактор Е: «подчиненность-доминантность». <span>Фактор Е не очень существенно коррелирует с достижениями лидерства, однако связан с социальным статусом и выше у лидеров, чем у последователей. Существует предположение, что оценки по этому фактору с возрастом меняются и зависят от пола испытуемого.</span>';
					if($value <= 5.5) $desc .= "Мягкость, уступчивость, тактичность, кроткость, любезность, зависимость, безропотность, услужливость, почтительность, застенчивость, готовность брать вину на себя, скромность, экспрессивность, склонность легко выходить из равновесия. ";
					if($value >= 5.5) $desc .= "Самостоятельность, независимость, настойчивость, упрямство, напористость, своенравие, иногда конфликтность, агрессивность, отказ от признания внешней власти, склонность к авторитарному поведению, жажда восхищения, бунтарь. ";
					
					if($value >= 1 && $value <= 3) $desc .= "Уступающий другим, покорный. Часто зависим, признает свою вину. Стремится к навязчивому соблюдению корректности, правил. Эта пассивность является частью многих невротических синдромов. ";
					if($value == 4) $desc .= "Скромный, покорный, мягкий, уступчивый, податливый, конформный, приспособляющийся. ";
					if($value == 7) $desc .= "Самоутверждающийся, независимый, агрессивный, упрямый (доминантный). ";
					if($value >= 8 && $value <= 10) $desc .= "Утверждающий себя, свое «Я», самоуверенный, независимо мыслящий. Склонен к аскетизму, руководствуется собственными правилами поведения, враждебный и экстрапунитивный (авторитарный), командует другими, не признает авторитетов. ";
				break;	

				case 'F':
					$title = 'Фактор F: «сдержанность - экспрессивность»';
					if($value <= 5.5) $desc .= "Благоразумие, осторожность, рассудительность в выборе партнера по общению. Склонность к озабоченности, беспокойству о будущем, пессимистичность в восприятии действительности, сдержанность в проявлении эмоций. Актеры, эффективные лидеры имеют более высокие оценки. В целом фактор F ориентирован на измерение эмоциональной окрашенности и динамичности в процессах общения - например, художники, последователи имеют более низкие оценки.";
					if($value >= 5.5) $desc .= "Жизнерадостность, импульсивность, восторженность, беспечность, безрассудность в выборе партнеров по общению, эмоциональная значимость социальных контактов, экспрессивность, экспансивность, эмоциональная яркость в отношениях между людьми, динамичность общения, которая предполагает эмоциональное лидерство в группах. В целом фактор F ориентирован на измерение эмоциональной окрашенности и динамичности в процессах общения - например, актеры, эффективные лидеры имеют более высокие оценки. ";
					
					if($value >= 1 && $value <= 3) $desc .= "Неторопливый, сдержанный. Иногда мрачен, пессимистичен, осмотрителен. Считается очень точным, трезвым, надежным человеком. ";
					if($value == 4) $desc .= "Трезвый, осторожный, серьезный, молчаливый. ";
					if($value == 7) $desc .= "Безалаберный, импульсивно-живой, веселый, полный энтузиазма. ";
					if($value >= 8 && $value <= 10) $desc .= "Веселый, активный, разговорчивый, беззаботный, может быть импульсивен. ";
				break;	

				default:
					continue;
			}
			if($title != '') {
				$RESULT['TEXT'].= "<b>".$title."</b> (".$value.")<br>".$desc."<br><br>\n";
			}
		}
	}
	
	if($type == 'extended') {
		foreach ($S as $key => $value) {
			$desc = ''; 
			$title = '';
			switch ($key) {
				case 'G':
					$title = 'Фактор G: «низкая нормативность поведения – высокая нормативность поведения»';
					if($value <= 5.5) $desc .= "Склонность к непостоянству, подверженность влиянию чувств, случая и обстоятельств. Потворствует своим желаниям, не делает усилий по выполнению групповых требований и норм. Неорганизованность, безответственность, импульсивность, отсутствие согласия с общепринятыми моральными правилами и стандартами, гибкость по отношению к социальным нормам, свобода от их влияния, иногда беспринципность и склонность к асоциальному поведению. Психоаналитики интерпретируют этот фактор как высокое супер-эго и как низкое супер-эго (в данном случае - низкое супер-эго). <br><i>Следует быть особо внимательным в анализе низких оценок по данному фактору (G-) так как нет прямолинейной зависимости низких оценок от выраженного асоциального поведения (например, с преступниками). Напротив, известно, что многие люди, не воспринимающие «мораль среднего класса», «интеллектуалы», «эмансипированные личности», лица, выражающие гуманистические идеалы и гибко относящиеся к социальным и культурным традициям, могут иметь низкие оценки по этому фактору.</i><br>";
					if($value >= 5.5) $desc .= "Добросовестность, ответственность, стабильность, уравновешенность, настойчивость, склонность к морализированию, разумность, совестливость. Развитое чувство долга и ответственности, осознанное соблюдение общепринятых моральных правил и норм, настойчивость в достижении цели, деловая направленность. Высокие оценки часто могут характеризовать не только выраженные волевые черты личности, но и склонность к сотрудничеству и конформизму. Психоаналитики интерпретируют этот фактор как высокое супер-эго и как низкое супер-эго (в данном случае - высокое супер-эго).";
					
					if($value >= 1 && $value <= 3)  $desc .= "Тенденция к непостоянству цели, непринужденный в поведении, не прилагает усилий к выполнению групповых задач, выполнению социально-культурных требований. Его свобода от влияния группы может вести к асоциальным поступкам, но временами делает его деятельность более эффективной. Отказ от подчинения правилам уменьшает соматические расстройства при стрессе. ";
					if($value == 4) $desc .= "Пользующийся моментом, ищущий выгоду в ситуации. Избегает правил, чувствует себя малообязательным.  ";
					if($value == 7) $desc .= "Сознательный, настойчивый, на него можно положиться, степенный, обязательный. ";
					if($value >= 8 && $value <= 10) $desc .= "Требователен к себе, руководствуется чувством долга, настойчив, берет на себя ответственность, добросовестен, склонен к морализированию, предпочитает работящих людей, остроумный. ";
				break;	
				
				case 'H':
					$title = 'Фактор Н: «робость - смелость»';
					if($value <= 5.5) $desc .= "Робость, застенчивость, эмоциональная сдержанность, осторожность, социальная пассивность, деликатность, внимательность к другим, повышенная чувствительность к угрозе, предпочтение индивидуального стиля деятельности и общения в малой группе (2-3 человека). ";
					if($value >= 5.5) $desc .= "Смелость, предприимчивость, активность; человек имеет эмоциональные интересы, готовность к риску и сотрудничеству с незнакомыми людьми в незнакомых обстоятельствах, способность принимать самостоятельные, неординарные решения, склонность к авантюризму и проявлению лидерских качеств. ";
					
					if($value >= 1 && $value <= 3)  $desc .= "Застенчивый, уклончивый, держится в стороне, «тушуется». Обычно испытывает чувство собственной недостаточности. Речь замедленна, затруднена, высказывается трудно. Избегает профессий, связанных с личными контактами. Предпочитает иметь 1-2 близких друзей, не склонен вникать во все, что происходит вокруг него. Низкие оценки этого фактора характеризуют людей застенчивых, робких, не социабельных, трудно принимающих самостоятельные решения. ";
					if($value == 4) $desc .= "застенчивый, сдержанный, неуверенный, боязливый, робкий. ";
					if($value == 7) $desc .= "авантюрный, социально-смелый, незаторможенный, спонтанный. ";
					if($value >= 8 && $value <= 10) $desc .= "Общительный, смелый, испытывает новые вещи; спонтанный и живой в эмоциональной сфере. Его «толстокожесть» позволяет ему переносить жалобы и слезы, трудности в общении с людьми в эмоционально напряженных ситуациях. Может небрежно относиться к деталям, не реагировать на сигналы об опасности. Люди с высокими оценками этого фактора имеют склонность к профессиям риска (летчики-испытатели), упорны, социабельны, умеют выдерживать эмоциональные нагрузки, что часто делает их лидерами.  ";
				break;	
				
				case 'I':
					$title = 'Фактор I: «жесткость – чувствительность»';
					if($value <= 5.5) $desc .= "Несентиментальность, самоуверенность, суровость, рассудочность, гибкость в суждениях, практичность, иногда некоторая жесткость и черствость по отношению к окружающим, рациональность, логичность. Лица с I- больше склонны к невротическим рассогласованиям. ";
					if($value > 5.5) $desc .= "Чувствительность, впечатлительность, богатство эмоциональных переживаний, склонность к романтизму, художественное восприятие мира, развитые эстетические интересы, артистичность, женственность, склонность к эмпатии, сочувствию, сопереживанию и пониманию других людей, утонченная эмоциональность. ";
					
					if($value >= 1 && $value <= 3)  $desc .= "практичный, реалистичный, мужественный, независимый, имеет чувство ответственности, но скептически относится к субъективным и культурным аспектам жизни. Иногда безжалостный, жестокий, самодовольный. Руководя группой, заставляет ее работать на практической и реалистической основе. Интересен тот факт, что люди с низкими показателями по этому фактору меньше болеют, более агрессивны, чаще занимаются спортом, атлетичны. ";
					if($value == 4) $desc .= "сильный, независимый, полагается на себя, реалистичный, не терпит бессмысленности. ";
					if($value == 7) $desc .= "слабый, зависимый, недостаточно самостоятельный, беспомощный, сензитивный. ";
					if($value >= 8 && $value <= 10) $desc .= "слабый, мечтательный, разборчивый, капризный, женственный, иногда требовательный к вниманию, помощи, зависимый, непрактичный. Не любит грубых людей и грубых профессий. Склонен замедлять деятельность группы и нарушать ее моральное состояние нереалистическим копанием в мелочах, деталях. По роду занятий высокие оценки по этому фактору объединяют художников, артистов, музыкантов, писателей врачей-диагностов и психиатров, адвокатов. Личность с высокими показателями по этому фактору характеризуется как физически и умственно утонченная, склонная к рефлексии, задумывающаяся над своими ошибками и путями избежания таковых. Согласно ряду исследований, люди с высокими показателями по этому фактору обычно настроены романтически, любят путешествия и новые переживания. Они обладают развитым воображением, для них важна эстетика.  ";
				break;	
				
				case 'L':
					$title = 'Фактор L: «доверчивость - подозрительность»';
					if($value <= 5.5) $desc .= "Открытость, уживчивость, терпимость, покладистость; свобода от зависти, уступчивость. Может быть чувство собственной незначительности. ";
					if($value >= 5.5) $desc .= "Осторожность, эгоцентричность, настороженность по отношению к людям; склонность к ревности, стремление возложить ответственность за ошибки на окружа-юих, раздражительность. Иногда автономность, самостоятельность и независимость в социальном поведении. Полюс L- характеризует личность добродушную, открытую и, возможно, без амбиций и стремления к победе.";
					
					if($value >= 1 && $value <= 3)  $desc .= "склонен к свободе от тенденции ревности, приспособляемый, веселый, не стремится к конкуренции, заботится о других. Хорошо работает в группе. В целом фактор L отражает эмоциональное отношение к людям. Низкий полюс (L-) характеризует личность добродушную, но склонную к конформизму. ";
					if($value == 4) $desc .= "доверчивый, адаптирующийся, неревнивый, уживчивый. ";
					if($value == 7) $desc .= "подозрительный, имеющий собственное мнение, не поддается обману. ";
					if($value >= 8 && $value <= 10) $desc .= "недоверчивый, сомневающийся, часто погружен в свое «Я», упрямый, заинтересован во внутренней психической жизни. Осмотрителен в действиях, мало заботится о других людях, плохо работает в группе. Этот фактор не обязательно свидетельствует о паранойе. высокие показатели по этому фактору могут коррелировать с невротическими характеристиками. В то же время высокие оценки по этому фактору часто встречаются у людей независимого поведения, у тех, кто по роду деятельности связан с созиданием чего-либо, например, в области религии и науки.  В целом фактор L отражает эмоциональное отношение к людям. Очень высокие оценки по этому фактору говорят об излишней защите и эмоциональной напряженности, фрустрированности личности.";
				break;					
				
				case 'M':
					$title = 'Фактор М: «практичность - мечтательность»';
					if($value <= 5.5) $desc .= "Высокая скорость решения практических задач, прозаичность, ориентация на внешнюю реальность, развитое конкретное воображение, практичность, реалистичность. ";
					if($value >= 5.5) $desc .= "Богатое воображение, поглощенность своими идеями, внутренними иллюзиями («витает в облаках»), легкость отказа от практических суждений, умение оперировать абстрактными понятиями, ориентированность на свой внутренний мир; мечтательность.  В основном личности с M+ имеют яркую внутреннюю интеллектуальную жизнь, с интенсивным проживанием идей и чувств. В поведении могут быть «богемны», нонконформны.";
					
					if($value >= 1 && $value <= 3)  $desc .= "беспокоится о том, чтобы поступать правильно, практично, руководствуется возможным, заботится о деталях, сохраняет присутствие духа в экстремальных ситуациях, но иногда сохраняет воображение. Низкие оценки имеют лица, занятые механическими расчетами, где необходимо внимание, сосредоточенность. Замечено также, что лица с низкими оценками по этому фактору реже попадают в автомобильные катастрофы. Их характеризует уравновешенность и здравомыслие. Однако, в неожиданных ситуациях им часто не хватает воображения и находчивости. ";
					if($value == 4) $desc .= "практичный, тщательный, конвенциальный. Управляем внешними реальными обстоятельствами. ";
					if($value == 7) $desc .= "человек с развитым воображением, погруженный во внутренние потребности, заботится о практических вопросах. Богемный. ";
					if($value >= 8 && $value <= 10) $desc .= "склонен к неприятному для окружающих поведению (не каждодневному), неконвенциальный, не беспокоится о повседневных вещах, самомотивированный, обладает творческим воображением. Обращает внимание на «основное» и забывает о конкретных людях и реальностях. Изнутри направленные интересы иногда ведут к нереалистическим ситуациям, сопровождающимся экспрессивными взрывами. Индивидуальность ведет к отвержению его в групповой деятельности. Высокие оценки по этому фактору имеют художники, поэты, исследователи, экспериментаторы, руководители высокого ранга, редакторы и т. д.  ";
				break;	
				
				case 'N':
					$title = 'Фактор N: «прямолинейность - дипломатичность»';
					if($value <= 5.5) $desc .= "Откровенность, простота, наивность, прямолинейность, бестактность, естественность, непосредственность, эмоциональность, недисциплинированность, неумение анализировать мотивы партнера, отсутствие проницательности, простота вкусов, довольствие имеющимся. ";
					if($value > 5.5) $desc .= "Изысканность, умение вести себя в обществе, в общении дипломатичность, эмоциональная выдержанность, проницательность, осторожность, хитрость, эстетическая изощренность, иногда ненадежность, умение находить выход из сложных ситуаций, расчетливость. ";
					
					if($value >= 1 && $value <= 3)  $desc .= "склонен к отсутствию утонченности, к сентиментальности и простоте. Иногда грубоват и резок, обычно естественен и спонтанен. Кеттелл охарактеризовал людей с низкикими оценками по фактору N так: «... люди с низким полюсом отличаются экспрессивностью, теплотой и добротой». Существуют данные о том, что люди с низкими оценками по этому фактору вызывают больше доверия и симпатии, особенно у детей. Люди с низкой оценкой по фактору N медлительны, консервативны, препятствуют принятию решения группой. ";
					if($value == 4) $desc .= "прямой, естественный, бесхитростный, сентиментальный. ";
					if($value == 7) $desc .= "хитрый, нерасчетливый, светский, проницательный (утонченный). ";
					if($value >= 8 && $value <= 10) $desc .= "утонченный, опытный, светский, хитрый. Склонен к анализу. Интеллектуальный подход к оценке ситуации, близкий к цинизму. Высокие оценки по этому фактору характеризуют дипломатов в противоположность «естественному и прямолинейному» человеку с наивной эмоциональной искренностью, прямотой и непринужденностью. Кеттелл охарактеризовал людей с высокими оценками по фактору N так: «Они могут быть либо Сократом, либо ловким мальчишкой...»  Людей с высокими оценками можно охарактеризовать как интеллектуальных, независимых, со сложной натурой. В субкультурных исследованиях была выявлена связь высоких показателей по этому фактору со способностью к выживанию и определенной изощренностью. По динамическим характеристикам люди с высокими показателями являются лидерами в аналитической, целенаправленной дискуссии и в формировании функциональных групповых решений (у театральных режиссеров, кинорежиссеров, дипломатов как правило высокие оценки по этому фактору).";
				break;				
				
				case 'O':
					$title = 'Фактор О: «спокойствие - тревожность»';
					if($value <= 5.5) $desc .= "Беспечность, самонадеянность, жизнерадостность, уверенность в себе и в своих силах, безмятежность, небоязливость, хладнокровие, спокойствие, отсутствие раскаяния и чувства вины. ";
					if($value > 5.5) $desc .= "Беспокойство, озабоченность, ранимость, ипохондричность, подверженность настроению, страх, неуверенность в себе, склонность к предчувствиям, самобичеванию, к депрессиям, чувствительность к одобрению окружающих, чувство вины и недовольство собой. ";
					
					if($value >= 1 && $value <= 3)  $desc .= "безмятежный, со спокойным настроением, его трудно вывести из себя, невозмутимый. Уверенный в себе и своих способностях. Гибкий, не чувствует угрозы, иногда до такой степени, что не чувствителен к тому, что группа идет другим путем и что он может вызвать неприязнь. Низкие оценки характерны для людей, которые «управляют своими неудачами». Низкие оценки по этому фактору характеризуют тех людей, которые могут справляться со своими неудачами, в отличие от тех, кто переживает неудачи как внутренний конфликт. Существуют данные, свидетельствующие о том, что антиобщественные личности не страдают от чувства вины.";
					if($value == 4) $desc .= "безмятежный, доверчивый, спокойный. ";
					if($value == 7) $desc .= "тревожный, депрессивный, обеспокоенный (тенденция аутопунитивности), чувство вины. ";
					if($value >= 8 && $value <= 10) $desc .= "депрессивен, плохое настроение преобладает, мрачные предчувствия и размышления, беспокойство. Тенденция к тревожности в трудных ситуациях. Чувство, что его не принимает группа. Высокий балл распространен в клинических группах всех типов. Личность с высокими оценками по этому фактору чувствует свою неустойчивость, напряженность в трудных жизненных ситуациях, легко теряет присутствие духа, полна сожалений и сострадания; для нее характерна комбинация симптомов ипохондрии и неврастении с преобладанием страхов. Этот фактор шире, чем чувство вины в общепринятом смысле. В этом факторе важен и компонент устойчивости; люди с высокими показателями часто застенчивы, им трудно вступить в контакт с другими людьми.  По роду занятий высокую оценку по этому фактору имеют религиозные лица, художники, артисты, литераторы. Высокие оценки во многом определяют успешное лидерство в сложных ситуациях и стремление личности к самоактуализации. В то же время эти оценки свойственны невротикам, алкоголикам и людям с некоторыми видами психопатии. ";
				break;	

				case 'Q1':
					$title = 'Фактор Q1: «консерватизм - радикализм»';
					if($value <= 5.5) $desc .= "Консервативность, устойчивость по отношению к традициям, сомнение в отношении к новых идей и принципов, склонность к морализации и нравоучениям, сопротивление переменам, узость интеллектуальных интересов, ориентация на конкретную реальную деятельность. Есть предположение, что данный фактор имеет генетическое происхождение и в бытовом сознании соотносится с такими характеристиками человека как «умный» (Q1+) и <b>«глупый» (Q1-)</b>.";
					if($value > 5.5) $desc .= "Свободомыслие, экспериментаторство, наличие интеллектуальных интересов, развитое аналитическое мышление, восприимчивость к переменам, к новым идеям, недоверие к авторитетам, отказ принимать что-либо на веру, направленность на аналитическую, теоретическую деятельность. Есть предположение, что данный фактор имеет генетическое происхождение и в бытовом сознании соотносится с такими характеристиками человека как <b>«умный» (Q1+)</b> и «глупый» (Q1-).";
					
					if($value >= 1 && $value <= 3)  $desc .= "убежден в правильности того, чему его учили, и принимает все как проверенное, несмотря на противоречия. Склонен к осторожности и к компромиссам в отношении новых людей. Имеет тенденцию препятствовать и противостоять изменениям и откладывать их, придерживается традиций. Низкие оценки по этому фактору наблюдаются у малоквалифицированных специалистов и обслуживающего персонала (няни, санитарки и т. д ). В поведенческом рисунке человек с низкими оценками по этому фактору характеризуется как «консерватор».";
					if($value == 4) $desc .= "консервативный, уважающий принципы, терпимый к традиционным трудностям. ";
					if($value == 7) $desc .= "экспериментирующий, критический, либеральный, аналитический, свободно мыслящий. ";
					if($value >= 8 && $value <= 10) $desc .= "поглощен интеллектуальными проблемами, имеет сомнения по различным фундаментальным вопросам. Он скептичен и старается вникнуть в сущность идей старых и новых. Он часто лучше информирован, менее склонен к морализированию, более - к эксперименту в жизни, терпим к несообразностям и к изменениям. В исследованиях было получено доказательство того, что личности с высокими показателями по этому фактору лучше информированы, меньше склонны к морализаторству, выражают больший интерес к науке, нежели к догмам. Более того, они готовы к нарушению привычек и устоявшихся традиций, им свойственна независимость суждений, взглядов и поведения. Высокие оценки по этому фактору наблюдаются у руководителей, администраторов, ученых, преподавателей университетов и особенно - у исследователей и теоретиков. деловые лидеры имеют высокие оценки по этому фактору. В поведенческом рисунке человек с высокими оценками по этому фактору характеризуется как «радикал».";
				break;	
				
				case 'Q2':
					$title = 'Фактор Q2: «конформизм - нонконформизм». Следует особо учитывать, что показатели по этому фактору могут характеризовать определенную социабельность личности и имеют постоянную связь с критериями реальной жизни. Кеттелл считает, что этот фактор является «мыслящей интроверсией» и в формировании такой модели поведения существенную роль играют как семейные, так и общественные традиции.';
					if($value <= 5.5) $desc .= "Зависимость от мнения и требований группы, социабельность, следование за общественным мнением, стремление работать и принимать решения вместе с другими людьми, низкая самостоятельность, ориентация на социальное одобрение. ";
					if($value > 5.5) $desc .= "Независимость, ориентация на собственные решения, самостоятельность, находчивость, стремление иметь собственное мнение. При крайних высоких оценках склонность к противопоставлению себя группе и желание в ней доминировать. ";
					
					if($value >= 1 && $value <= 3)  $desc .= "предпочитает работать и принимать решения вместе с другими людьми, любит общение и восхищение, зависит от них. Склонен идти с группой. Необязательно общителен, скорее ему нужна поддержка со стороны группы. Низкие оценки по этому фактору имеют личности общительные, для которых много значит одобрение общества, это светские люди. ";
					if($value == 4) $desc .= "зависящий от группы, «присоединяющийся», ведомый, идущий на зов (групповая зависимость). ";
					if($value == 7) $desc .= "самоудовлетворенный, предлагающий собственное решение, предприимчивый. ";
					if($value >= 8 && $value <= 10) $desc .= "независим, склонен идти собственной дорогой, принимать собственные решения, действовать самостоятельно. Он не считается с общественным мнением, но не обязательно играет доминирующую роль в отношении других (см. фактор Е). Нельзя считать, что люди ему не нравятся, он просто не нуждается в их согласии и поддержке. Высокие оценки имеют люди, которые часто разобщены с группой и по роду занятий являются индивидуалистами -писатели, ученые и преступники!  ";
				break;	
				
				case 'Q3':
					$title = 'Фактор Q3: «низкий самоконтроль - высокий самоконтроль». Этот фактор является одним из наиболее важных для прогноза успешности деятельности. Он положительно связан с частотой выбора в лидеры и степенью активности при решении групповых проблем.';
					if($value <= 5.5) $desc .= "Низкая дисциплинированность, потворство следует своим желаниям, зависимость от настроений, неумение контролировать свои эмоции и поведение. ";
					if($value > 5.5) $desc .= "Целенаправленность, сильная воля, умение контролировать свои эмоции и поведение. ";
					
					if($value >= 1 && $value <= 3)  $desc .= "не руководствуется волевым контролем, не обращает внимания на социальные требования, невнимателен к другим. Может чувствовать себя недостаточно приспособленным. Низкие оценки по этому фактору указывают на слабую волю и плохой самоконтроль. Деятельность таких людей неупорядочена и импульсивна. ";
					if($value == 4) $desc .= "внутренне недисциплинированный, конфликтный (низкая интеграция). ";
					if($value == 7) $desc .= "контролируемый, социально точный, следующий «Я»-образу (высокая интеграция). ";
					if($value >= 8 && $value <= 10) $desc .= "имеет тенденцию к сильному контролю своих эмоций и общего поведения. Социально внимателен и тщателен; проявляет то, что обычно называют «самоуважением», и заботу о социальной репутации. Иногда, однако, склонен к упрямству. Личность с высокими оценками по этому фактору имеет социально одобряемые характеристики: самоконтроль, настойчивость, сознательность, склонность к соблюдению этикета. Для того, чтобы соответствовать таким стандартам, от личности требуется приложение определенных усилий, наличие четких принципов, убеждений и учет общественного мнения. Люди с высокими оценками по этому фактору склонны к организаторской деятельности и добиваются успеха в тех профессиях, где требуются объективность, решительность, уравновешенность.";
				break;	
				
				case 'Q4':
					$title = 'Фактор Q4: «расслабленность - напряженность»';
					if($value <= 5.5) $desc .= "Расслабленность, вялость, апатичность, спокойствие, низкая мотивация, излишняя удовлетворенность, невозмутимость. ";
					if($value > 5.5) $desc .= "Собранность, энергичность, напряженность, фрустрированность, повышенная мотивация, беспокойство, взвинченность, раздражительность. ";
				
					if($value >= 0 && $value <= 5)  $desc .= "Исследования показали, что низкая оценка (0-5 баллов) характерна для людей с невысоким уровнем мотивации достижения, довольствующихся имеющимся.  ";
					if($value >=5 && $value <= 8) $desc .= "Лица со значениями этого фактора от 5 до 8 баллов характеризуются оптимальным эмоциональным тонусом и стрессоустойчивостью. ";
					if($value >= 9 && $value <= 12) $desc .= "Высокая оценка (9-12 баллов) интерпретируется как энергетическая возбужденность, которая требует определенной разрядки; иногда это состояние может превратиться в психосоматическое нарушение: снижается эмоциональная устойчивость, нарушается равновесие, может проявляться агрессивность. Такие люди редко становятся лидерами. ";
					if($value >= 1 && $value <= 3)  $desc .= "склонен к расслабленности, уравновешенности, удовлетворенности. В некоторых ситуациях его сверхудовлетворенность может вести к лени, к достижению низких результатов. Напротив, высокий уровень напряжения может нарушить эффективность учебы или работы. ";
					if($value == 4)  $desc .= "расслабленный (ненапряженный), нефрустрированный. ";
					if($value == 7)  $desc .= "напряженный, фрустрированный, побуждаемый, сверхреактивный (высокое энергетическое напряжение). ";
					if($value >= 8 && $value <= 10) $desc .= "склонен к напряженности, возбудимости. ";
				break;					
				
				
				
				default:
					continue;
			}
			if($title != '') {
				$RESULT['TEXT'].= "<b>".$title."</b> (".$value.")<br>".$desc."<br><br>\n";
			}
		}
		$RESULT['RESULT_CHART'] = $S['RESULT_CHART'];
		
	}
	
	return $RESULT;
	

	
	
	
	
	
	$S['RESULT_SHORT'] .= '<p><strong>Фактор A: «замкнутость – общительность»</strong> — '.$S['A'].' стен.<br> Для низкого значения характерно: скрытность, обособленность, отчужденность, недоверчивость, необщительность, замкнутость, критичность, склонность к объективности, ригидности, к излишней строгости в оценке людей. Трудности в установлении межличностных, непосредственных контактов. <br>Для высокого значения характерно: общительность, открытость, естественность, непринужденность, готовность к сотрудничеству, приспособляемость, внимание к людям, готовность к совместной работе, активность в устранении конфликтов в группе, готовность идти на поводу. Легкость в установлении непосредственных, межличностных контактов.</p>';
	$S['RESULT_SHORT'] .= '<p><strong>Фактор B: интеллект</strong> — '.$S['B'].' стен.<br> Для низкого значения характерно: конкретность и некоторая ригидность мышления, затруднения в решении абстрактных задач, сниженная оперативность мышления, недостаточный уровень общей вербальной культуры.<br>Для высокого значения характерно: развитое абстрактное мышление, оперативность, сообразительность, быстрая обучаемость. Достаточно высокий уровень общей культуры, особенно вербальной.<br>Фактор В не определяет уровень интеллекта, он ориентирован на измерение оперативности мышления и общего уровня вербальной культуры и эрудиции. Следует отметить, что низкие оценки по этому фактору могут зависеть от других характеристик личности: тревожности, фрустрированности, низкого образовательного ценза. И главное, фактор В, пожалуй, единственный фактор методики, который не является строго валидизированным. Поэтому результаты по этому фактору являются ориентировочными.</p>';
	$S['RESULT_SHORT'] .= '<p><strong>Фактор C: «эмоциональная нестабильность – стабильность»</strong> — '.$S['C'].' стен.<br> Для низкого значения характерно: эмоциональная неустойчивость, импульсивность; человек находится под влиянием чувств, переменчив в настроениях, легко расстраивается, неустойчив в интересах. Низкая толерантность по отношению к фрустрации, раздражительность, утомляемость.<br>Для высокого значения характерно: эмоциональная устойчивость, выдержанность; человек эмоционально зрелый, спокойный, устойчив в интересах, работоспособный, может быть ригидным, ориентирован на реальность.</p>';
	$S['RESULT_SHORT'] .= '<p><strong>Фактор E: «подчиненность – доминантность»</strong> — '.$S['E'].' стен.<br> Для низкого значения характерно: мягкость, уступчивость, тактичность, кроткость, любезность, зависимость, безропотность, услужливость, почтительность, застенчивость, готовность брать вину на себя, скромность, экспрессивность, склонность легко выходить из равновесия.<br>Для высокого значения характерно: самостоятельность, независимость, настойчивость, упрямство, напористость, своенравие, иногда конфликтность, агрессивность, отказ от признания внешней власти, склонность к авторитарному поведению, жажда восхищения, бунтарь.</p>';
	$S['RESULT_SHORT'] .= '<p><strong>Фактор F: «сдержанность – экспрессивность»</strong> — '.$S['F'].' стен.<br> Для низкого значения характерно: благоразумие, осторожность, рассудительность в выборе партнера по общению. Склонность к озабоченности, беспокойству о будущем, пессимистичность в восприятии действительности, сдержанность в проявлении эмоций.<br>Для высокого значения характерно: жизнерадостность, импульсивность, восторженность, беспечность, безрассудность в выборе партнеров по общению, эмоциональная значимость социальных контактов, экспрессивность, экспансивность, эмоциональная яркость в отношениях между людьми, динамичность общения, которая предполагает эмоциональное лидерство в группах.</p>';
	
	$S['RESULT_FULL'] = $S['RESULT_SHORT'];
	$S['RESULT_FULL'] .= '<p><strong>Фактор G: «низкая нормативность поведения – высокая нормативность поведения»</strong> — '.$S['G'].' стен.<br> Для низкого значения характерно: склонность к непостоянству, подверженность влиянию чувств, случая и обстоятельств. Потворствует своим желаниям, не делает усилий по выполнению групповых требований и норм. Неорганизованность, безответственность, импульсивность, отсутствие согласия с общепринятыми моральными правилами и стандартами, гибкость по отношению к социальным нормам, свобода от их влияния, иногда беспринципность и склонность к асоциальному поведению.<br>Для высокого значения характерно: добросовестность, ответственность, стабильность, уравновешенность, настойчивость, склонность к морализированию, разумность, совестливость. Развитое чувство долга и ответственности, осознанное соблюдение общепринятых моральных правил и норм, настойчивость в достижении цели, деловая направленность.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор H: «робость – смелость»</strong> — '.$S['H'].' стен.<br> Для низкого значения характерно: робость, застенчивость, эмоциональная сдержанность, осторожность, социальная пассивность, деликатность, внимательность к другим, повышенная чувствительность к угрозе, предпочтение индивидуального стиля деятельности и общения в малой группе (2–3 человека).<br>Для высокого значения характерно: смелость, предприимчивость, активность; человек имеет эмоциональные интересы, готовность к риску и сотрудничеству с незнакомыми людьми в незнакомых обстоятельствах, способность принимать самостоятельные, неординарные решения, склонность к авантюризму и проявлению лидерских качеств.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор I: «жесткость – чувствительность»</strong> — '.$S['I'].' стен.<br> Для низкого значения характерно: несентиментальность, самоуверенность, суровость, рассудочность, гибкость в суждениях, практичность, иногда некоторая жесткость и черствость по отношению к окружающим, рациональность, логичность.<br>Для высокого значения характерно: чувствительность, впечатлительность, богатство эмоциональных переживаний, склонность к романтизму, художественное восприятие мира, развитые эстетические интересы, артистичность, женственность, склонность к эмпатии, сочувствию, сопереживанию и пониманию других людей, утонченная эмоциональность.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор L: «доверчивость – подозрительность»</strong> — '.$S['L'].' стен.<br> Для низкого значения характерно: открытость, уживчивость, терпимость, покладистость; свобода от зависти, уступчивость. Может быть чувство собственной незначительности.<br>Для высокого значения характерно: осторожность, эгоцентричность, настороженность по отношению к людям; склонность к ревности, стремление возложить ответственность за ошибки на окружающих, раздражительность. Иногда автономность, самостоятельность и независимость в социальном поведении.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор M: «практичность – мечтательность»</strong> — '.$S['M'].' стен.<br> Для низкого значения характерно: высокая скорость решения практических задач, прозаичность, ориентация на внешнюю реальность, развитое конкретное воображение, практичность, реалистичность.<br>Для высокого значения характерно: богатое воображение, поглощенность своими идеями, внутренними иллюзиями («витает в облаках»), легкость отказа от практических суждений, умение оперировать абстрактными понятиями, ориентированность на свой внутренний мир; мечтательность.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор N: «прямолинейность – дипломатичность»</strong> — '.$S['N'].' стен.<br> Для низкого значения характерно: откровенность, простота, наивность, прямолинейность, бестактность, естественность, непосредственность, эмоциональность, недисциплинированность, неумение анализировать мотивы партнера, отсутствие проницательности, простота вкусов, довольствие имеющимся.<br>Для высокого значения характерно: изысканность, умение вести себя в обществе, в общении дипломатичность, эмоциональная выдержанность, проницательность, осторожность, хитрость, эстетическая изощренность, иногда ненадежность, умение находить выход из сложных ситуаций, расчетливость.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор O: «спокойствие – тревожность»</strong> — '.$S['O'].' стен.<br> Для низкого значения характерно: беспечность, самонадеянность, жизнерадостность, уверенность в себе и в своих силах, безмятежность, небоязливость, хладнокровие, спокойствие, отсутствие раскаяния и чувства вины.<br> Для высокого значения характерно: беспокойство, озабоченность, ранимость, ипохондричность, подверженность настроению, страх, неуверенность в себе, склонность к предчувствиям, самобичеванию, к депрессиям, чувствительность к одобрению окружающих, чувство вины и недовольство собой.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор Q1: «консерватизм – радикализм»</strong> — '.$S['Q1'].' стен.<br> Для низкого значения характерно: консервативность, устойчивость по отношению к традициям, сомнение в отношении к новых идей и принципов, склонность к морализации и нравоучениям, сопротивление переменам, узость интеллектуальных интересов, ориентация на конкретную реальную деятельность.<br>Для высокого значения характерно: свободомыслие, экспериментаторство, наличие интеллектуальных интересов, развитое аналитическое мышление, восприимчивость к переменам, к новым идеям, недоверие к авторитетам, отказ принимать что-либо на веру, направленность на аналитическую, теоретическую деятельность.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор Q2: «конформизм – нонконформизм»</strong> — '.$S['Q2'].' стен.<br> Для низкого значения характерно: зависимость от мнения и требований группы, социабельность, следование за общественным мнением, стремление работать и принимать решения вместе с другими людьми, низкая самостоятельность, ориентация на социальное одобрение.<br>Для высокого значения характерно: независимость, ориентация на собственные решения, самостоятельность, находчивость, стремление иметь собственное мнение. При крайних высоких оценках склонность к противопоставлению себя группе и желание в ней доминировать.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор Q3: «низкий самоконтроль – высокий самоконтроль»</strong> — '.$S['Q3'].' стен.<br> Для низкого значения характерно: низкая дисциплинированность, следует своим желаниям, зависимость от настроений, неумение контролировать свои эмоции и поведение.<br>Для высокого значения характерно: целенаправленность, сильная воля, умение контролировать свои эмоции и поведение.<br>Низкие оценки по этому фактору указывают на слабую волю и плохой самоконтроль. Деятельность таких людей неупорядочена и импульсивна. Личность с высокими оценками по этому фактору имеет социально одобряемые характеристики: самоконтроль, настойчивость, сознательность, склонность к соблюдению этикета. Для того, чтобы соответствовать таким стандартам, от личности требуется приложение определенных усилий, наличие четких принципов, убеждений и учет общественного мнения.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор Q4: «расслабленность – напряженность»</strong> — '.$S['Q4'].' стен.<br> Для низкого значения характерно: расслабленность, вялость, апатичность, спокойствие, низкая мотивация, излишняя удовлетворенность, невозмутимость.<br>Для высокого значения характерно: собранность, энергичность, напряженность, фрустрированность, повышенная мотивация, беспокойство, взвинченность, раздражительность.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор F1: «низкая тревожность – высокая тревожность»</strong> — '.$S['F1'].' стен.<br> Для низкого значения характерно: в общем этот человек удовлетворен тем, что есть, и может добиться того, что ему кажется важным. Однако очень низкие баллы могут означать недостаток мотивации в трудных ситуациях.<br>Для высокого значения характерно: высокий уровень тревоги в ее обычном понимании. Тревога не обязательно невротическая, поскольку она может быть обусловлена ситуационно. Однако в чем-то имеет неприспособленность, т. к. человек недоволен в степени, которая не позволяет ему выполнять требования и достигать того, что желает. Очень высокая тревога обычно нарушает продуктивность и приводит к соматическим расстройствам.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор F2: «интроверсия – экстраверсия»</strong> — '.$S['F2'].' стен.<br> Для низкого значения характерно: склонность к сухости, к самоудовлетворению, замороженности межличностных контактов. Это может быть благоприятно в работе, требующей точности.<br>Для высокого значения характерно: социально контактен, незаторможен, успешно устанавливает и поддерживает межличностные связи. Это может быть очень благоприятным моментом в ситуациях, требующих темперамента такого типа. Эту черту следует считать всегда благоприятным прогнозом в деятельности, например в учебе.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор F3: «чувствительность – уравновешенность»</strong> — '.$S['F3'].' стен.<br> Для низкого значения характерно: тенденция испытывать затруднения в связи с проявляющейся во всем эмоциональностью. Эти люди могут относиться к типу недовольных и фрустрированных. Однако присутствует чувствительность к нюансам жизни. Вероятно, имеются артистические наклонности и мягкость. Если у такого человека возникает проблема, то на ее разрешение требуется много размышлений до начала действий.<br>Для высокого значения характерно: предприимчивая, решительная и гибкая личность. Этот человек склонен не замечать жизненных нюансов, направляя свое поведение на слишком явное и очевидное. Если возникают трудности, то они вызывают быстрое действие без достаточного размышления.</p>';
	$S['RESULT_FULL'] .= '<p><strong>Фактор F4: «конформность – независимость»</strong> — '.$S['F4'].' стен.<br> Для низкого значения характерно: зависимая от группы, пассивная личность, нуждающаяся в поддержке других лиц и ориентирующая свое поведение в направлении людей, которые такую поддержку оказывают. Для высокого значения характерно: агрессивная, независимая, отважная, резкая личность. Старается выбрать такие ситуации, где подобное поведение, по крайней мере, терпят. Проявляет значительную инициативу.</p>';
	$S['RESULT_FULL'] .= '<p>В дополнение к первичным личностным факторам опросника обычно подсчитываются два показателя, отражающие отношение к тестированию (шкалы валидности):<br>1) стремление выглядеть в благоприятном свете – шкала MD,<br>2) стремление выглядеть хуже, чем на самом деле – шкала FB. (только для форм A/B)</p>';
	
	
	//1-3 низкие 4-7 средние 8-10 высокие 
	//A- 1-5 A+ 6-10
	$S['RESULT_EXTENDED'] = '';
	$S['RESULT_EXTENDED'] .= '<b>Фактор A: «замкнутость – общительность»: </b>'.$S['A'];
	if($S['A'] >= 8) $S['RESULT_EXTENDED'] .= '<br>Склонность к добродушию, легкости в общении, эмоциональному выражению; готов к сотрудничеству, внимателен к людям, мягкосердечен, добр, приспособляем. Предпочитает ту деятельность, где есть занятия с людьми, ситуации с социальным значением. Этот человек легко включается в активные группы. Он щедр в личных отношениях, не боится критики. Хорошо запоминает события, фамилии, имена и отчества.';
	if($S['A'] <= 3) $S['RESULT_EXTENDED'] .= '<br>Для низкого значения характерно: скрытность, обособленность, отчужденность, недоверчивость, необщительность, замкнутость, критичность, склонность к объективности, ригидности, к излишней строгости в оценке людей. Трудности в установлении межличностных, непосредственных контактов.';
	if($S['A'] >= 8) $S['RESULT_EXTENDED'] .= '<br>Для высокого значения характерно: общительность, открытость, естественность, непринужденность, готовность к сотрудничеству, приспособляемость, внимание к людям, готовность к совместной работе, активность в устранении конфликтов в группе, готовность идти на поводу. Легкость в установлении непосредственных, межличностных контактов.';
	if($S['A'] <= 5) $S['RESULT_EXTENDED'] .= '<br>Полюс А– в техническом названии именуется sizothymia (от греческого корня, σχίζω – раскалываю). Полюс А+ именуется affectothymia, и он характеризует интенсивное выражение аффектов (чувств). Эмоционально «вялая», «сухая» личность имеет склонность к осторожности при выражении чувств, она мало экспрессивна. Наиболее яркой особенностью аффектотимии является добродушие, веселость, интерес к людям, эмоциональная восприимчивость.';
	if($S['A'] >= 6) $S['RESULT_EXTENDED'] .= '<br>Предпочитает работу с людьми, социальное одобрение, любит идти в ногу со временем. Личности с А+ общительны, могут быть лидерами в малых группах и часто выбирают работу с людьми.';
	if($S['A'] <= 5) $S['RESULT_EXTENDED'] .= '<br>Личность любит идеи, предпочитает работать одна. Личности с полюсом А– могут быть художниками, учеными-исследователями и предпочитают работать самостоятельно, изолированно от группы.';
	
	
	
	
	return $S;
};

