<?
require($_SERVER["DOCUMENT_ROOT"]."/bitrix/header.php");
$APPLICATION->SetTitle("TEST3");
?>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>

<?

$str='
АБСТИНЕНЦИЯ — добровольный волевой отказ от чего-либо, подавление в себе каких-либо влечений в течение определённого промежутка времени или на протяжении всей жизни.

АБУЛИЯ — полное отсутствие инициативы, полная бездеятельность с минимальной сохранностью круга автоматизированных действий.

АВТОРИТАРНЫЙ (властный, директивный) — характеристика человека как личности или его поведения в отношении других людей, подчеркивающая склонность пользоваться преимущественно недемократическими методами воздействия на них: давление, приказы, распоряжения и т.п.

АВТОРИТЕТНОСТЬ — способность человека иметь определенный вес среди людей, служить для них источником идей и пользоваться их признанием и уважением.

АГРЕССИВНОСТЬ (враждебность) — поведение человека в отношении других людей, которое отличается стремлением причинить им неприятности, нанести вред.

АДАПТАЦИЯ — приспособление органов чувств к особенностям действующих на них стимулов с целью их наилучшего восприятия и предохранения рецепторов от излишней перегрузки.

АДДИКЦИЯ — зависимость, пагубная привычка; ощущаемая человеком навязчивая потребность в определённой деятельности.

АКТИВНОСТЬ — понятие, указывающее на способность живых существ производить спонтанные движения и изменяться под воздействием внешних или внутренних стимулов-раздражителей.

АКЦЕНТУАЦИЯ — выделение какого-либо свойства или признака на фоне других, его особенное развитие.

АЛЬТРУИЗМ — черта характера, побуждающая человека бескорыстно приходить на помощь людям и животным.

АПАТИЯ — состояние эмоционального равнодушия, безразличия и бездеятельности:

АППЕРЦЕПЦИЯ — понятие, введенное немецким ученым Г.Лейбницем. Определяет состояние особенной ясности сознания, его сосредоточенности на чем-либо. В понимании другого немецкого ученого, В.Вундта, обозначало некоторую внутреннюю силу, направляющую течение мысли и ход психических процессов.

АПРОЗЕКСИЯ — полная потеря способности направлять и фиксировать внимание.

АССОЦИАЦИЯ — соединение, связь психических явлений друг с другом.

АТРИБУЦИЯ — приписывание какого-либо непосредственно не воспринимаемого свойства предмету, человеку или явлению.

АТРИБУЦИЯ КАУЗАЛЬНАЯ — приписывание некоторой объяснительной причины наблюдаемому действию или поступку человека.

АТТРАКЦИЯ — привлекательность, влечение одного человека к другому, сопровождающееся положительными эмоциями.

АУТОСУГГЕСТИЯ — см. Самовнушение.

АФФЕКТ — кратковременное, бурно протекающее состояние сильного эмоционального возбуждения, возникающее в результате фрустрации или какой-либо иной, сильно действующей на психику причины, обычно связанной с неудовлетворением очень важных для человека потребностей.

АФФИЛИАЦИЯ — потребность человека в установлении, сохранении и упрочении эмоционально положительных: дружеских, товарищеских, приятельских отношений с окружающими людьми.

АФФИРМАЦИЯ — краткая фраза, содержащая вербальную формулу, которая при многократном повторении закрепляет требуемый образ или установку в подсознании человека, способствуя улучшению его психоэмоционального фона и стимулируя положительные перемены в жизни.


БАРЬЕР ПСИХОЛОГИЧЕСКИЙ — внутреннее препятствие психологической природы (нежелание, боязнь, неуверенность и т.п.), мешающее человеку успешно выполнить некоторое действие. Часто возникает в деловых и личных взаимоотношениях людей и препятствует установлению между ними открытых и доверительных отношений.

БЕССОЗНАТЕЛЬНОЕ — характеристика психологических свойств, процессов и состояний человека, находящихся вне сферы его сознания, но оказывающих такое же влияние на его поведение, как и сознание.

БОЛЬШАЯ ГРУППА — значительное по количественному составу социальное объединение людей, образованное на основании какого-либо абстрагированного социально-демографического признака: пола, возраста, национальности, профессиональной принадлежности, социального или экономического положения и т.п.

БРЕД — ненормальное, болезненное состояние психики человека, сопровождающееся фантастическими образами, видениями, галлюцинациями.


ВАЛИДНОСТЬ — качество метода психологического исследования, выражающееся в его соответствии тому, для изучения и оценки чего он изначально был предназначен.

ВЕРА — убежденность человека в чем-либо, не подкрепляемая убедительными логическими аргументами или фактами.

ВЕРБАЛЬНЫЙ — относящийся к звуковой человеческой речи.

ВНИМАНИЕ — состояние психологической концентрации, сосредоточенности на каком-либо объекте.

ВНУТРЕННЯЯ РЕЧЬ — особенный вид человеческой речевой деятельности, непосредственно связанный с бессознательными, автоматически протекающими процессами перевода мысли в слово и обратно.

ВНУШЕНИЕ — неосознанное влияние одного человека на другого, вызывающее определенные изменения в его психологии и поведении.

ВОЗБУДИМОСТЬ — свойство живой материи приходить в состояние возбуждения под влиянием раздражителей и сохранять его следы в течение некоторого времени.

ВОЛЯ — свойство (процесс, состояние) человека, проявляющееся в его способности сознательно управлять своей психикой и поступками. Проявляется в преодолении препятствий, возникающих на пути достижения сознательно поставленной цели.

ВООБРАЖЕНИЕ — способность представлять отсутствующий или реально не существующий объект, удерживать его в сознании и мысленно манипулировать им.

ВОСПРИЯТИЕ — процесс приема и переработки человеком различной информации, поступающей в мозг через органы чувств. Завершается формированием образа.

ВЫТЕСНЕНИЕ — один из защитных механизмов в психоаналитической теории личности (см. психоанализ). Под действием В. из памяти человека выводятся из сознания в сферу бессознательного сведения, вызывающие у него сильные неприятные эмоциональные переживания.


ГАЛЛЮЦИНАЦИИ — нереальные, фантастические образы, возникающие у человека во время болезней, влияющих на состояние его психики.

ГЕНИАЛЬНОСТЬ — высший уровень развития у человека каких-либо способностей, делающий его выдающейся личностью в соответствующей области или сфере деятельности.

ГЕНОТИП — совокупность генов или каких-либо качеств, полученных человеком в наследство от своих родителей.

ГИПЕРБУЛИЯ — патологическое увеличение волевой активности, повышенное стремление к деятельности.

ГИПНОЗ — вызванное внушающим воздействием временное отключение сознания человека или снятие сознательного контроля над собственным поведением.

ГИПОБУЛИЯ — патологическое ослабление волевой деятельности, стремления к деятельности.

ГРЕЗЫ — фантазии, мечты человека, рисующие в его воображении приятные, желаемые картины будущей жизни.

ГРУППА — совокупность людей, выделенная на основе какого-либо одного или нескольких, общих для них признаков.

ГРУППОВАЯ ДИНАМИКА — направление исследований в социальной психологии, в котором изучается процесс возникновения, функционирования и развития разных групп.


ДЕПЕРСОНАЛИЗАЦИЯ (обезличивание) — временная утрата человеком психологических и поведенческих особенностей, характеризующих его как личность.

ДЕПРЕССИЯ — состояние душевного расстройства, подавленности, характеризующееся упадком сил и снижением активности.

ДЕТЕРМИНАЦИЯ — причинное обусловливание .

ДЕЯТЕЛЬНОСТЬ — специфический вид человеческой активности, направленной на творческое преобразование, совершенствование действительности и самого себя.

ДИСТРЕСС — отрицательное влияние стрессовой ситуации на деятельность человека, вплоть до ее полного разрушения.

ДОМИНАНТА — преобладающий очаг возбуждения в головном мозге человека, связанный с повышенным вниманием или актуальной потребностью. Способен усиливаться за счет притяжения возбуждений с соседних участков мозга. Понятие Д. введено А.Ухтомским.

ДУША — старое, использовавшееся в науке до появления слова «психология» название совокупности явлений, исследуемых в современной психологии.


ЖЕЛАНИЕ — состояние актуализированной, т.е. начавшей действовать, потребности, сопровождаемое стремлением и готовностью сделать что-либо конкретное для ее удовлетворения.

ЖЕСТ — движение рук человека, выражающее его внутреннее состояние или указывающее на какой-либо объект во внешнем мире.

ЖИЗНЕДЕЯТЕЛЬНОСТЬ — совокупность видов активности, объединяемых понятием «жизнь» и свойственных живой материи.


ЗАБЫВАНИЕ — процесс памяти, связанный с утратой следов прежних воздействий и возможности их воспроизведения.

ЗАДАТКИ — предпосылки к развитию способностей. Могут быть врожденными и приобретенными при жизни.

ЗАМЕЩЕНИЕ (сублимация) — один из защитных механизмов, представляющих собой подсознательную замену одной, запретной или практически не достижимой, цели на другую, разрешенную и более доступную, способную хотя бы частично удовлетворить актуальную потребность.

ЗАРАЖЕНИЕ — психологический термин, обозначающий бессознательную передачу от человека к человеку каких-либо эмоций, состояний, побуждений.

ЗАЩИТНЫЕ МЕХАНИЗМЫ — психоаналитическое понятие, обозначающее совокупность бессознательных приемов, с помощью которых человек, как личность, оберегает себя от психологических травм.

ЗАПОМИНАНИЕ — один из процессов памяти, обозначающий введение в память вновь поступающей информации.

ЗНАК — символ или объект, служащий заменителем другого объекта.

ЗНАЧЕНИЕ (слова, понятия) — то содержание, которое вкладывают в данное слово или понятие все употребляющие его люди.

ЗОНА ПОТЕНЦИАЛЬНОГО (БЛИЖАЙШЕГО) РАЗВИТИЯ — возможности в психическом развитии, которые открываются у человека при оказании ему минимальной помощи со стороны. Понятие З.п.р. введено Л.С.Выготским.


ИДЕНТИФИКАЦИЯ — отождествление. В психологии — установление сходства одного человека с другим, направленное на его вспоминание и собственное развитие идентифицирующегося с ним лица.

ИЛЛЮЗИИ — феномены восприятия, воображения и памяти, существующие только в голове человека и не соответствующие какому-либо реальному явлению или объекту.

ИМПУЛЬСИВНОСТЬ — характерологическая черта человека, проявляющаяся в его склонности к быстротечным, непродуманным действиям и поступкам.

ИНДИВИД — отдельно взятый человек в совокупности всех присущих ему качеств: биологических, физических, социальных, психологических и др.

ИНДИВИДУАЛЬНОСТЬ — своеобразное сочетание индивидных свойств человека, отличающее его от других людей.

ИНДИВИДУАЛЬНЫЙ СТИЛЬ ДЕЯТЕЛЬНОСТИ — устойчивое сочетание особенностей выполнения разных видов деятельности одним и тем же человеком.

ИНИЦИАТИВА — проявление человеком активности, не стимулированной извне и не определяемой не зависящими от него обстоятельствами.

ИНСАЙТ (озарение, догадка) — неожиданное для самого человека, внезапное нахождение решения какой-либо проблемы, над которой он долго и настойчиво думал.

ИНСТИНКТ — врожденная, малоизменяемая форма поведения, обеспечивающая приспособление организма к типичным условиям его жизни.

ИНТЕЛЛИГЕНТ — человек глубокой внутренней культуры и самостоятельного мышления.

ИНТЕЛЛЕКТ — совокупность умственных способностей человека и некоторых высших животных, например, человекообразных обезьян.

ИНТЕРАКЦИЯ — взаимодействие.

ИНТЕРЕС — эмоционально окрашенное, повышенное внимание человека к какому-либо объекту или явлению.

ИНТРОВЕРСИЯ — обращенность сознания человека к самому себе; поглощенность собственными проблемами и переживаниями, сопровождаемая ослаблением внимания к тому, что происходит вокруг. И. является одной из базовых черт личности.

ИНТРОСПЕКЦИЯ — метод познания психических явлений путем самонаблюдения человека, т.е. внимательного изучения самим человеком того, что происходит в его сознании при решении разного рода задач.

ИНТУИЦИЯ — способность быстро находить верное решение задачи и ориентироваться в сложных жизненных ситуациях, а также предвидеть ход событий.

ИНФАНТИЛИЗМ — проявление детских черт в психологии и поведении взрослого человека.

ИСПЫТУЕМЫЙ — человек, над которым проводятся научные психологические опыты.


КЛИМАТ СОЦИАЛЬНО-ПСИХОЛОГИЧЕСКИЙ — общая социально-психологическая характеристика состояния малой группы, в особенности человеческих взаимоотношений, сложившихся в ней.

КОГНИТИВНАЯ БЕСПОМОЩНОСТЬ — психологическое состояние или ситуация, при которой индивид, имея необходимые знания, умения и навыки для решения задачи, в силу ряда причин когнитивного характера не может справиться с ней.

КОЛЛЕКТИВ — высокоразвитая малая группа людей, отношения в которой строятся на позитивных нормах морали. К. обладает повышенной эффективностью в работе, проявляющейся в форме сверхаддитивного эффекта.

КОММУНИКАЦИИ — контакты, общение, обмен информацией и взаимодействие людей друг с другом.

КОМПЕНСАЦИЯ — способность человека избавляться от переживаний по поводу собственных недостатков за счет усиленной работы над собой и развития других положительных качеств. Понятие К. введено А.Адлером.

КОМПЛЕКС НЕПОЛНОЦЕННОСТИ — сложное состояние человека, связанное с недостатком каких-либо качеств (способностей, знаний, умений и навыков), сопровождаемое глубокими отрицательными эмоциональными переживаниями по этому поводу.

КОМПЛЕКС ОЖИВЛЕНИЯ — сложная сенсорно-двигательная реакция младенца (около 2—3 месяцев), возникающая при восприятии близкого человека, в первую очередь своей матери.

КОНВЕРГЕНЦИЯ — сведение зрительных осей глаз на каком-либо объекте или в одну точку зрительного пространства.

КОНСТАНТНОСТЬ ВОСПРИЯТИЯ — свойство воспринимать объекты и видеть их относительно постоянными по величине, форме и цвету в изменяющихся физических условиях восприятия.

КОНФЛИКТ ВНУТРИЛИЧНОСТНЫЙ — состояние неудовлетворенности человека какими-либо обстоятельствами его жизни, связанное с наличием у него противоречащих друг другу интересов, стремлений, потребностей, порождающих аффекты и стрессы.

КОНФЛИКТ МЕЖЛИЧНОСТНЫЙ — трудноразрешимое противоречие, возникающее между людьми и вызванное несовместимостью их взглядов, интересов, целей, потребностей.

КОНФОРМНОСТЬ — некритическое принятие человеком чужого неправильного мнения, сопровождаемое неискренним отказом от собственного мнения, в правильности которого человек внутренне не сомневается. Такой отказ при конформном поведении обычно мотивирован какими-либо конъюнктурными соображениями.

КОРРЕЛЯЦИЯ — математическое понятие, указывающее на статистическую связь, существующую между изучаемыми явлениями.

КОЭФФИЦИЕНТ ИНТЕЛЛЕКТУАЛЬНОГО РАЗВИТИЯ — числовой показатель умственного развития человека, получаемый в результате применения специальных тестов, предназначенных для количественной оценки уровня развития интеллекта человека.

КРИЗИС — состояние душевного расстройства, вызванное длительной неудовлетворенностью человека собой и своими взаимоотношениями с окружающим миром. К. возрастной нередко возникает при переходе человека из одной возрастной группы в другую.


ЛАБИЛЬНОСТЬ — свойство нервных процессов (нервной системы), проявляющееся в способности проводить определенное количество нервных импульсов за единицу времени. Л. также характеризует скорость возникновения и прекращения нервного процесса.

ЛИДЕР — член группы, чей авторитет, власть или полномочия безоговорочно признаются остальными членами малой группы, готовыми следовать за ним.

ЛИДЕРСТВО — поведение лидера в малой группе. Приобретение или утрата им лидерских полномочий, осуществление им своих лидерских функций.

ЛИЧНОСТЬ — понятие, обозначающее совокупность устойчивых психологических качеств человека, составляющих его индивидуальность.

ЛОКУС КОНТРОЛЯ — понятие, характеризующее локализацию причин, исходя из которых человек объясняет свое собственное поведение и наблюдаемое им поведение других людей. Внутренний Л.к. — это поиск причин поведения в самом человеке, а внешний Л.к. — их локализация вне человека, в окружающей его среде. Понятие Л.к. введено американским психологом Ю.Роттером.

ЛОНГИТЮДНОЕ ИССЛЕДОВАНИЕ — длительное по времени своего проведения научное исследование процессов формирования, развития и изменения каких-либо психических или поведенческих явлений.

ЛЮБОВЬ — высшее духовное чувство человека, богатое разнообразными эмоциональными переживаниями, основанное на благородных чувствах и высокой морали и сопровождаемое готовностью сделать все от себя зависящее для благополучия любимого человека.


МАЗОХИЗМ — самоунижение, самоистязание человека, связанное с неудовлетворенностью собой и убежденностью, что причины жизненных неудач находятся в нем самом (см. внутренний локус контроля). М. — одно из главных понятий, используемых в типологии социальных характеров, предложенной немецко-американским ученым Э.Фроммом.

МАЛАЯ ГРУППА — небольшая по численности совокупность людей, включающая от 2—3 до 20—30 человек, занятых общим дел и имеющих прямые личные контакты друг с другом.

МАССОВИДНЫЕ ЯВЛЕНИЯ ПСИХИКИ — социально-психологические явления, возникающие в массах людей (население, толпа, масса, группа, нация и т.п.). М.я.п. включают слухи, панику, подражание, заражение, внушение и др.

МАССОВЫЕ КОММУНИКАЦИИ — средства передачи информации, рассчитанные на массовую аудиторию: печать, радио, телевидение и т.п.

МЕЛАНХОЛИК — человек, чье поведение характеризуется замедленностью реакций на действующие стимулы, а также речевых, мыслительных и двигательных процессов.

МЕЧТЫ — планы человека на будущее, представленные в его воображении и реализующие наиболее важные для него потребности и интересы.

МИМИКА — совокупность движений частей лица человека, выражающих его состояние или отношение к тому, что он воспринимает (представляет, обдумывает, припоминает и т.п.).

МОДАЛЬНОСТЬ — понятие, обозначающее качество ощущений, возникающих под действием определенных раздражителей.

МОТИВ ВЛАСТИ — устойчивая черта личности, выражающая собой потребность одного человека в обладании властью над другими людьми, стремление господствовать, управлять, распоряжаться ими.

МОТИВ — внутренняя устойчивая психологическая причина поведения или поступка человека.

МОТИВ ДОСТИЖЕНИЯ УСПЕХА — потребность добиваться успехов в разных видах деятельности, рассматриваемая как устойчивая личностная черта.

МОТИВ ИЗБЕГАНИЯ НЕУДАЧИ — более или менее устойчивое стремление человека избегать неудач в тех ситуациях жизни, где результаты его деятельности оцениваются другими людьми. М.и.н. — черта личности, противоположная мотиву достижения успехов.

МОТИВАЦИЯ — динамический процесс внутреннего, психологического и физиологического управления поведением, включающий его инициацию, направление, организацию, поддержку.

МОТИВИРОВКА — разумное обоснование, объяснение самим человеком его поступков, которое не всегда соответствует истине.

МЫШЛЕНИЕ — психологический процесс познания, связанный с открытием субъективно нового знания, с решением задач, с творческим преобразованием действительности.


НАБЛЮДЕНИЕ — метод психологического исследования, рассчитанный на непосредственное получение нужной информации через органы чувств.

НАВЫК — сформированное, автоматически осуществляемое движение, не требующее сознательного контроля и специальных волевых усилий для его выполнения.

НАГЛЯДНО-ДЕЙСТВЕННОЕ МЫШЛЕНИЕ — способ практического решения задач, предполагающий зрительное изучение ситуации и практические действия в ней с материальными предметами.

НАГЛЯДНО-ОБРАЗНОЕ МЫШЛЕНИЕ — способ решения задач, включающий наблюдение за ситуацией и оперирование образами составляющих ее предметов без практических действий с ними.

НАДЕЖНОСТЬ — качество научного метода исследования, позволяющее получать одни и те же результаты при повторном или многократном использовании данного метода.

НАМЕРЕНИЕ — сознательное желание, готовность что-либо сделать.

НАПРАВЛЕННОСТЬ ЛИЧНОСТИ — понятие, обозначающее совокупность потребностей и мотивов личности, определяющих главное направление ее поведения.

НАПРЯЖЕННОСТЬ — состояние повышенного физического или психологического возбуждения, сопровождаемое неприятными внутренними чувствами и требующее разрядки.

НАСТРОЕНИЕ — эмоциональное состояние человека, связанное со слабо выраженными положительными или отрицательными эмоциями и существующее в течение длительного времени.

НАУЧЕНИЕ — приобретение знаний, умений и навыков в результате жизненного опыта.

НЕВРОТИЗМ — свойство человека, характеризующееся его повышенной возбудимостью, импульсивностью и тревожностью.

НЕГАТИВИЗМ — демонстративное противодействие человека другим людям, непринятие им разумных советов со стороны других людей. Часто встречается у детей в период возрастных кризисов.

НЕЙРОПСИХОЛОГИЯ — отрасль психологической науки, изучающая связь психических процессов, свойств и состояний с работой мозга.

НОРМЫ СОЦИАЛЬНЫЕ — принятые в данном обществе или группе правила поведения, регулирующие взаимоотношения людей.


ОБРАЗ — обобщенная картина мира (предметов, явлений), складывающаяся в результате переработки информации о нем, поступающей через органы чувств.

ОБРАТНАЯ СВЯЗЬ — процесс получения информации о состояниях партнера по общению с целью улучшения общения и достижения желаемого результата.

ОБЩЕНИЕ — обмен информацией между людьми, их взаимодействие.

ОБЫДЕННОЕ СОЗНАНИЕ — усредненный уровень сознания масс людей, составляющих данное общество. О.с. отличается от научного сознания невысокой достоверностью и точностью имеющихся в нем сведений.

ОБЪЕКТИВАЦИЯ — процесс и результат локализации образов восприятия во внешнем мире — там, где располагается источник воспринимаемой информации.

ОДАРЕННОСТЬ — наличие у человека задатков к развитию способностей.

ОЖИДАНИЕ — одно из основных понятий когнитивной психологии, выражающее способность предвосхищения человеком будущих событий.

ОНТОГЕНЕЗ — процесс индивидуального развития организма или личности.

ОПЕРАТИВНАЯ ПАМЯТЬ — вид памяти, рассчитанный на сохранение информации в течение определенного времени, необходимого для выполнения некоторого действия или операции.

ОПЕРАЦИЯ — система движений, связанных с выполнением конкретного действия, направленных на достижение его цели.

ОПРЕДМЕЧИВАНИЕ — диалектико-материалистическое понятие, обозначающее процесс и результат воплощения в предметах деятельности человека, составляющих материальную и духовную культуру, его же способностей.

ОПРОС — метод психологического изучения, в процессе применения которого людям задаются вопросы и на основе ответов на них судят о психологии этих людей.

ОПРОСНИК ЛИЧНОСТНЫЙ — метод исследования личности, основанный на использовании системы письменных или устных, заранее продуманных вопросов, адресованных человеку, чьи психологические особенности подлежат изучению.

ОРИЕНТИРОВОЧНАЯ РЕАКЦИЯ (РЕФЛЕКС) — реакция организма на новые стимулы, проявляющаяся в общей его активизации, в сосредоточении внимания, в мобилизации сил и ресурсов.

ОСМЫСЛЕННОСТЬ ВОСПРИЯТИЯ — свойство человеческого восприятия приписывать воспринимаемому объекту или явлению определенный смысл, обозначать его словом, относить к определенной языковой категории.

ОТКЛОНЯЮЩЕЕСЯ (ДЕВИАНТНОЕ) ПОВЕДЕНИЕ — поведение человека, отклоняющееся от установленных правовых или нравственных норм, нарушающее их.

ОТРАЖЕНИЕ — философско-гносеологическое понятие, относящееся к теории познания. В соответствии с ним все психические процессы и состояния человека рассматриваются как отражения в голове человека объективной, не зависимой от него действительности.

ОТЧУЖДЕНИЕ — процесс или результат утраты для человека значения или личностного смысла того, что раньше привлекало его внимание, было для него интересным и важным.

ОЩУЩЕНИЕ — элементарный психический процесс, представляющий собой субъективное отражение живым существом в виде психических явлений простейших свойств окружающего мира.


ПАМЯТЬ — процессы запоминания, сохранения, воспроизводства и переработки человеком разнообразной информации.

ПАМЯТЬ ГЕНЕТИЧЕСКАЯ — память, обусловленная генотипом, передаваемая из поколения в поколение.

ПАМЯТЬ ДОЛГОВРЕМЕННАЯ — память, рассчитанная на длительное хранение и многократное воспроизведение информации при условии ее сохранения.

ПАМЯТЬ КРАТКОВРЕМЕННАЯ — память, рассчитанная на хранение информации в течение небольшого промежутка времени, от нескольких до десятков секунд, до тех пор, пока содержащаяся в ней информация не будет использована или переведена в долговременную память.

ПАНИКА — массовидное явление психики, характеризующееся возникновением одновременно у многих людей, находящихся в контактах друг с другом, чувств страха, беспокойства, а также беспорядочных, хаотичных движений и непродуманных действий.

ПАНТОМИМИКА — система выразительных движений, совершаемых при помощи тела.

ПЕРВИЧНЫЕ ДАННЫЕ — та информация об изучаемых явлениях, которая получается в начале исследования и подлежит дальнейшей обработке прежде, чем на ее основе можно будет сделать достоверные выводы об этих явлениях.

ПЕРВИЧНЫЕ ЭМОЦИИ — генотипически (см. генотип) обусловленные простейшие эмоциональные переживания: удовольствие, неудовольствие, боль, страх, гнев и др.

ПЕРЕЖИВАНИЕ — ощущение, сопровождаемое эмоциями.

ПЕРСОНАЛИЗАЦИЯ — процесс превращения человека в личность (см.), приобретения им индивидуальности.

ПЕРЦЕПТИВНЫЙ — относящийся к восприятию.

ПОДРАЖАНИЕ — сознательное или бессознательное поведение человека, направленное на воспроизведение поступков и действий других людей.

ПОЛОРОЛЕВОЕ ПОВЕДЕНИЕ — поведение, свойственное человеку определенного пола в той социальной роли, которая соответствует этому полу.

ПОНИМАНИЕ — психологическое состояние, выражающее собой правильность принятого решения и сопровождаемое чувством уверенности в точности восприятия или интерпретации какого-либо события, явления, факта.

ПОСТУПОК — сознательно совершенное человеком и управляемое волей действие, исходящее из определенных убеждений.

ПОТРЕБНОСТЬ — состояние нужды организма, индивида, личности в чем-то, необходимом для их нормального существования.

ПРАКТИЧЕСКОЕ МЫШЛЕНИЕ — вид мышления, направленного на решение практических задач.

ПРЕДМЕТНОСТЬ ВОСПРИЯТИЯ — свойство восприятия представлять мир не в виде отдельных ощущений, а в форме целостных образов, относящихся к воспринимаемым предметам.

ПРЕДРАССУДОК — устойчивое ошибочное мнение, не подкрепляемое фактами и логикой, основанное на вере.

ПРЕДСОЗНАНИЕ — психическое состояние человека, занимающее промежуточное место между сознанием и бессознательным. Характеризуется наличием смутного осознания переживаемого, но отсутствием волевого контроля или способности им управлять.

ПРЕДСТАВЛЕНИЕ — процесс и результат воспроизводства в виде образа какого-либо объекта, события, явления.

ПРИВЫКАНИЕ — прекращение или снижение остроты реагирования на еще продолжающий действовать раздражитель.

ПРОЕКЦИЯ — один из защитных механизмов, посредством которого человек избавляется от переживаний по поводу собственных недостатков за счет приписывания их другим людям.

ПРОСОЦИАЛЬНОЕ ПОВЕДЕНИЕ — поведение человека среди людей, бескорыстно направленное на их благо.

ПСИХИКА — общее понятие, обозначающее совокупность всех психических явлений, изучаемых в психологии.

ПСИХИЧЕСКИЕ ПРОЦЕССЫ — процессы, происходящие в голове человека и отражающиеся в динамически изменяющихся психических явлениях: ощущениях, восприятии, воображении, памяти, мышлении, речи и др.

ПСИХОЛОГИЧЕСКАЯ СОВМЕСТИМОСТЬ ЛЮДЕЙ — способность людей находить взаимопонимание, налаживать деловые и личные контакты, сотрудничать друг с другом.

ПСИХОТЕРАПИЯ — комплексное психологическое воздействие врача на психику больного посредством слова. Целью психотерапии является устранение болезненных симптомов, изменение отношения к себе, своему состоянию и окружающей среде. Психотерапия в широком смысле охватывает всю область общения врача и больного. Врач любого профиля, общаясь с больным, оказывает на него психологическое воздействие. Беседуя с больным, врач стремится оценить его душевное состояние, понять и выяснить причины, приведшие к ухудшению психологического состояния пациента. Основу всех психотерапевтических методик составляют внушение и разъяснение, предлагаемые в различных соотношениях и последовательности.


РАЗДРАЖИМОСТЬ — способность живых организмов биологически целесообразно (с целью самосохранения и развития) реагировать на значимые для их жизни воздействия среды.

РАССЕЯННОСТЬ — неспособность внимания сконцентрироваться на объекте.

РЕАКЦИЯ — ответ организма на какой-нибудь раздражитель.

РЕЛАКСАЦИЯ — расслабление.

РЕФЕРЕНТНАЯ ГРУППА — группа людей, в чем-то привлекательных для индивида. Групповой источник индивидуальных ценностей, суждений, поступков, норм и правил поведения.

РЕФЕРЕНТОМЕТРИЯ — методика, позволяющая выяснить степень значимости каждого члена группы для его товарищей по сообществу, выявить, с одной стороны, тех, на чье мнение в данной общности ориентировано большинство ее членов, а с другой — тех, чья позиция по тому или иному вопросу практически всем безразлична.

РЕФЛЕКС — автоматическая ответная реакция организма на действие какого-либо внутреннего или внешнего раздражителя.

РЕФЛЕКСИЯ — способность сознания человека сосредоточиться на самом себе.

РЕЧЬ — система используемых человеком звуковых сигналов, письменных знаков и символов для представления, переработки, хранения и передачи информации.

РЕШИТЕЛЬНОСТЬ — готовность перейти к практическим действиям, сформировавшееся намерение совершить определенный поступок.

РИГИДНОСТЬ — заторможенность мышления, проявляющаяся в трудности отказа человека от однажды принятого решения, способа мышления и действий.

РОЛЬ — понятие, обозначающее поведение человека в определенной жизненной ситуации, соответствующей занимаемому им положению (например, роль руководителя, подчиненного, отца, матери и т.п.).


САМОАКТУАЛИЗАЦИЯ — использование, и развитие человеком имеющихся у него задатков, их превращение в способности. Стремление к личностному самосовершенствованию. С. как понятие введена в гуманистической психологии.

САМОВНУШЕНИЕ — процесс, направленный на внушение самому себе представлений, мыслей, чувств, способствующих устранению болезненных явлений и улучшению общего самочувствия.

САМООБЛАДАНИЕ — способность человека сохранять внутреннее спокойствие, действовать разумно и взвешенно в сложных жизненных ситуациях.

САМООПРЕДЕЛЕНИЕ ЛИЧНОСТИ — самостоятельный выбор человеком своего жизненного пути, целей, ценностей, нравственных норм, будущей профессии и условий жизни.

САМООЦЕНКА — оценка человеком собственных качеств, достоинств и недостатков.

САМОРЕГУЛЯЦИЯ — процесс управления человеком собственными психологическими и физиологическими состояниями, а также поступками.

САМОСОЗНАНИЕ — осознание человеком самого себя, своих собственных качеств.

САНГВИНИК — тип темперамента, характеризующийся энергичностью, повышенной работоспособностью и быстротой реакций.

СВОЙСТВА НЕРВНОЙ СИСТЕМЫ ЧЕЛОВЕКА — комплекс физических характеристик нервной системы, определяющих процессы возникновения, проведения, переключения и прекрашения нервных импульсов в различных отделах и частях центральной нервной системы.

СЕНЗИТИВНЫЙ ПЕРИОД РАЗВИТИЯ — период в жизни человека, обеспечивающий наиболее благоприятные условия для формирования у него определенных психологических свойств и видов поведения.

СЕНСИБИЛИЗАЦИЯ — повышение чувствительности органов чувств под влиянием воздействия на них определенных раздражителей, в частности тех, которые поступают в это же самое время на другие органы чувств (к примеру — увеличение остроты зрения под воздействием слуховых раздражителей).

СЕНСОРНЫЙ — связанный с работой органов чувств.

СИЛА НЕРВНОЙ СИСТЕМЫ — свойство нервной системы выдерживать длительные и большие нагрузки.

СИМВОЛ — знак чего-либо, имеющий определенное сходство с обозначаемым объектом.

СИМПАТИЯ — чувство эмоциональной предрасположенности к человеку, повышенный интерес и влечение к нему.

СИНЕСТЕЗИЯ — способность раздражителя, адресованного природой для него приспособленному органу чувств, одновременно вызывать необычное ощущение в другом органе чувств. Например, при восприятии музыки у некоторых людей могут возникать зрительные ощущения.

СКЛОННОСТЬ — предрасположенность к чему-либо.

СЛОВЕСНО-ЛОГИЧЕСКОЕ МЫШЛЕНИЕ — вид мышления человека, где в качестве средства решения задачи выступают словесное абстрагирование и логические рассуждения.

СМЫСЛ ЛИЧНОСТНЫЙ — значение, которое объект, событие, факт или слово приобретают для данного человека в результате его личного жизненного опыта. Понятие С.л. введено А. Н .Леонтьевым.

СОВЕСТЬ — понятие, обозначающее способность человека переживать, глубоко личностно воспринимать и сожалеть о случаях нарушения им самим или другими людьми нравственных норм. С. характеризует личность, достигшую высокого уровня психологического развития.

СОВМЕСТИМОСТЬ — способность людей работать вместе, успешно решать задачи, требующие от них согласованности действий и хорошего взаимопонимания.

СОЗНАНИЕ — высший уровень психического отражения человеком действительности, ее представленность в виде обобщенных образов и понятий.

СОПЕРЕЖИВАНИЕ — испытывание человеком тех же самых чувств и эмоций, которые характерны для находящихся рядом с ним людей (см. также эмпатия).

СОПЕРНИЧЕСТВО — стремление человека к соревнованию с другими людьми, желание одержать верх над ними, победить, превзойти.

СОСРЕДОТОЧЕННОСТЬ — сконцентрированность внимания человека.

СОТРУДНИЧЕСТВО — стремление человека к согласованной, слаженной работе с людьми. Готовность поддержать и оказать помощь им. Противоположно соперничеству.

СОХРАНЕНИЕ — один из процессов памяти, направленный на удержание в ней полученной информации.

СОЦИАЛЬНО-ПСИХОЛОГИЧЕСКИЙ ТРЕНИНГ — теория и практика специального психотерапевтического воздействия на людей, рассчитанная на улучшение их общения и приспособление к условиям жизни.

СОЦИАЛЬНЫЕ ОЖИДАНИЯ — ожидаемые от человека, занимающего в обществе определенное положение, суждения, действия и поступки, соответствующие его социальной роли.

СОЦИАЛЬНЫЙ СТЕРЕОТИП — искаженные социальные установки человека в отношении людей определенной категории, возникшие у него под влиянием ограниченного или одностороннего жизненного опыта общения с представителями данной социальной группы: национальной, религиозной, культурной и т.п.

СОЦИОМЕТРИЯ — совокупность однотипно построенных методик, предназначенных для выявления и представления в виде социограмм и ряда специальных индексов системы личных взаимоотношений между членами малой группы.

СПЛОЧЕННОСТЬ МАЛОЙ ГРУППЫ — психологическая характеристика единства членов малой группы.

СПОСОБНОСТИ — индивидуальные особенности людей, от которых зависит приобретение ими знаний, умений и навыков, а также успешность выполнения различных видов деятельности.

СТАТУС — положение человека в системе внутригрупповых отношений, определяющее степень его авторитета в глазах остальных участников группы.

СТИЛЬ ЛИДЕРСТВА — характеристика отношений, складывающихся между лидером и ведомыми. Способы и средства, применяемые лидером для оказания нужного воздействия на зависящих от него людей.

СТРЕМЛЕНИЕ — желание и готовность действовать определенным образом.

СТРЕСС — состояние душевного (эмоционального) и поведенческого расстройства, связанное с неспособностью человека целесообразно и разумно действовать в сложившейся ситуации.

СУБЪЕКТИВНЫЙ — относящийся к человеку — субъекту.

СХЕМА МЫШЛЕНИЯ — система понятий или логика рассуждений, привычно применяемых человеком при встрече с незнакомым объектом или новой задачей.


ТАЛАНТ — высокий уровень развития способностей человека, обеспечивающий достижение выдающихся успехов в том или ином виде деятельности.

ТВОРЧЕСКОЕ МЫШЛЕНИЕ — вид мышления, связанный с созданием или открытием чего-либо нового.

ТЕМПЕРАМЕНТ — динамическая характеристика психических процессов и поведения человека, проявляющаяся в их скорости, изменчивости, интенсивности и других характеристиках.

ТЕОРИЯ ДЕЯТЕЛЬНОСТИ — психологическая теория, рассматривающая психические процессы человека как виды внутренней деятельности, происходящей из внешней и имеющей структуру, аналогичную внешней деятельности. Т.д. разработана А.Н.Леонтьевым.

ТЕСТ — стандартизированная психологическая методика, предназначенная для сравнительной количественной оценки у человека изучаемого психологического качества.

ТЕСТИРОВАНИЕ — процедура применения тестов на практике.

ТРЕВОЖНОСТЬ — свойство человека приходить в состояние повышенного беспокойства, испытывать страх и тревогу в специфических социальных ситуациях.


УБЕЖДЕННОСТЬ — уверенность человека в своей правоте, подтверждаемая соответствующими аргументами и фактами.

УЗНАВАНИЕ — отнесение воспринимаемого объекта к категории уже известных.

УМЕНИЕ — способность выполнять определенные действия с хорошим качеством и успешно справляться с деятельностью, включающей эти действия.

УМОЗАКЛЮЧЕНИЕ — процесс логического вывода определенного положения из некоторых достоверных утверждений — посылок.

УРОВЕНЬ ПРИТЯЗАНИЙ — максимальный успех, которого рассчитывает добиться человек в том или ином виде деятельности.

УСТАНОВКА — готовность, предрасположенность к определенным действиям или реакциям на конкретные стимулы.

УТОМЛЕНИЕ — состояние усталости, сопровождаемое— (см. аутизм, воображение, грезы, мечты).


ФАМИЛЬЯРНЫЙ — преувеличенно непринужденный, развязный, бесцеремонный.

ФЛЕГМАТИК — тип темперамента человека, характеризующийся пониженной реактивностью, слабо развитыми, замедленными выразительными движениями.

ФРУСТРАЦИЯ — эмоционально тяжелое переживание человеком своей неудачи, сопровождающееся чувством безысходности, крушения надежд в достижении определенной желаемой цели.


ХАРАКТЕР — совокупность свойств личности, определяющих типичные способы ее реагирования на жизненные обстоятельства.


ЦЕНЗУРА — психоаналитическое понятие, обозначающее подсознательные психологические силы, которые стремятся не допустить в сознание определенные мысли, чувства, образы, желания.

ЦЕННОСТИ — то, что человек особенно ценит в жизни, чему он придает особый, положительный жизненный смысл.

ЦЕНТРАЛЬНАЯ НЕРВНАЯ СИСТЕМА — часть нервной системы, включающая головной, промежуточный и спинной мозг.

ЦЕНТРАЛЬНЫЙ — характеристика нервных процессов, происходящих на высших уровнях центральной нервной системы.


ЧЕРТА ЛИЧНОСТИ — устойчивое свойство личности, определяющее характерное для нее поведение и мышление.

ЧЕСТОЛЮБИЕ — стремление человека к успехам, рассчитанное на повышение его авторитета и признание со стороны окружающих.

ЧУВСТВИТЕЛЬНОСТЬ — способность организма запоминать и реагировать на воздействия среды, не имеющие непосредственного биологического значения, но вызывающие психологическую реакцию в форме ощущений.

ЧУВСТВО — высшая, культурно обусловленная эмоция человека, связанная с некоторым социальным объектом.


ЭГОЦЕНТРИЗМ — сосредоточенность сознания и внимания человека исключительно на самом себе, сопровождающаяся игнорированием того, что происходит вокруг.

ЭКСТРАВЕРСИЯ — обращенность сознания и внимания человека в основном на то, что происходит вокруг него. Экстраверсия противоположна интроверсии.

ЭМОЦИИ — элементарные переживания, возникающие у человека под влиянием общего состояния организма и хода процесса удовлетворения актуальных потребностей.

ЭМОЦИОНАЛЬНОСТЬ — характеристика личности, проявляющаяся в частоте возникновения разнообразных эмоций и чувств.

ЭМПАТИЯ — способность человека к сопереживанию и сочувствию другим людям, к пониманию их внутренних состояний.

ЭФФЕРЕНТНЫЙ — процесс, направленный изнутри наружу, от центральной нервной системы к периферии тела.


ЮРИДИЧЕСКАЯ ПСИХОЛОГИЯ — отрасль психологической науки, изучающая психические процессы, явления и состояния людей, участвующих в восприятии, следовании юридическим нормам. В Ю.п. исследуются также явления, связанные с производством дознания, судом и исправлением осужденных.
';

//echo $str;

if (!function_exists('mb_ucfirst') && function_exists('mb_substr')) {
    function mb_ucfirst($string) {
        $string = mb_strtoupper(mb_substr($string, 0, 1)) . mb_substr($string, 1);
        return $string;
    }
}

preg_match_all('/^(.*?)—(.*?)$/sum', $str, $matches, PREG_SET_ORDER);

echo "<table>";
foreach ($matches as $val) {
    echo "<tr>";
    echo "<td>".mb_ucfirst(mb_strtolower(trim($val[1])))."</td>";
    echo "<td>".mb_strtolower(trim($val[1]))."</td>";
    echo "<td>".trim($val[2])."</td>";
    echo "</tr>";
		
}
echo "</table>";
?>



<?require($_SERVER["DOCUMENT_ROOT"]."/bitrix/footer.php");?>